{
	"baseitem": [],
	"itemProperty": [
		{
			"abbreviation": "vers",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Versatile",
					"entries": [
						"This can be used with one or two hands. A damage value in parentheses appears with the property—the damage when the weapon is used with two hands to make a melee attack."
					]
				}
			],
			"template": "{{prop_name}} ({{item.dmg2}})"
		},
		{
			"abbreviation": "iron",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Iron-Based Armor",
					"entries": [
						"<br>This armor is made out of a high percentage iron. Because of this, this armor gains high amounts of DR against any form of {@color energenetic damage|dd00dd}, and changes all taken {@damage energenetic damage} to {@damage heat} damage."
					]
				}
			],
			"template": "<br>{{prop_name}} ({{item.edr}}DR vs energenetic damage)"
		},
		{
			"abbreviation": "ammofire",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Ammunition Firing",
					"entries": [
						"<br>You can use a weapon that has the ammunition property to make a ranged attack only if you have ammunition to fire from the weapon. Each time you attack with the weapon, you expend one piece of ammunition. Drawing the ammunition from a quiver, case, or other container is part of the attack. Loading a one-handed weapon requires a free hand. The ammunition of a firearm is destroyed upon use.",
						"If you use a weapon that has the ammunition property to make a melee attack, you treat the weapon as an improvised weapon. A sling must be loaded to deal any damage when used in this way."
					]
				}
			]
		},
		{
			"abbreviation": "craftable",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Craftable Only",
					"entries": [
						"<br>This item cannot be aquired by shops or by other normal means.<br>This item can only be crafted and maintained by an Engineer with the required ability, or could be gotten (possibly without the maintenance requirements) by other special means."
					]
				}
			]			

		}
	],
	"itemType": [],
	"itemEntry": [
		{
			"name": "Ring of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"You have resistance to {{item.resist}} damage while wearing this ring. The ring is set with {{item.detail1}}."
			]
		},
		{
			"name": "Armor of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"You have resistance to {{item.resist}} damage while you wear this armor."
			]
		},
		{
			"name": "Potion of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"When you drink this potion, you gain resistance to {{item.resist}} damage for 1 hour."
			]
		}
	],
	"itemTypeAdditionalEntries": [
		{
			"appliesTo": "INS",
			"entries": [
				"Proficiency with a musical instrument indicates you are familiar with the techniques used to play it. You also have knowledge of some songs commonly performed with that instrument.",
				{
					"type": "entries",
					"name": "History",
					"entries": [
						"Your expertise aids you in recalling lore related to your instrument."
					]
				},
				{
					"type": "entries",
					"name": "Performance",
					"entries": [
						"Your ability to put on a good show is improved when you incorporate an instrument into your act."
					]
				},
				{
					"type": "entries",
					"name": "Compose a Tune",
					"entries": [
						"As part of a long rest, you can compose a new tune and lyrics for your instrument. You might use this ability to impress a noble or spread scandalous rumors with a catchy tune."
					]
				},
				{
					"type": "table",
					"caption": "Musical Instrument",
					"colLabels": [
						"Activity",
						"DC"
					],
					"colStyles": [
						"col-10",
						"col-2 text-center"
					],
					"rows": [
						[
							"Identify a tune",
							"10"
						],
						[
							"Improvise a tune",
							"20"
						]
					]
				}
			]
		},
		{
			"appliesTo": "GS",
			"entries": [
				"Proficiency with a gaming set applies to one type of game, such as Three-Dragon Ante or games of chance that use dice.",
				{
					"type": "entries",
					"name": "Components",
					"entries": [
						"A gaming set has all the pieces needed to play a specific game or type of game, such as a complete deck of cards or a board and tokens."
					]
				},
				{
					"type": "entries",
					"name": "History",
					"entries": [
						"Your mastery of a game includes knowledge of its history, as well as of important events it was connected to or prominent historical figures involved with it."
					]
				},
				{
					"type": "entries",
					"name": "Insight",
					"entries": [
						"Playing games with someone is a good way to gain understanding of their personality, granting you a better ability to discern their lies from their truths and read their mood."
					]
				},
				{
					"type": "entries",
					"name": "Sleight of Hand",
					"entries": [
						"Sleight of Hand is a useful skill for cheating at a game, as it allows you to swap pieces, palm cards, or alter a die roll. Alternatively, engrossing a target in a game by manipulating the components with dexterous movements is a great distraction for a pickpocketing attempt."
					]
				},
				{
					"type": "table",
					"caption": "Gaming Set",
					"colLabels": [
						"Activity",
						"DC"
					],
					"colStyles": [
						"col-10",
						"col-2 text-center"
					],
					"rows": [
						[
							"Catch a player cheating",
							"15"
						],
						[
							"Gain insight into an opponent's personality",
							"15"
						]
					]
				}
			]
		}
	]
}
