{
	"data": [
		{
			"type": "section",
			"name": "Introduction",
			"page": 3,
			"entries": [
				"This book is meant as a well -deserved change of pace of normal D&D. It is a big modification that changes most things one way or another. An attempt has been made to keep the general idea and foundation the same. Because of this, it is highly recommended to have played normal D&D at least a few times and know what you are doing before running this modified version, and it is even higherly recommended to read this Handbook first to find out what you can expect and how it differs from normal D&D. There will almost exclusively be changes from the original in this manual, and as few direct carbon copies of the original D&D Players Handbook as possible with the idea in mind that everything should be clear and understandable.",
				"This modification changed D&D into a hyper futuristic sci -fi setting with a giant mix of different fandoms and quite a lot of original stuff as well. It is meant to be played with as much freedom that you can give your players, especially in the character creation part. Most things in this manual are meant to be taken literally, and as the general ruleset. If a player thinks of something that the book doesn’t say can’t be done, than you can expect it to be a legal thing to do according to the rules except if the DM thinks it will ruin things completely. This is the general idea of this book, most things in this book are about examples of what can be done, or hard rules about what can’t be done.",
				"If you would DM this modification, than it is also highly recommended to read the DM manual for this as well as it explains the world and logic behind things in more depth. If you are going to DM this modified foundation in any setting, knowing the behind the scenes stuff and knowing the logic of how it is meant to deal with unconventional things is almost necessary, as quite some things and ideas of balancing depend on the DM being someone who knows what they are doing.",
				"Also, the unit system in this modification is the metric system. So distance is in meters, temperature in Kelvin or degrees Celsius, weight in kilogram, etc. ."],
			"id": "intocdph"
		},
		{
			"type": "section",
			"name": "General Premise",
			"page": 3,
			"entries": [
			"Collateral Damage is a name that has been created for a multi2verse. There are many different universes and connections between them, and adventure can be found in most of them, but chances are that your campaign will be set in the main timestream, which is basically the multiverse hub. Technically there are multiple multiverses, but I won’t go into that in the Player Handbook. The rest of this premise is about the main timestream.",
			"The universe is big, really big in fact, although it isn’t infinite. The universe loops into itself creating closed space lines. More than half of this universe is controlled by the United Federation.",
			"The United Federation is a group of civilizations that have agreed to cooperation and to avoid any form of aggression toward each other as much as possible. Most civilizations are in this Federation, and only a few small ones didn’t agree to the terms or beliefs of the United Federation. The United Federation’s three candidates with the most power are the Gem Empire, the Human Federation and the IDPD.",
			"The Gem Empire is a giant volume of space controlled by Gems, a former totalitarian dictatorship turned more diplomatic and free. The Human Federation on the other hand is a giant group of smaller states controlled by humans. The whole these states form has its own council which makes decisions Federation wide, and is the main communication point for the United Federation.",
			"The IDPD, also known as the Inter Dimensional Police Department, is a group of self-proclaimed protectors of the multiverse which have one artificial star system called the strip, named after the mobius strip because their “planet” is an artificial mobius loop around their star.",
			"The IDPD is probably the best known group in the multiverse. Most states have a love-hate relationship with them, as they actively try to keep the multiverse safe and because they improve technology most of which is fully free to read and use, but they also enforce a few rules on everyone, and they are a horrific force to be reckoned with. The IDPD gets most of its power because of its technology as the technology they personally use is far more advanced than any other. A reasonable fraction of the stuff they put out for everyone to use to make life easier and more sustainable is already too advanced for most civilizations to practically use. There is only one group which could be argued to be more powerful than IDPD which is called the Dark Brotherhood, and they have a good working relationship with the IDPD to the point of active and daily cooperation."],
			"id": "genprem"
		},
		{
			"type": "section",
			"name": "General Change of Rules",
			"page": 5,
			"data": {"quickref":1},
			"entries": [
				{
					"type": "entries",
					"name": "Advantage & Disadvantage",
					"page": 5,
					"entries": [
						"Advantage is a bonus given to rolls because of the ability to do the given roll easier. If you get Advantage on a roll, than this means you roll an extra die, and take the highest number. Disadvantage is the complete opposite, still making you roll and extra die, but making you take the lowest number.<br>If you get Advantage multiple times, than this will stack. If you have triple Advantage for example, than you would need to roll four dice and take the highest one.<br>If you get Advantage on a roll of multiple dice, than the rule stays the same, and you roll one extra dice. For example, you have Advantage on a 3D4 damage roll. Than this would mean you roll 4D4 instead, and take the highest three numbers out of the four dice as your damage. If you have Advantage on a roll with multiple different dice, like 1D4+1D6, than this applies to both dice, letting your roll 2D4 and 2D6 taking the highest D4 and highest D6 roll.<br>If you have Advantage and Disadvantage on a roll, than these cancel each other out, letting you roll normally. If you have double Disadvantage and a single Advantage on a roll, than this negates one Disadvantage making you roll only one extra dice instead of two or three, and this applies to any amount of Advantages and Disadvantages on a roll of course."
					],
					"id": "gencor0"
				},
				{
					"type": "entries",
					"name": "Combat",
					"page": 5,
					"entries": [
						"Combat it its own thing in D&D, and in this modification it has changed a bit. I will explain all the changes in their respective parts, except for one: turns.<br>Turns in normal D&D are based around 6 seconds. This has been halved to 3 seconds. Also, when starting a campaign, you can choose to accept individual Initiative, letting everyone have their own separate turn in a row, or have sided Initiative, letting all the sides of the fight have one roll for their whole group, and not having a specific sequence within these groups.<br>When choosing sided Initiative, the group makes one roll with a Initiative Bonus equal to the Root Mean Square of the groups Initiative Bonusses.<br>Also, for combat as a general rule of thumb: Every creature has one Action, one Bonus Action, one Reaction and any amount of Free Actions unless they have an ability that says otherwise.<br>Also, the bonus for attack rolls is always your Dexterity Modifier."
					],
					"id": "gencor1"
				},
				{
					"type": "entries",
					"name": "Armor Class",
					"page": 5,
					"entries": [
						"Armor Class, also known as AC, is based on the chance that you are actually hit on a location that would do damage. If an attack roll is higher than the opponents AC, then said attack is a hit.<br>The natural AC of Player Characters is 8, and can be increased with different things including Armor, Cover, and Species Bonusses."]
				},
				{
					"type": "entries",
					"name": "3. Determine Ability Scores",
					"page": 12,
					"entries": [
						"Much of what your character does in the game depends on his or her six abilities: {@b Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma.} Each ability has a score, which is a number you record on your character sheet.",
						"The six abilities and their use in the game are described in chapter 7. The Ability Score Summary table provides a quick reference for what qualities are measured by each ability, what races increases which abilities, and what classes consider each ability particularly important.",
						"You generate your character's six {@b ability scores} randomly. Roll four 6-sided dice and record the total of the highest three dice on a piece of scratch paper. Do this five more times, so that you have six numbers. If you want to save time or don't like the idea of randomly determining ability scores, you can use the following scores instead: 15, 14, 13, 12, 10, 8.",
						"Now take your six numbers and write each number beside one of your character's six abilities to assign scores to Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma. Afterward, make any changes to your ability scores as a result of your race choice.",
						"After assigning your ability scores, determine your {@b ability modifiers} using the Ability Scores and Modifiers table. To determine an ability modifier without consulting the table, subtract 10 from the ability score and then divide the result by 2 (round down). Write the modifier next to each of your scores.",
						{
							"type": "table",
							"caption": "Ability Score Summary",
							"colStyles": [
								"col-12"
							],
							"rows": [
								[
									"{@b Strength}"
								],
								[
									{
										"type": "entries",
										"entries": [
											"{@i Measures:} Natural athleticism, bodily power",
											"{@i Important for:} Barbarian, fighter, paladin",
											"{@filter Races that have a bonus to Strength|races|Ability Bonus (Including Subrace)=Strength +any}"
										],
										"id": "019"
									}
								]
							],
							"data": {
								"tableIgnore": true
							}
						},
						{
							"type": "table",
							"caption": "Ability Score Summary",
							"colStyles": [
								"col-12"
							],
							"rows": [
								[
									"{@b Dexterity}"
								],
								[
									{
										"type": "entries",
										"entries": [
											"{@i Measures:} Physical agility, reflexes, balance, poise",
											"{@i Important for:} Monk, ranger, rogue",
											"{@filter Races that have a bonus to Dexterity|races|Ability Bonus (Including Subrace)=Dexterity +any}"
										],
										"id": "01a"
									}
								]
							],
							"data": {
								"tableIgnore": true
							}
						},
						{
							"type": "table",
							"caption": "Ability Score Summary",
							"colStyles": [
								"col-12"
							],
							"rows": [
								[
									"{@b Constitution}"
								],
								[
									{
										"type": "entries",
										"entries": [
											"{@i Measures:} Health, stamina, vital force",
											"{@i Important for:} Everyone",
											"{@filter Races that have a bonus to Constitution|races|Ability Bonus (Including Subrace)=Constitution +any}"
										],
										"id": "01b"
									}
								]
							],
							"data": {
								"tableIgnore": true
							}
						},
						{
							"type": "table",
							"caption": "Ability Score Summary",
							"colStyles": [
								"col-12"
							],
							"rows": [
								[
									"{@b Intelligence}"
								],
								[
									{
										"type": "entries",
										"entries": [
											"{@i Measures:} Mental acuity, information recall, analytical skill",
											"{@i Important for:} Wizard",
											"{@filter Races that have a bonus to Intelligence|races|Ability Bonus (Including Subrace)=Intelligence +any}"
										],
										"id": "01c"
									}
								]
							],
							"data": {
								"tableIgnore": true
							}
						},
						{
							"type": "table",
							"caption": "Ability Score Summary",
							"colStyles": [
								"col-12"
							],
							"rows": [
								[
									"{@b Wisdom}"
								],
								[
									{
										"type": "entries",
										"entries": [
											"{@i Measures:} Awareness, intuition, insight",
											"{@i Important for:} Cleric, druid",
											"{@filter Races that have a bonus to Wisdom|races|Ability Bonus (Including Subrace)=Wisdom +any}"
										],
										"id": "01d"
									}
								]
							],
							"data": {
								"tableIgnore": true
							}
						},
						{
							"type": "table",
							"caption": "Ability Score Summary",
							"colStyles": [
								"col-12"
							],
							"rows": [
								[
									"{@b Charisma}"
								],
								[
									{
										"type": "entries",
										"entries": [
											"{@i Measures:} Confidence, eloquence, leadership",
											"{@i Important for:} Bard, sorcerer, warlock",
											"{@filter Races that have a bonus to Charisma|races|Ability Bonus (Including Subrace)=Charisma +any}"
										],
										"id": "01e"
									}
								]
							],
							"data": {
								"tableIgnore": true
							}
						},
						{
							"type": "entries",
							"name": "Building Bruenor, Step 3",
							"page": 13,
							"entries": [
								"Bob decides to use the standard set of scores (15, 14, 13, 12, 10, 8) for Bruenor's abilities. Since he's a fighter, he puts his highest score, 15, in Strength. His next highest, 14, goes in Constitution. Bruenor might be a brash fighter, but Bob decides he wants the dwarf to be older, wiser, and a good leader, so he puts decent scores in Wisdom and Charisma. After applying his racial benefits (increasing Bruenor's Constitution by 2 and his Strength by 2), Bruenor's ability scores and modifiers look like this: Strength 17 (+3), Dexterity 10 (+0), Constitution 16 (+3), Intelligence 8 (-1), Wisdom 13 (+1), Charisma 12 (+1).",
								"Bob fills in Bruenor's final hit points: 10 + his Constitution modifier of +3, for a total of 13 hit points."
							],
							"id": "01f"
						},
						{
							"type": "entries",
							"name": "Variant: Customizing Ability Scores",
							"page": 13,
							"entries": [
								"At your Dungeon Master's option, you can use this variant for determining your ability scores. The method described here allows you to build a character with a set of ability scores you choose individually.",
								"You have 27 points to spend on your ability scores. The cost of each score is shown on the Ability Score Point Cost table. For example, a score of 14 costs 7 points. Using this method, 15 is the highest ability score you can end up with, before applying racial increases. You can't have a score lower than 8.",
								"This method of determining ability scores enables you to create a set of three high numbers and three low ones (15, 15, 15, 8, 8, 8), a set of numbers that are above average and nearly equal (13, 13, 13, 12, 12, 12), or any set of numbers between those extremes.",
								{
									"type": "table",
									"caption": "Ability Score Point Cost",
									"colLabels": [
										"Score",
										"Cost",
										"Score",
										"Cost"
									],
									"colStyles": [
										"col-3 text-center",
										"col-3 text-center",
										"col-3 text-center",
										"col-3 text-center"
									],
									"rows": [
										[
											"8",
											"0",
											"12",
											"4"
										],
										[
											"9",
											"1",
											"13",
											"5"
										],
										[
											"10",
											"2",
											"14",
											"7"
										],
										[
											"11",
											"3",
											"15",
											"9"
										]
									]
								},
								{
									"type": "table",
									"caption": "Ability Scores and Modifiers",
									"colLabels": [
										"Score",
										"Modifier",
										"Score",
										"Modifier"
									],
									"colStyles": [
										"col-3 text-center",
										"col-3 text-center",
										"col-3 text-center",
										"col-3 text-center"
									],
									"rows": [
										[
											"1",
											"-5",
											"16-17",
											"+3"
										],
										[
											"2-3",
											"-4",
											"18-19",
											"+4"
										],
										[
											"4-5",
											"-3",
											"20-21",
											"+5"
										],
										[
											"6-7",
											"-2",
											"22-23",
											"+6"
										],
										[
											"8-9",
											"-1",
											"24-25",
											"+7"
										],
										[
											"10-11",
											"+0",
											"26-27",
											"+8"
										],
										[
											"12-13",
											"+1",
											"28-29",
											"+9"
										],
										[
											"14-15",
											"+2",
											"30",
											"+10"
										]
									]
								}
							],
							"id": "020"
						}
					],
					"id": "018"
				},
				{
					"type": "entries",
					"name": "4. Describe Your Character",
					"page": 13,
					"entries": [
						"Once you know the basic game aspects of your character, it's time to flesh him or her out as a person. Your character needs a name. Spend a few minutes thinking about what he or she looks like and how he or she behaves in general terms.",
						"Using the information in chapter 4, you can flesh out your character's physical appearance and personality traits. Choose your character's {@b alignment} (the moral compass that guides his or her decisions) and {@b ideals}. Chapter 4 also helps you identify the things your character holds most dear, called {@b bonds}, and the {@b flaws} that could one day undermine him or her.",
						"Your character's {@b background} describes where he or she came from, his or her original occupation, and the character's place in the D&D world.",
						"Your DM might offer additional backgrounds beyond the ones included in chapter 4, and might be willing to work with you to craft a background that's a more precise fit for your character concept.",
						"A background gives your character a background feature (a general benefit) and proficiency in two skills, and it might also give you additional languages or proficiency with certain kinds of tools. Record this information, along with the personality information you develop, on your character sheet.",
						{
							"type": "entries",
							"name": "Your Character's Abilities",
							"page": 14,
							"entries": [
								"Take your character's ability scores and race into account as you flesh out his or her appearance and personality. A very strong character with low Intelligence might think and behave very differently from a very smart character with low Strength.",
								"For example, high {@b Strength} usually corresponds with a burly or athletic body, while a character with low Strength might be scrawny or plump.",
								"A character with high {@b Dexterity} is probably lithe and slim, while a character with low Dexterity might be either gangly and awkward or heavy and thick-fingered.",
								"A character with high {@b Constitution} usually looks healthy, with bright eyes and abundant energy. A character with low Constitution might be sickly or frail.",
								"A character with high {@b Intelligence} might be highly inquisitive and studious, while a character with low Intelligence might speak simply or easily forget details.",
								"A character with high {@b Wisdom} has good judgment, empathy, and a general awareness of what's going on. A character with low Wisdom might be absent-minded, foolhardy, or oblivious.",
								"A character with high {@b Charisma} exudes confidence, which is usually mixed with a graceful or intimidating presence. A character with a low Charisma might come across as abrasive, inarticulate, or timid."
							],
							"id": "022"
						},
						{
							"type": "entries",
							"name": "Building Bruenor, Step 4",
							"page": 14,
							"entries": [
								"Bob fills in some of Bruenor's basic details: his name, his sex (male), his height and weight, and his alignment (lawful good). His high Strength and Constitution suggest a healthy, athletic body, and his low Intelligence suggests a degree of forgetfulness.",
								"Bob decides that Bruenor comes from a noble line, but his clan was expelled from its homeland when Bruenor was very young. He grew up working as a smith in the remote villages of Icewind Dale. But Bruenor has a heroic destiny—to reclaim his homeland—so Bob chooses the folk hero background for his dwarf. He notes the proficiencies and special feature this background gives him.",
								"Bob has a pretty clear picture of Bruenor's personality in mind, so he skips the personality traits suggested in the folk hero background, noting instead that Bruenor is a caring, sensitive dwarf who genuinely loves his friends and allies, but he hides this soft heart behind a gruff, snarling demeanor. He chooses the ideal of fairness from the list in his background, noting that Bruenor believes that no one is above the law.",
								"Given his history, Bruenor's bond is obvious: he aspires to someday reclaim Mithral Hall, his homeland, from the shadow dragon that drove the dwarves out.",
								"His flaw is tied to his caring, sensitive nature—he has a soft spot for orphans and wayward souls, leading him to show mercy even when it might not be warranted."
							],
							"id": "023"
						}
					],
					"id": "021"
				},
				{
					"type": "entries",
					"name": "5. Choose Equipment",
					"page": 14,
					"entries": [
						"Your class and background determine your character's {@b starting equipment}, including weapons, armor, and other adventuring gear. Record this equipment on your character sheet. All such items are detailed in chapter 5.",
						"Instead of taking the gear given to you by your class and background, you can purchase your starting equipment. You have a number of {@b gold pieces} (gp) to spend based on your class, as shown in chapter 5. Extensive lists of equipment, with prices, also appear in that chapter.",
						"If you wish, you can also have one trinket at no cost (see the Trinkets table at the end of chapter 5).",
						"Your Strength score limits the amount of gear you can carry. Try not to purchase equipment with a total weight (in pounds) exceeding your Strength score times 15. Chapter 7 has more information on carrying capacity.",
						{
							"type": "entries",
							"name": "Armor Class",
							"page": 14,
							"entries": [
								"Your {@b Armor Class} (AC) represents how well your character avoids being wounded in battle. Things that contribute to your AC include the armor you wear, the shield you carry, and your Dexterity modifier. Not all characters wear armor or carry shields, however.",
								"Without armor or a shield, your character's AC equals 10 + his or her Dexterity modifier. If your character wears armor, carries a shield, or both, calculate your AC using the rules in chapter 5. Record your AC on your character sheet.",
								"Your character needs to be proficient with armor and shields to wear and use them effectively, and your armor and shield proficiencies are determined by your class.",
								"There are drawbacks to wearing armor or carrying a shield if you lack the required proficiency, as explained in chapter 5.",
								"Some spells and class features give you a different way to calculate your AC. If you have multiple features that give you different ways to calculate your AC, you choose which one to use."
							],
							"id": "025"
						},
						{
							"type": "entries",
							"name": "Weapons",
							"page": 14,
							"entries": [
								"For each weapon your character wields, calculate the modifier you use when you attack with the weapon and the damage you deal when you hit.",
								"When you make an attack with a weapon, you roll a d20 and add your proficiency bonus (but only if you are proficient with the weapon) and the appropriate ability modifier.",
								{
									"type": "list",
									"items": [
										"For attacks with {@b melee weapons}, use your Strength modifier for attack and damage rolls. A weapon that has the finesse property, such as a {@item rapier|phb}, can use your Dexterity modifier instead.",
										"For attacks with {@b ranged weapons}, use your Dexterity modifier for attack and damage rolls. A melee weapon that has the thrown property, such as a {@item handaxe|phb}, can use your Strength modifier instead."
									]
								}
							],
							"id": "026"
						},
						{
							"type": "entries",
							"name": "Building Bruenor, Step 5",
							"page": 15,
							"entries": [
								"Bob writes down the starting equipment from the fighter class and the folk hero background. His starting equipment includes chain mail and a shield, which combine to give Bruenor an Armor Class of 18.",
								"For Bruenor's weapons, Bob chooses a battleaxe and two handaxes. His battleaxe is a melee weapon, so Bruenor uses his Strength modifier for his attacks and damage. His attack bonus is his Strength modifier (+3) plus his proficiency bonus (+2), for a total of +5.",
								"The battleaxe deals 1d8 slashing damage, and Bruenor adds his Strength modifier to the damage when he hits, for a total of 1d8 + 3 slashing damage. When throwing a handaxe, Bruenor has the same attack bonus (handaxes, as thrown weapons, use Strength for attacks and damage), and the weapon deals 1d6 + 3 slashing damage when it hits."
							],
							"id": "027"
						}
					],
					"id": "024"
				},
				{
					"type": "entries",
					"name": "6. Come Together",
					"page": 15,
					"entries": [
						"Most D&D characters don't work alone. Each character plays a role within a {@b party,} a group of adventurers working together for a common purpose. Teamwork and cooperation greatly improve your party's chances to survive the many perils in the worlds of Dungeons & Dragons. Talk to your fellow players and your DM to decide whether your characters know one another, how they met, and what sorts of quests the group might undertake."
					],
					"id": "028"
				},
				{
					"type": "section",
					"data": {
						"quickref": 1
					},
					"name": "Beyond 1st Level",
					"page": 15,
					"entries": [
						"As your character goes on adventures and overcomes challenges, he or she gains experience, represented by experience points. A character who reaches a specified experience point total advances in capability. This advancement is called {@b gaining a level}.",
						"When your character gains a level, his or her class often grants additional features, as detailed in the class description. Some of these features allow you to increase your ability scores, either increasing two scores by 1 each or increasing one score by 2. You can't increase an ability score above 20. In addition, every character's proficiency bonus increases at certain levels.",
						"Each time you gain a level, you gain 1 additional Hit Die. Roll that Hit Die, add your Constitution modifier to the roll, and add the total (minimum of 1) to your hit point maximum. Alternatively, you can use the fixed value shown in your class entry, which is the average result of the die roll (rounded up).",
						"When your Constitution modifier increases by 1, your hit point maximum increases by 1 for each level you have attained. For example, when Bruenor reaches 8th level as a fighter, he increases his Constitution score from 17 to 18, thus increasing his Constitution modifier from +3 to +4. His hit point maximum then increases by 8.",
						"The Character Advancement table summarizes the XP you need to advance in levels from level 1 through level 20, and the proficiency bonus for a character of that level. Consult the information in your character's class description to see what other improvements you gain at each level.",
						{
							"type": "entries",
							"name": "Tiers of Play",
							"page": 15,
							"entries": [
								"The shading in the Character Advancement table shows the four tiers of play. The tiers don't have any rules associated with them; they are a general description of how the play experience changes as characters gain levels.",
								"{@b In the first tier (levels 1-4),} characters are effectively apprentice adventurers. They are learning the features that define them as members of particular classes, including the major choices that flavor their class features as they advance (such as a wizard's Arcane Tradition or a fighter's Martial Archetype). The threats they face are relatively minor, usually posing a danger to local farmsteads or villages.",
								"{@b In the second tier (levels 5-10),} characters come into their own. Many spellcasters gain access to 3rd-level spells at the start of this tier, crossing a new threshold of magical power with spells such as {@spell fireball} and {@spell lightning bolt}. At this tier, many weapon-using classes gain the ability to make multiple attacks in one round. These characters have become important, facing dangers that threaten cities and kingdoms.",
								"{@b In the third tier (levels 11-16),} characters have reached a level of power that sets them high above the ordinary populace and makes them special even among adventurers. At 11th level, many spellcasters gain access to 6th-level spells, some of which create effects previously impossible for player characters to achieve. Other characters gain features that allow them to make more attacks or do more impressive things with those attacks. These mighty adventurers often confront threats to whole regions and continents.",
								"{@b At the fourth tier (levels 17-20),} characters achieve the pinnacle of their class features, becoming heroic (or villainous) archetypes in their own right. The fate of the world or even the fundamental order of the multiverse might hang in the balance during their adventures."
							],
							"id": "02a"
						},
						{
							"type": "table",
							"colLabels": [
								"Experience Points",
								"Level",
								"Proficiency Bonus"
							],
							"colStyles": [
								"col-4 text-center",
								"col-4 text-center",
								"col-4 text-center"
							],
							"rows": [
								[
									"0",
									"1",
									"+2"
								],
								[
									"300",
									"2",
									"+2"
								],
								[
									"900",
									"3",
									"+2"
								],
								[
									"2,700",
									"4",
									"+2"
								],
								[
									"6,500",
									"5",
									"+3"
								],
								[
									"14,000",
									"6",
									"+3"
								],
								[
									"23,000",
									"7",
									"+3"
								],
								[
									"34,000",
									"8",
									"+3"
								],
								[
									"48,000",
									"9",
									"+4"
								],
								[
									"64,000",
									"10",
									"+4"
								],
								[
									"85,000",
									"11",
									"+4"
								],
								[
									"100,000",
									"12",
									"+4"
								],
								[
									"120,000",
									"13",
									"+5"
								],
								[
									"140,000",
									"14",
									"+5"
								],
								[
									"165,000",
									"15",
									"+5"
								],
								[
									"195,000",
									"16",
									"+5"
								],
								[
									"225,000",
									"17",
									"+6"
								],
								[
									"265,000",
									"18",
									"+6"
								],
								[
									"305,000",
									"19",
									"+6"
								],
								[
									"355,000",
									"20",
									"+6"
								]
							]
						}
					],
					"id": "029"
				}
			],
			"id": "00b"
		}
	]
}
