{
	"feat": [
		{
			"name": "Rage",
			"source": "CDPH",
			"class": ["Barbarian"],
			"entries":["In battle, you fight with primal ferocity. On your turn, you can enter a rage as a Bonus Action. While raging, you gain the following benefits if you aren’t wearing Heavy Armor or Power Armor:",
				"• You have advantage on Strength checks and Strength saves.",
				"• When you make a melee attack, you gain +4 on your damage roll.",
				"• You have resistance to bludgeoning, piercing, and slashing damage.",
				"Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then.<br>You can only do this once every two hours, and every time you do it more you get one exhaustion."]
		},
		{
			"name": "Unarmored Brute Defense",
			"source": "CDPH",
			"class": ["Barbarian"],
			"entries":["While you are not wearing any armor, your Armor Class equals <br>9 + Dexterity Modifier + Constitution Modifier"]
		},
		{
			"name": "Reckless Attack",
			"source": "CDPH",
			"class": ["Barbarian"],
			"entries":["You can throw aside all concern for defence to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee attacks during this turn, but attack rolls against you have advantage until your next turn."]
		},
		{
			"name": "Danger Sense",
			"source": "CDPH",
			"class": ["Barbarian"],
			"entries":["You gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity Saves against effects that you can see, such as traps or explosives. To gain this benefit, you can’t be blinded, deafened, or incapacitated."]
		},
		{
			"name": "Feral Instinct",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[{"feature": ["{@feat Rage|CDPH}"]}]],
			"entries":["Your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."]
		},
		{
			"name": "Relentless Rage",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[
				{"feature": ["{@feat Rage|CDPH}"]},
				{"class": "Barbarian Level 6"}
			]],
			"entries":["Your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."]
		},
		{
			"name": "Frenzy",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[{"feature": ["{@feat Rage|CDPH}"]}]],
			"entries":["You can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack or unarmed strike as a Bonus Action on each of your turns after this one.<br>While in this rage/frenzy, you also gain 1 additional damage die on any damage roll you make. When your rage ends, you suffer one level of exhaustion."]
		},
		{
			"name": "Mindless Rage",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[{"feature": ["{@feat Rage|CDPH}"]}]],
			"entries":["You can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage"]
		},
		{
			"name": "Persistent Rage",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[
				{"feature": ["{@feat Rage|CDPH}"]},
				{"class": "Barbarian Level 4"}
			]],
			"entries":["Your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it. The duration of the rage is also increased to 5 minutes."]
		},
		{
			"name": "Indomitable Might",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[
				{"class": "Barbarian Level 3"}
			]],
			"entries":["If your total for a Strength check is less than your Strength Ability Score, you can use that score in place of the total of the check."]
		},
		{
			"name": "Determination of the Gods",
			"source": "CDPH",
			"class": ["Barbarian"],
			"entries":["You can withstand wounds that would kill any normal person. You gain +1 HP every level (this does work retroactively)."]
		},
		{
			"name": "Hard to Hit",
			"source": "CDPH",
			"class": ["Barbarian"],
			"entries":["Your body has become a bit tougher to go through.<br>You gain 1 + 10% DR."]
		},
		{
			"name": "Raging Hard",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[
				{"feature": ["{@feat Rage|CDPH}"]},
				{"class": "Barbarian Level 4"} 
			]],
			"entries":["You are able to brush off attacks a lot easier while in your rage. You gain 2 DR while you are in your rage."]
		},
		{
			"name": "Who Needs Arms with Legs Like These",
			"source": "CDPH",
			"class": ["Barbarian"],
			"entries":["You gain +1 meter movement when you are wearing light armor or no armor."]
		},
		{
			"name": "Buff",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[{"class":"Barbarian Level 12"}]],
			"entries":["You are buff as hell. Your Strength and Constitution scores both increase by 4, and the maximum for those scores is now 10 higher."]
		},
		{
			"name": "Rapid Regeneration",
			"source": "CDPH",
			"class": ["Barbarian"],
			"prerequisite": [[{"class":"Barbarian Level 7"}]],
			"entries":["Your stamina and grit has increased quite a lot, and while you knew good enough how to deal with wounds you got, now your body has learned that as well.<br>You regain 1 HP every turn while in a fight, or 4 HP every hour while not in a fight."]
		},
		{
			"name": "Barbarian Mastery",
			"source": "CDPH",
			"class": ["Barbarian"],
			"mastery": true,
			"prerequisite": [[{"class": "Barbarian Level 16"}]],
			"entries":["<i>Mastery</i><br><br>You gain 5 Max HP."]
		},
		{
			"name": "Musical Genius",
			"source": "CDPH",
			"class": ["Bard"],
			"free": true,
			"entries":["<i>Free</i><br><br>You are able to learn the skills to play some special songs. These songs have effects ranging from warming up an area to having the ability to dodge through a sea of bullets. You can find the list of learnable songs in the Learnable Songs List.<br><br>You can get a new song every time you gain a level in {@class Bard|CDPH}, and you can choose to learn a new song instead of getting an ability from the {@class Bard|CDPH} class when you increase your {@class Bard|CDPH} level.<br><br>You need to use your Action to start playing or to maintain a song. If you somehow have more than one Action in a turn, than you can use one Action to start playing a song, but need to use all Actions for maintaining a song. You can stop playing a song as a Free Action.<br><br>While playing a song costs concentration, it normally isn’t hard to keep it. When it is hard to play a song correctly (because of other very loud sounds for instance or if you take some damage), than you are asked to make a {@skill Pain Tolerance} roll against a DC set by the DM."]
		},
		{
			"name": "Through the Fire and the Pain",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[{"feature": ["{@feat Musical Genius|CDPH}"]}]],
			"entries":["You have learned how to keep your composure while fighting. You do not need to make {@skill Pain Tolerance} rolls maintain your song if you are damaged anymore. "]
		},
		{
			"name": "Heir of Sound",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[
				{"feature": ["{@feat Musical Genius|CDPH}"]},
				{"class": ["Bard Level 5"]}
			]],
			"entries":["You have honed your skills enough to improve on songs a bit, playing them more accurately and improving their effects. Every time you can learn a new song, you can now increase your level of a song you know to level 2 instead of getting a new song"]
		},
		{
			"name": "Prodigy of Music",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[
				{"feature": ["{@feat Heir of Sound|CDPH}"]},
				{"class": ["Bard Level 11"]}
			]],
			"entries":["You are slowly honing in the perfect melody and rhythm of the songs you know. Every time you can learn a new song, you can now increase your level of a song that you have level 2 skill in to level 3 instead of getting a new song."]
		},
		{
			"name": "The Perfect Play",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[
				{"feature": ["{@feat Prodigy of Music|CDPH}"]},
				{"class": ["Bard Level 16"]}
			]],
			"entries":["You have perfected your skills to (near) full potential. You can choose 3 songs which you know and have level 3 skills in to increase in potential to level 4. You can also do this later if you do not have 3 songs with level 3 skill yet."]
		},
		{
			"name": "8/4<sup>th</sup> Speed",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[
				{"feature": ["{@feat Musical Genius|CDPH}"]},
				{"class": ["Bard Level 12"]}
			]],
			"entries":["You have perfected your skills to (near) full potential. You can choose 3 songs which you know and have level 3 skills in to increase in potential to level 4. You can also do this later if you do not have 3 songs with level 3 skill yet."]
		},
		{
			"name": "Jack of All Traits",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[
				{"class": ["Bard Level 2"]}
			]],
			"entries":["You can add half your Proficiency Bonus, rounded down, to any ability check you make where you don’t have Proficiency or Expertise in."]
		},
		{
			"name": "Six-Minus Mentality",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[
				{"class": ["Bard Level 3"]}
			]],
			"entries":["You can learn to be just good enough in something to be proficient in it, although you can’t learn that many different things at the same time and you will forget things if you try to learn too much. This ability only works if you have access to any form of big reaching networks like the Internet.<br><br>You can choose two skills to be proficient in. You can use a Rest to change these proficiencies to other skills"]
		},
		{
			"name": "Honin' Those Skills",
			"source": "CDPH",
			"class": ["Bard"],
			"prerequisite": [[
				{"class": ["Bard Level 2"]}
			]],
			"entries":["You gain expertise in two skills of your choice."]
		},
		{
			"name": "The Bardbarians",
			"source": "CDPH",
			"class": ["Bard"],
			"entries":["You have learned how to use your instrument in combat as a more effective weapon. Using your instrument to attack now counts as a melee weapon with {@dice 2D4} bludgeoning or slashing damage (depending on the weapon) that you are proficient in, instead of it being an improvised weapon."]
		},
		{
			"name": "False Notes",
			"source": "CDPH",
			"class": ["Bard"],
			"entries":["You have learned how to do damage with your instrument without hitting people with it. You are able to create such false music, that it damages the psyche and internal structure of others.<br><br>You can deal {@dice 2D6} energenetic (psychic) damage in an area of 8 meters around you, every creature in this area (except for yourself) needs to make a Constitution Save with a DC of 10 + Charisma Modifier + Proficiency, and take half damage on a success, or full damage on a failed one.<br><br>This attack doesn’t work and doesn’t deal damage on creatures that can’t hear the music you play, or have full immunity to mental intrusions and mental manipulation. This attack also pierces all DR"]
		},
		{
			"name": "Graceful Distraction",
			"source": "CDPH",
			"class": ["Bard"],
			"entries":["You are able to shift people’s attention to you. You can now help someone in their deception roll, giving them advantage on the roll while you are standing within 10 meters of the person who is making the {@skill deception} check."]
		},
		{
			"name": "Bard Mastery",
			"source": "CDPH",
			"mastery": true,
			"class": ["Bard"],
			"prerequisite": [[
				{"feature": ["{@feat The Perfect Play|CDPH}"]}
			]],
			"entries":["<i>Mastery</i><br><br>You can increase a song to level 4"]
		},
		{
			"name": "Doctor Specialization",
			"source": "CDPH",
			"free": true,
			"class": ["Doctor"],
			"entries":["<i>Free</i><br><br>You are specialized in healing. This would be easy if everyone was the same. But alas, nothing less is true, and because of this, you need to specialize to know what you are doing.<br><br>You can choose to specialize in two of the following types of creature: <br>- Organic<br>- Non-Organic<br>- Semi-Materialistic<br>- Half-Materialistic<br>- Fully-Energenetic<br>Any healing you do on a creature type you are specialized in is doubled.<br><br>You also specialize in dealing with two specific races. Not specifically for healing, but for dealing with them in a conversations and the like. You can choose two races, you get +3 on any {@skill deception} and {@skill persuasion} roll against them"]
		},
		{
			"name": "Pharmaceutical Compounds",
			"source": "CDPH",
			"free": true,
			"class": ["Doctor"],
			"prerequisite": [[
				{"class": ["Doctor Level 3"]}
			]],
			"entries":["<i>Free</i><br><br>You can make Drugs. While you cannot do anything with this ability yet, some abilities in this class lets you craft specific Drugs that affect people in different ways which can be seen in the list of Items. Drugs have no effect on Half-Materialistic, Fully-Energenetic or Mechanical creatures unless noted otherwise. Drugs that you make are usually carried in Injectors.<br><br>You can make Drugs in a Rest if you have access to any form of civilization. You start with the ability to maximally make 2 Drugs in a rest, but this can increase this with different abilities from this class. If you can make multiple different Drugs, then you can choose how many you make of each as long as the sum of all the Drugs that you make does not exceed the maximum amount of Drugs that you can make in a rest. All of your self-created Drugs expire after 48 hours, or when you start a Rest.<br><br>Using a Drug in an Injector on someone normally cost an Action, and can be done without needing to throw an Attack Roll if the person isn’t actively trying to dodge you. If you do need to make an Attack Roll, than this can be counted as a melee attack that you are not proficient in and does 0 damage."]
		},
		{
			"name": "Permanent Student",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat Doctor Specialization|CDPH}"]},
				{"class": ["Doctor Level 3"]}
			]],
			"entries":["You take one more type of creature to specialize healing in.<br>You also choose one more race to specialize in dealing with it.<br>You also can create 1 more Drug in a rest.<br><br><i>This ability can be taken multiple times.</i>"]
		},
		{
			"name": "Medical Uppercut",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["You take one more type of creature to specialize healing in.<br>You also choose one more race to specialize in dealing with it.<br>You also can create 1 more Drug in a rest.<br><br><i>This ability can be taken multiple times.</i>"]
		},
		{
			"name": "Support Class",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["You gain 2 Personal Medkits with which you can heal others. You refill these Medkits when you Rest. You cannot refill your Personal Medkits if you don’t have access to any form of civilization.<br>The total health you can heal with a Medkit is also doubled.<br>Normally, a Medkid heals for {@dice 1D8} HP, and can be used until it has healed 10 HP. So you can now use a Medkit or Personal Medkit until 20 HP is healed with it."]
		},
		{
			"name": "Fully Packed",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat Support Class|CDPH}"]},
				{"class": ["Doctor Level 5"]}
			]],
			"entries":["You find a way to pack your Personal Medkits more efficiently, decreasing the size they take up and being able to carry more with you. You gain 2 more Personal Medkits."]
		},
		{
			"name": "Bottom Lane",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat Support Class|CDPH}"]}
			]],
			"entries":["You can now heal for {@dice 1D10+2}+{@skill Medicine} skill with a Medkit and Personal Medkit.<br><br>You also gain another Personal Medkit."]
		},
		{
			"name": "Professional Defibrillator",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["You can stabilise others as a Bonus Action when you are within melee range of them. You also don’t need to throw medicine checks for stabilizing others, as it is guaranteed that you stabilize them as long as this is possible"]
		},
		{
			"name": "Kaysterimeno Thanatos",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat Professional Defibrillator|CDPH}"]},
				{"feature": ["{@feat Support Class|CDPH}"]}
			]],
			"entries":["You can stabilise others as a Bonus Action when you are within melee range of them. You also don’t need to throw medicine checks for stabilizing others, as it is guaranteed that you stabilize them as long as this is possible"]
		},
		{
			"name": "Quickfix",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat Support Class|CDPH}"]}
			]],
			"entries":["You can use your Bonus Action to heal someone with a Personal Medkit, assuming you saw their wounds before you started your turn. It is not possible heal someone with a Personal Medkit twice on the same turn."]
		},
		{
			"name": "That’s How I Lost My Medical License",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["You can now “fix” more serious injuries that arise.<br>You can now effectively heal or fix wounds that wouldn’t just go away with a normal Rest, like broken bones or radiation sickness. While you know what you are doing, this isn’t a replacement for actual medical intervention in a hospital of course, but the effects can be suppressed enough that they nearly or don’t affect the person at all anymore until a better fix is found. You can only do this in a rest, and “fixing” something like this does cost you the use of 1 Personal Medkit until the next Rest. This care does need to be maintained every Rest until the injury or sickness is actually fixed, instead of supressed."]
		},
		{
			"name": "A Moment of Rest",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["With consent of others, you are able to make a Rest take longer to buff your teammates. If your Rest gets disturbed, than the buffs won’t go in effect. The extra time per rest for you and any person you buff is around 20 minutes per person, including yourself. You buff your teammates during this extra time. Teammates that gain your buff have the ability to roll 1 dice with advantage. The rolls where this buff can be used on are: normal saving throws, death saving throws, attack rolls, damage rolls & skill checks."]
		},
		{
			"name": "Alternative Medicine",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["You can find useful and healing items in nature. If someone is poisoned by a wild plant or animal in a wild ecosystem, than you will be able to find a plant or small animal with the anti-poison or anti-venom. You need to succeed a {@skill Survival} check with a DC that is made by the DM (normal difficulty baseline is around 12) to do this.<br><br>You are also able to refill your Personal Medkits with Improvised Medkits if you cannot refill your Medkits because you are in the wild. This requires {@dice 3D6} hours of searching in a not barren, wild area. This time does not count as a Rest for you.<br><br>This Improvised Medkit normally heals for {@dice 1D4} per action, which increases to {@dice 1D6+2}+{@skill Medicine} when you have {@feat Bottom Lane|CDPH}. The total HP that you can heal with an Improvised Medkit is 7 HP, or 15 HP if you have {@feat Support Class|CDPH}."]
		},
		{
			"name": "Biotic Synthesiser",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat Support Class|CDPH}"]}
			]],
			"entries":["You can create a specific antiserum or antivirus if you know what bacteria or virus you are making out for. You can only do this in a Rest and it costs you the use of a Personal Medkit until the next Rest. You also need to have access to scientific equipment and chemicals."]
		},
		{
			"name": "Arrow in the Kneecap",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["You can use your action to make a special attack with a melee or ranged weapon that doesn’t have the “special” trait. This attack does half the damage but it gives a movement penalty equal to half your Proficiency modifier, and it gives disadvantage on the next melee attack that the target makes. "]
		},
		{
			"name": "Back Palm",
			"source": "CDPH",
			"class": ["Doctor"],
			"entries":["You can hit a friendly creature that is affected by an anomalous mental effect or intrusion, or a friendly creature who is unconscious. You do not need to make an attack roll for this if the creature you are trying to hit is not actively dodging you.<br>This hit doesn’t do any damage and won’t give a failed death save on unstabilized creatures. When you hit someone with this ability, all mental effects and intrusions will subside for the next 5 minutes after which they slowly come back if the creature would still be affected. If you use this ability on a unconscious creature, than it becomes awake, and if it is at 0 HP (whether it be stabilized or be throwing death saves), than it is now consciousness again and able to talk and crawl."]
		},
		{
			"name": "A Moment of Reprise",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat A Moment of Rest|CDPH}"]},
				{"class": ["Total Level 3"]}
			]],
			"entries":["The extra time for buffing with {@feat A Moment of Rest|CDPH} can be increased to around 35 minutes per person. This increases the buff to having the ability to roll 2 dices with advantage."]
		},
		{
			"name": "The Calm Before the Storm",
			"source": "CDPH",
			"class": ["Doctor"],
			"prerequisite": [[
				{"feature": ["{@feat A Moment of Reprise|CDPH}"]},
				{"class": ["Total Level 8"]}
			]],
			"entries":["The extra time for buffing with {@feat A Moment of Rest|CDPH} or {@feat A Moment of Reprise|CDPH} can be increased to around an hour per person. This increases the buff to having the ability to roll 2 dices with advantage, and are able to auto-critical one dice roll that isn’t a death save."]
		},
		{
			"name": "Pharmaceutical Mastery",
			"source": "CDPH",
			"class": ["Doctor"],
			"mastery": true,
			"prerequisite": [[
				{"feature": ["{@feat Pharmaceutical Compounds|CDPH}"]},
				{"class": ["Doctor Level 16"]}
			]],
			"entries":["<i>Mastery</i><br><br>You can create 1 more Drug in a rest."]
		},
		{
			"name": "Medical Mastery",
			"source": "CDPH",
			"class": ["Doctor"],
			"mastery": true,
			"prerequisite": [[
				{"feature": ["{@feat Support Class|CDPH}"]},
				{"class": ["Doctor Level 16"]}
			]],
			"entries":["<i>Mastery</i><br><br>In total, you can heal 2 more HP with Personal Medkits. You also gain 1 more Personal Medkit."]
		},
		{
			"name": "Energenetic Kickstart",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"free": true,
			"entries":["<i>Free</i><br><br>You gain a stat called Energy. Your Maximum Energy is <i>10+Energenetic Specialist Level</i>. You use this Energy for the abilities of this class. You regain 2 Energy per turn. You can still use your Energy when you are out. If you do so, you regain an amount of Energy equal to half your Total Level and half your Energenetic Specialist Level, and you also get one point of Exhaustion.<br>The maximum range for your abilities are normally your Max Energy in meters, unless otherwise noted. The color of the Energy can be seen in the chapter Energenetic Flowchart."]
		},
		{
			"name": "Non-Localized Manipulation [Initiate]",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Kickstart|CDPH}"]}
			]],
			"entries":["You have learned how to move things with your Energy. You can lift up and move objects and creatures that are up to your Energetic Specialist Level in Kg easily without the use of Energy. Doing this costs an Action.<br><br>The maximum force that you can put on things is than 10 times your Energetic Specialist Level in Newton by extrapolation. You can also use your Energy to increase this maximum by 3 Kg for every point of Energy you use. If you try to move an unwilling creature with this ability, than they need to make a Strength save against a DC of <i>5+Intelligence modifier+Wisdom</i> modifier."]
		},
		{
			"name": "Non-Localized Manipulation [Adept]",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Non-Localized Manipulation [Initiate]|CDPH}"]}
			]],
			"entries":["The maximum weight that you can lift with Non-Localized Manipulation (Energenetic Specialist) is now 3 times your Energenetic Specialist Level in Kg, and you can now increase this by 6 Kg for every point of Energy you use."]
		},
		{
			"name": "Non-Localized Manipulation [Master]",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Non-Localized Manipulation [Adept]|CDPH}"]}
			]],
			"entries":["The maximum weight that you can lift with Non-Localized Manipulation (Energenetic Specialist) is now 5 times your Energenetic Specialist Level in Kg, and you can now increase this by 8 Kg for every point of Energy you use."]
		},
		{
			"name": "Holographic Energenetic Projections",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Kickstart|CDPH}"]}
			]],
			"entries":["You can make holographic like projections. You cannot deal damage with these. The maximum size for these projections is around 27dm<sup>3</sup>(or liter) in an area of 1m<sup>3</sup>. Making such Holographic Projection and maintaining it cost an Action and 2 Energy."]
		},
		{
			"name": "Energenetic Materializing",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat  Energenetic Materializing|CDPH}"]},
				{"class": ["Energenetic Specialist Level 6"]}
			]],
			"entries":["From now on, if you use your {@feat Energenetic Materializing|CDPH} to create or maintain an object, than you can do so anywhere you can see within a 20 meter radius without the need to be in contact with it.<br><br>Although it cost 3 Energy to create the object without touching it, it doesn’t cost Energy anymore to maintain the object"]
		},
		{
			"name": "High Energy Density Projectile",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Kickstart|CDPH}"]}
			]],
			"entries":["You can throw a ball of Energy to a target. This is a form of Attack and does cost an Action to do so.<br>This attack does {@dice 1d4} damage for every point of Energy you use on this ability, to a maximum of your Energenetic Specialist Level of D4's damage. You need to make an Attack roll for this Attack.<br>You are proficient in this Attack roll, can add your <i>Dexterity Modifier</i> and add the lower of your <i>Wisdom Modifier</i> or <i>Intelligence Modifier</i> to the Attack roll.<br><br>When you target something that is farther than your normal range (your max Energy in meters) than you gain disadvantage on the roll that cannot be negated."]
		},
		{
			"name": "Trans-Localized Manipulation",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Kickstart|CDPH}"]}
			]],
			"entries":["You have roughly learned how to use your Energy to teleport. You can only teleport to places with a low density of matter, so only to air/vacuum or other such areas, and this does cost an Action. <br>The Energy cost for teleporting is 2 + ¼ the distance in meter of Energy. You do not need to know or see where you end up, although it is strongly advised as ending up in a wall or object isn’t too good for your health. You cannot teleport into another creature. However, you can take other creatures with you, these cost an extra half the distance in meter of Energy you need to use."]
		},
		{
			"name": "Potential Recon",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Kickstart|CDPH}"]},
				{"class": ["Energenetic Specialist Level 6"]}
			]],
			"entries":["You can try and specialize into the use of Energy that is made out of your Main Energy. You can now pick an Ability (or the Ability) from the Energy Type that is made from your Main Energy.<br>","<br>",
				{
					"type": "table",
					"caption": "Energenetic ",
					"colLabels": [
						"Main Energy",
						"Ability"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"Dark",
							"Any Ability that requires <i>Main Energy: Space</i> as it's requirement, and which doesn't have any other requirements."
						],
						[
							"Light",
							"Any Ability that requires <i>Main Energy: Time</i> as it's requirement, and which doesn't have any other requirements."
						],
						[
							"Time",
							"Any Ability that requires <i>Main Energy: Chaos</i> as it's requirement, and which doesn't have any other requirements."
						],
						[
							"Space",
							{	
								"name": "Full Matter Creation",
								"source": "CDPH",
								"class": ["Energenetic Specialist"],
								"prerequisite": "{@feat Projected Energenetic Materialising|CDPH}",
								"entries":["When you use Projected Energenetic Materialising, you can now choose to use 5 Energy instead of 3 to make something out of actual normal matter. Doing this lowers the area in which you can make things to a maximum of 1 kg in an volume of 10 by 10 by 10 cm (or 1 liter), and only lets you create non-complicated things like simple liquids, and things made from metals or plastics in not too complicated shapes (so no machines or electronics and the like).<br>Doing this also disables your ability to make your creation disappear again, as it is fully independent from you the moment it is created, as it is normal matter that is in no way connected to you anymore."]
							}
						],
						[
							"Chaos",
							{	
								"name": "Quantized Skill",
								"source": "CDPH",
								"class": ["Energenetic Specialist"],
								"entries":["<br>You can now let faith be on your side.<br>The closer to perfection you are, the easier it is to make your actions be perfect with the use of Energy. If you roll a Skill Check, Saving Throw or Attack Roll that is above an unnatural 20, then you can spend Energy to change it into a crit.<br>The amount of Energy this costs is <i>36 – Your Unnatural Roll</i>, meaning that it costs 15 Energy to do when you roll an unnatural 21, and 0 energy when you roll an unnatural 36 or above."]
							}
						],
						[
							"Magic",
							"Any Ability that requires <i>Main Energy: Psychic</i> as it's requirement, and which doesn't have any other requirements."
						],
						[
							"Psychic",
							{	
								"name": "Psychic Overkill",
								"source": "CDPH",
								"class": ["Energenetic Specialist"],
								"prerequisite": "Any Ability requiring <i>Main Energy: Psychic</i>",
								"entries":["The maximum range of Abilities from the Energenetic Specialist class are now tripled for you, meaning that the range of any of these abilities is now three times your Max Energy.<br>Also, the range for the {@feat Telepathy|CDPH} is now multiplied by 20, instead of tripled."]
							}
						]
					]
				}]
		},
		{
			"name": "Potential Prowess",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Kickstart|CDPH}"]},
				{"class": ["Energenetic Specialist Level 12"]}
			]],
			"entries":["You can try and specialize into the use of Energy your Main Energy is made out of. You can now pick an Ability (or the Ability) from the Energy Type that your Main Energy is made out of.","<br>",
				{
					"type": "table",
					"caption": "Energenetic ",
					"colLabels": [
						"Main Energy",
						"Ability"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"Dark",
							{	
								"name": "Universal Energy Usage",
								"source": "CDPH",
								"class": ["Energenetic Specialist"],
								"entries":["You have learned how to filter Primal Energies to use as your Main Energy.<br>You gain an extra 20 Maximum Energy."]
							}
						],
						[
							"Light",
							{	
								"name": "Universal Energy Usage",
								"source": "CDPH",
								"class": ["Energenetic Specialist"],
								"entries":["You have learned how to filter Primal Energies to use as your Main Energy.<br>You gain an extra 20 Maximum Energy."]
							}						],
						[
							"Time",
							"Any Ability that requires <i>Main Energy: Light</i> as it's requirement, and which doesn't have any other requirements."
						],
						[
							"Space",
							"Any Ability that requires <i>Main Energy: Dark</i> as it's requirement, and which doesn't have any other requirements."
						],
						[
							"Chaos",
							"Any Ability that requires <i>Main Energy: Time</i> as it's requirement, and which doesn't have any other requirements."
						],
						[
							"Magic",
							{	
								"name": "Improved Normal Energy Injection",
								"source": "CDPH",
								"class": ["Energenetic Specialist"],
								"prerequisite": "{@feat Normal Energy Injection|CDPH}",
								"entries":["The things you can now do with {@feat Normal Energy Injection|CDPH} are now stronger and better, and they can now also be done as a Bonus Action.<br>As a comparison to the new possible strength, the current things which you would be able to do with this Ability (and are not heavily limited by) become:",
								"• Creating strong winds (7 Beaufort).",
								"• Creating or dowsing an area of around 0.5 by 0.5 meter.",
								"• Making things trice as heavy or light.",
								"• Instantly boiling or solidifying a body of water not bigger than 5 liters.",
								"• Freezing or slowly boiling the surface of a body of water not bigger than 1 m<sup>2</sup> at a time.",
								"• Creating a sound up to 150 Db.",
								"<br>You can scale down all these effects, and other effects are possible if the DM agrees with the effect."]
							}						
						],
						[
							"Psychic",
							"Any Ability that requires {@feat Energenetic Substitution|CDPH} as it's requirement, and which doesn't have any other requirements."
						]
					]
				}
			]
		},
		{
			"name": "Energenetic Evasion Reflex",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Dark"},
				{"addit": " or "},
				{"mainenergy": "Light"}],
				[{"addit": " and "},
				{"other": "Matter Type: Not Full-Materialistic"}
			]],
			"entries":["You have learned how to evade from an attack in a dire situation by “teleporting” away as a natural reflex. This does strain you a lot more than normal teleporting, and shows a visible trail of your energy from your start to end location. Using this ability costs 6 Energy, is a Free Action, and with it, you can move up to 5 meter. You cannot “teleport” through walls with this, but you can change the direction of your movement, which means that you can move around corners."]
		},
		{
			"name": "Backup Energy Reserves",
			"mastery": true,
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"other": "Matter Type: Not Full-Materialistic"}
			]],
			"entries":["You have learned how to use more of your energy without exhausting yourself. This does, however, come with a cost as you still put more strain on yourself than you are comfortable with. You lose 5 Max HP when you get this ability, but you gain 12 Max Energy as a result."]
		},
		{
			"name": "Energenetics Control Mastery",
			"mastery": true,
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"class": "Energenetic Specialist Level 20"}
			]],
			"entries":["You have learned how to use more of your energy without exhausting yourself. This does, however, come with a cost as you still put more strain on yourself than you are comfortable with. You lose 5 Max HP when you get this ability, but you gain 12 Max Energy as a result."]
		},
		{
			"name": "Potential Power",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Dark"},
				{"addit": " or "},
				{"mainenergy": "Light"}				
			]],
			"entries":["There generally is no limit anymore for how much you can use your Energy at once. This does include specific abilities that do give a limit. If an ability gives a limit that isn’t a limit of how much Energy you can use, then you can scale the limited amounts with the Energy cost of the ability. The only exception where you still need to abide to the maximum is with the ability High Energy Density Projectile (Energenetic Specialist).<br>Also, the attack roll for {@feat Unstabilized Planck Distribution|CDPH} (Energenetic Specialist) now becomes (1d20 + PROF + WIS_MOD + INT_MOD – ¼_ENERGY_USED_FOR_ATTACK)"]
		},
		{
			"name": "Brute Force",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Dark"},
				{"addit": " or "},
				{"mainenergy": "Light"}				
			]],
			"entries":["You can help yourself and others with your Energy. You can give yourself (or someone else that you can see) {@dice 1d4} to a skill check for every 7 Energy you use on this ability. Or you can give an {@dice 1d4} bonus to an attack roll or saving throw for every 3 Energy used on this ability. The ability to use this given bonus ends after 15 seconds or 5 turns."]
		},
		{
			"name": "Potential Shield",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Dark"},
				{"addit": " or "},
				{"mainenergy": "Light"}				
			]],
			"entries":["You can use your Reaction to create a shield made out of your Main Energy and use this to protect yourself from damage that isn’t from a massive source (like knifes, swords, cannonballs, a van). This Reaction can be used after an attack roll against you is made, but must be before the damage roll has been made. For every point of Energy that you use, you gain 4 DR against damage from energy sources (lasers, plasma, energenetics, etc.), and 2 DR for all other damage types that isn’t afflicted by a massive source. You cannot change how many points of Energy you use after you activated this ability. The effect and this DR ends at the start of your next turn."]
		},
		{
			"name": "Dimensional Phase Transition",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Dark"}			
			]],
			"entries":["You can change yourself into a shadow on a surface as an Action, and back as a Free Action.<br>You change into a 2 dimensional form on the surface of an object you touch when you use this ability.<br>The surface area you cover is around a third of your height (in meters) of m<sup>2</sup>. It costs 3 Energy to change into a shadow, 1 Energy to maintain your form, and it costs 1 Energy for every meter you move. Moving in this form doesn’t use your own movement for that turn. (The maximum amount you would be able to move with this ability, in a turn, while in this form, is 165 meter). You cannot Attack or interact normally with things while you are in this form, although you can still get damaged if you are hit by an energy based attack (laser, plasma, energenetic etc.), or if a (topological) hole is made on to you."]
		},
		{
			"name": "Dimensional Phase Transition",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Dark"}			
			]],
			"entries":["You can change yourself into a shadow on a surface as an Action, and back as a Free Action.<br>You change into a 2 dimensional form on the surface of an object you touch when you use this ability.<br>The surface area you cover is around a third of your height (in meters) of m<sup>2</sup>. It costs 3 Energy to change into a shadow, 1 Energy to maintain your form, and it costs 1 Energy for every meter you move. Moving in this form doesn’t use your own movement for that turn. (The maximum amount you would be able to move with this ability, in a turn, while in this form, is 165 meter). You cannot Attack or interact normally with things while you are in this form, although you can still get damaged if you are hit by an energy based attack (laser, plasma, energenetic etc.), or if a (topological) hole is made on to you."]
		},
		{
			"name": "Shadowing",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Dark"},
				{"feature": ["{@feat Dimensional Phase Transition|CDPH}"]}			
			]],
			"entries":["You can now use your {@feat Dimensional Phase Transition|CDPH} as a Bonus Action instead of an Action"]
		},
		{
			"name": "Anti-Phasic Matter Interactions",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Light"}			
			]],
			"entries":["You can make yourself (together with any objects that you are carrying) invisible as long as you are standing completely still. This costs 2 Energy and an Action every turn."]
		},
		{
			"name": "Cloak & Dagger",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Light"},
				{"feature": ["{@feat Anti-Phasic Matter Interactions|CDPH}"]}			
			]],
			"entries":["When you make yourself invisible using {@feat Anti-Phasic Matter Interactions|CDPH}, then it won’t cost Energy to maintain this invisibility as long as you are standing still and don’t Attack with your action. Or you can now spend 2 Energy to stay invisible while you Move that turn."]
		},
		{
			"name": "Temporal Immunity",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Time"}			
			]],
			"entries":["You are fully immune for time dilations and anomalies in the time-space continuum from the timeline you are in. This also includes anything you touch or wear that isn’t a sentient or sapientcreature. You can also estimate how far from the end of the timeline you are in are."]
		},
		{
			"name": "Clockworks of Fate",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Time"},
				{"feature": ["{@feat Temporal Immunity|CDPH}"]}		
			]],
			"entries":["You can stop time for a very short amount. It costs an Action and 10 Energy to use this ability. Using this ability stops time for 3 seconds (or a turn).<br>This extra turn doesn’t give you an extra Reaction, nor does it let you regenerate your Energy points or HP, nor does it let other turn and time based effects happen. You can prolong the amount of stopped time by using this ability while you are already in stopped time, this costs an Action and 7 Energy. While in your stopped time, time doesn’t pass for anything or anyone in an enormously large range (1-3 lightyears) around you. You gain advantage on some (DM decided) skill checks and saving throws while this ability is active. Timeflow resumes instantly when this ability ends, which includes when you touch or attack a sentient creature.<br>When you use this ability, and the stopped time has ended, than you cannot use it again until for the next 10 minutes."]
		},
		{
			"name": "17-21",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Time"},
				{"feature": ["{@feat Clockworks of Fate|CDPH}"]}		
			]],
			"entries":["You can now use {@feat Clockworks of Fate|CDPH} as a Bonus Action, this also makes it so that you can prolong your stopped time with a Bonus Action instead of an Action. Furthermore, time does not resume when you attack someone anymore, and with this, you gain advantage on attack rolls you make in your stopped time. Also, instead of being unable to use this ability again until the next fight or next 10 minutes, you can now not use it again until the end of your next time-consuming turn."]
		},
		{
			"name": "Time Injection",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Time"}
			]],
			"entries":["You can speed up time of an object or creatures as a Bonus Action. It costs 2 Energy for small objects (coins, pens, screws etc.) for every 3 years of age or 2 Energy for medium objects (soccer balls, chairs, doors etc.) and 3 for anything bigger for every 1 year of age. When you use this ability on an object or creature then it ages in the span of 1 turn. You can lessen this ageing amount to less than the 1 or 2 years, but this still costs the same amount of Energy as if you would use the ability in full. This ability does not work on sentient or sapient creatures."]
		},
		{
			"name": "Spatial Distortion Immunity",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Space"}
			]],
			"entries":["You are fully immune for space distortions and anomalies."]
		},
		{
			"name": "Spatial Intuition",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Space"}
			]],
			"entries":["You can feel the fabric of space and always know where you are when compared to other places you have been. You can recall the exact direction and distance from your current location to somewhere you have been as accurately as 10 cm when you are within 10 km from it, 0.5 meter when you are within 100 km, 1 meter when within 1 light second, and 10 meter for anything further."]
		},
		{
			"name": "You are tearing me apart ....!",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Spatial Intuition|CDPH}"]},
				{"mainenergy": "Space"}
			]],
			"entries":["You are able to quickly travel to a place that you know the exact location of. You can open a wormhole at a place in air or vacuum in an 8 meter radius around you to a place where you know the exact distance and direction of when compared to your current location. This wormhole has a 0.75 meter radius and it costs an Action and 6 Energy to open. It closes at the start of your next turn, or you can maintain it with a Free Action which costs 8 Energy per turn."]
		},
		{
			"name": "Matter Resonator",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Space"}
			]],
			"entries":["You can feel matter existing around you, giving you a slight form of omnipresence. You can feel where things are and how they move in a 15 meter radius. This only works with massive things created out of normal matter. This means that you cannot feel very small objects, air, plasma, or any form of matter made from other energies."]
		},
		{
			"name": "Spacial Force Projection",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Non-Localised Manipulation|CDPH}"]},
				{"mainenergy": "Space"}
			]],
			"entries":["You are now able to use {@feat Non-Localised Manipulation|CDPH} on an area instead of only on an object. The maximum area of effect when you do this is around 2 m3, and the largest dimension of the area cannot be longer than twice the shortest dimension of the area."]
		},
		{
			"name": "Reverse Entropic Energy Injection",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Chaos"}
			]],
			"entries":["You are able to repair with your Energy. You can spend a Bonus Action and 1 Energy to repair 15 cm of tear. Using this ability on non-mechanical creatures won’t have any healing effect, and using it on mechanical creatures heals them for {@dice 1d6+1}."]
		},
		{
			"name": "Chaotic Energy Acquisition",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Chaos"}
			]],
			"entries":["You now regain 3 Energy every turn. Also, you now gain half your Energenetic Specialist Level more Energy for the point of Exhaustion that you get if you use your Energy when you run out, or use more than you have left."]
		},
		{
			"name": "Entropic Control",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Chaos"}
			]],
			"entries":["You have learned how to control pure luck somewhat. As an Action, if you or someone you see need to make a purely luck based roll (like for in game rolling of dice, getting cards handed to you in a poker game etc.), than you can roll a second time and choose which dice the outcome will be. This doesn’t work if the roll of outcome has anything to do with Energenetics or things that aren’t normal matter."]
		},
		{
			"name": "Devil’s Luck",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Entropic Control|CDPH}"]},
				{"mainenergy": "Chaos"}
			]],
			"entries":["Your control over luck has increased to levels to where the term “control” is now correctly applicable. As an Action, when you or someone you see need to make a purely luck based roll, or get a purely luck based outcome on something, than you can try to directly manipulate and change the outcome to your will, instead of the effects of {@feat Entropic Control|CDPH}. How much you succeed and what the outcome becomes is solely based on the DM. This doesn’t work if the roll or outcome has anything to do with Energenetics or things that aren’t normal matter.Furthermore, you become immune to Critical Hits."]
		},
		{
			"name": "Snake Eyes",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Entropic Control|CDPH}"]},
				{"mainenergy": "Chaos"}
			]],
			"entries":["You have learned how to passively control your own luck when you fail things in the most horrible ways. If you critically fail a roll, than you are able to ignore the critical part. This effectively lets you able to change any critical fail you roll into an unnatural 1."]
		},
		{
			"name": "Energenetic Substitution",
			"source": "CDPH",
			"free": true,
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Magic"}
			]],
			"entries":["You can substitute the Energy you use to any other form of the normal Odin Energenetics tree, just in general. This allows you to branch out the use of your energy to different categories. Substituting your energy with another also changes its color, and with this, you can fully control the color of your Energy if you use it in a visible way. Using this substituted Energy is more exhausting however, increasing the cost and decreasing the effectiveness of abilities that you can get from other Energies."]
		},
		{
			"name": "Normal Energy Injection",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Substitution|CDPH}"]},
				{"mainenergy": "Magic"}
			]],
			"entries":["You are able to use your energy to create natural effects for 2 Energy as an Action. This includes (but is not heavily limited by): creating medium winds (4 Beaufort), creating or dowsing a small fire, making things twice as heavy, instantly boiling or solidifying a body of water not bigger than 1 liter and being able to create a sound of around 100 Db. These effects can be scaled down, and other effects are possible if the DM agrees with the thought of effect."]
		},
		{
			"name": "Form Magic",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Substitution|CDPH}"]},
				{"mainenergy": "Magic"}
			]],
			"entries":["You can change your form into another race or into an object that you have seen before. Your new form cannot be much larger than yourself, not smaller than an average pen, and the original object or race needs to be Full-Materialistic. Changing your form costs an Action and 5 Energy, which means that this is also the cost to turn back to normal.<br>Your Stats change in the following way if you do this: <br>• Your Strength becomes that of the object or creature.<br>• Your Dexterity and Charisma scores becomes the lower between your ability scores and the ability scores of that what you change into.<br>• Your other ability scores (Constitution, Intelligence and Wisdom) stay the same."]
		},
		{
			"name": "Primal Magic (Potential Shield)",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Substitution|CDPH}"]},
				{"mainenergy": "Magic"}
			]],
			"entries":["You can use your Reaction to create a shield made out of your Main Energy and use this to protect yourself from damage that isn’t from a massive source (like knifes, swords, cannonballs, a van). This Reaction can be used after an attack roll against you is made, but must be before the damage roll has been made. For every point of Energy that you use, you gain 3 DR against damage from energy sources (lasers, plasma, energenetics, etc.), and 1 DR for all other damage types that isn’t afflicted by a massive source. You cannot change how many points of Energy you use after you activated this ability. The effect and this DR ends at the start of your next turn."]
		},
		{
			"name": "Space Magic (You are tearing me apart ....!)",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Substitution|CDPH}"]},
				{"mainenergy": "Magic"}
			]],
			"entries":["You are able to quickly travel to a place that you know the exact location of. You can open a wormhole at a place in air or vacuum in an 5 meter radius around you to a place where you know the exact distance and direction of when compared to your current location. This wormhole has a 0.75 meter radius and it costs an Action and 8 Energy to open. It closes at the start of your next turn, or you can keep it open which costs 10 Energy per turn but does not cost an Action."]
		},
		{
			"name": "Chaos Magic (Reverse Entropic Energy Injection)",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Substitution|CDPH}"]},
				{"mainenergy": "Magic"}
			]],
			"entries":["You are able to repair with your Energy. You can spend an Action and 2 Energy to repair 10 cm of tear. Using this ability on non-mechanical creatures won’t have any healing effect, and using it on mechanical creatures heals them for {@dice 1d4}."]
		},
		{
			"name": "Time Magic (Time Injection)",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Substitution|CDPH}"]},
				{"mainenergy": "Magic"}
			]],
			"entries":["You can speed up time of an object or creatures as a Bonus Action. It costs 2 Energy for small objects (coins, pens, screws etc.) for every 2 years of age or 3 Energy for medium objects (soccer balls, chairs, doors etc.) for every 1 year of age.<br>When you use this ability on an object or creature then it ages in the span of 1 turn. You can lessen this ability to less than the 1 or 2 years, but this still costs the same amount of Energy as if you would use the ability in full. This ability does not work on sentient creatures."]
		},
		{
			"name": "Psychic Magic (Telepathy)",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Energenetic Substitution|CDPH}"]},
				{"mainenergy": "Magic"}
			]],
			"entries":["You can communicate with other non-mechanical creatures. This is as free as an action as normal talking is. This is two way, which means the creature you are communicating with can respond. <br>You and the creature can only communicate in languages you know however. This ability does not cost any Energy to use.<br>This ability doesn’t work against creatures that have resistance against mental intrusions."]
		},
		{
			"name": "Mind over Matter",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Psychic"}
			]],
			"entries":["You are completely immune against all attacks and abilities that use this form of energenetics. You are also immune against any form of mental intrusion or anomaly (Except for {@feat Telepathy|CDPH} which you can choose to ignore).<br>Also, you can control your emotional state perfectly, gaining proficiency on the Deception skill, or expertise if you already were proficient."]
		},
		{
			"name": "Telepathy",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Psychic"}
			]],
			"entries":["You can communicate with other non-mechanical creatures. This is as free as an Action as normal talking is. This is two way, which means the creature you are communicating with can respond.<br>You and the creature can only communicate in languages you two know. This ability does not cost any Energy to use.<br>If a creature has resistance against mental intrusions, than you need to roll a Wisdom check against their Wisdom Ability Score."]
		},
		{
			"name": "Crystal Mind",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"mainenergy": "Psychic"}
			]],
			"entries":["You can read the mind of others as an Action. If you try to use this ability on an unwilling creature or a creature who has resistance against mental intrusions, than they need to make a Wisdom Saving Throw against a DC of 7 + Proficiency + Intelligence Ability Score Modifier + Wisdom Ability Score Modifier. The result of this save resets after 6 hours. When they succeed, than they are immune to you using this ability on them. <br>When they fail, than you can read their mind and memories. You are in an unconscious type of trance while you are doing this, and do not register anything that is happening around you. You can snap out of your trance and out of the other persons mind on will. When you read someone’s memory, then you experience everything about said memory that they know. And although you are able to do this, it is still near impossible to guess the emotional state of the target by just probing their memories."]
		},
		{
			"name": "Dream of a Black Swan",
			"source": "CDPH",
			"class": ["Energenetic Specialist"],
			"prerequisite": [[
				{"feature": ["{@feat Telepathy|CDPH}"]},
				{"mainenergy": "Psychic"}
			]],
			"entries":["You are able to effectively change other creatures their mindset, emotional state and or overall mood and are able to create mental effects. Using this ability costs an Action and at least 2 Energy. If you use this ability on a unwilling creature or a creature that has resistance against mental intrusions or anomalies, than they need to make a Wisdom Saving Throw, and the DC they need to succeed on is:5 + Proficiency + Intelligence Ability Score Modifier + Wisdom Ability Score Modifier + 1 per 3 extra Energy used. <br>The outcome of this roll resets after 30 minutes. If they succeed, then they are immune to you using this ability on them. If they fail, then you are able to do one of the following things: change their general mood, change their emotional state, change their mindset on something (as long as it wouldn’t directly harm them), put them to sleep, force them awake, or something else that falls in this category and the DM agrees with. The effect stops after the saving throw is reset, after which the person can remember everything he did in the affected time, but may or may not know that you are responsible. It also ends when you actively work against the effect that you gave (like changing someone friendly towards you and constantly being overly mean while the person is affected). "]
		},
		{
			"name": "Maintenance",
			"source": "CDPH",
			"free": true,
			"class": ["Engineer"],
			"entries":["This class is partially specialized in making things, let it be weapons or utility items. But making these things is only half of the work, as most unprofessionally made machines and items will break down quite quickly if they are not maintained.<br>You have a pool of points called Maintenance Points, MP for short, which you can allocate to items that you make with Abilities from this class. <br>You have 6 MP that you can allocate, and you can increase this with some Abilities in this class. If you create or get something that needs allocated MP, than you can allocate it immediately if you have enough unallocated MP left. You can reallocate your MP every 24 hours and in a Rest.<br>If you don’t allocate MP into an item that needs it, then said item or said part of an item stops working until you allocated the needed MP into it again. <br>The amount of allocated MP an item needs can be seen on the header of said ability/item."]
		},
		{
			"name": "Multitask Master",
			"source": "CDPH",
			"class": ["Engineer"],
			"prerequisite":[[
				{"class": "Engineer Level 4"}
			]],
			"entries":["You have learned how to multitask when maintaining your things, which lets you maintain more things in the same amount of time.<br>You gain 6 more MP that you can allocate, upping your total to 12 MP."]
		},
		{
			"name": "Efficient Prioritization",
			"source": "CDPH",
			"class": ["Engineer"],
			"prerequisite":[[
				{"feature": ["{@feat Multitask Master|CDPH}"]},
				{"class": "Engineer Level 10"}
			]],
			"entries":["You have learned how to prioritize specific things when you do your maintenance. Making sure you do the most important stuff first, and reducing redundant work lets you maintain even more things in the same amount of time.<br>You gain 8 more MP that you can allocate, upping your total to 20 MP."]
		},
		{
			"name": "Puzzle Master",
			"source": "CDPH",
			"class": ["Engineer"],
			"entries":["You are proficient at creating new things from blueprints, and have become quite knowledgeable how to take machinery apart. You gain proficiency when you try replicate some form of electronics or machinery, and expertise when you try to disassemble something while you have Mechanics Tools. The amount of time it takes to replicate objects depends on the object, and can range from a few minutes to a few days."]
		},
		{
			"name": "Magister Horologium Opus",
			"source": "CDPH",
			"class": ["Engineer"],
			"entries":["You are able to create small things that may be of use, like a lockpick, flashlight or simple timer. It costs 3 to 5 minutes to make such small usable item. If you want to make something, then you need to throw a {@skill Mechanical Manipulation} Check against a DC that is based on how physically difficult it is to make the object. Every time you roll to create an item, the DC for creating the same and similar items increases until your next rest."]
		},
		{
			"name": "Deus Intus Machina",
			"source": "CDPH",
			"class": ["Engineer"],
			"prerequisite":[[
				{"class": "Engineer Level 5"},
				{"feature":["{@feat Magister Horologium Opus|CDPH}"]}
			]],
			"entries":["You have learned how to make larger things, including improvised tools and weaponlikes. Items made with this ability need to be maintained, and the maintenance points needed differs per item. You can only create items with this ability in a Rest and you need to have access to Mechanics Tools and a good source of scrap and materials (this means that you cannot create these items if you are stranded in the middle of a desert). A list of example items that you can make with this ability can be seen in the {items list}. You are able to make other things that are not on this example list, but you need to discuss this with the DM if you thought of something."]
		},
		{
			"name": "Fraudulentus Naturae",
			"source": "CDPH",
			"class": ["Engineer"],
			"prerequisite":[[
				{"class": "Engineer Level 8"},
				{"feature":["{@feat Deus Intus Machine|CDPH}"]},
				{"other": "{@skill Energenetics} Skill Expertise and Intelligence Score of 15 or higher"}
			]],
			"entries":["You have learned how to use energenetic theories into your crafts, being able to create effects and items, while niche, far superior than ever before. Items made with this ability need to be maintained, and the Maintenance Points needed differs per item. You can only create items with this ability in a Rest and you need to have access to Mechanics Tools. A list of items that you can make with this ability can be seen at the end of this Class. You are able to make other things that are not on this example list, but you need to discuss this with the DM if you thought of something. "]
		},
		{
			"name": "Builders League United",
			"source": "CDPH",
			"class": ["Engineer"],
			"entries":["You are an expert at repairing things. You nowhave expertise when repairing things while you use your Mechanics Tools, and still have normal proficiency when you need to improvise with tools.<br>You can also Heal/Repair mechanical creatures using your Mechanics Tools as an Action. You can heal {@dice 2d4}+{@skill Mechanical Manipulation}. The total health you can repair per Rest is 10+2xEngineer Level, at which point your spare parts and materials are running too low to effectively repair or create anything."]
		},
		{
			"name": "Little Helper",
			"source": "CDPH",
			"class": ["Engineer"],
			"entries":["You gain a small robot companion that helps you with things. This companion can for example be a mechanical version of any small animal (maximum medium dog sized) or a higher tech version of a commercial RC drone. You can choose if this companion is sapient or not. <br>If it isn’t sapient, than it only has an Action and Reaction, you can fully control it as a Bonus Action, and it will execute any simple command given to it without thinking until you give it another command. If it is sapient, than you won’t have any direct control over it, but it will still try to execute any command given to it to the best extend of its abilities, and will try to help you actively. It shares your Initiative/Turn as it monitors and reacts to your vitals for your current emotional state. Its stats are described in Appendix C.<br>What your companion can do depends on what it is, but it can always give or remove half your Proficiency Bonus on any D20 roll that isn’t a Death Save while it is within 1 meter of someone as a Reaction."]
		},
		{
			"name": "Big Helper",
			"source": "CDPH",
			"class": ["Engineer"],
			"prerequisite":[[
				{"class": "Engineer Level 8"},
				{"level": 10},
				{"feature":["{@feat Little Helper|CDPH}"]}
			]],
			"entries":["You have learned from your experience with your mechanical companion how to create a larger robot while still keeping the thing stable. You can now change your Little Helper into a new form. Its form doesn’t need to be like an animal anymore, and the limit of how big you can make your companion is now around the size of a bear. You can choose to transfer the AI core of your Little Helper if had Sapience, or put in a new AI, or put in none at all. The effects of sapience and non-sapience are described in the {@feat Little Helper|CDPH} ability. Its stats are described in Appendix C. What your companion can do still depends on what it is, but it can always give or remove half your Proficiency Bonus on any D20 roll while it is within 1 meter of someone as a Reaction."]
		},
		{
			"name": "Power Armor Master",
			"source": "CDPH",
			"class": ["Engineer"],
			"entries":["You gain proficiency in Power Armor."]
		},
		{
			"name": "Active Weapon Systems",
			"source": "CDPH",
			"class": ["Engineer"],
			"maintenance": 0,
			"entries":["You gain proficiency in Power Armor."]
		}
	]
}
