{
	"_meta": {
		"internalCopies": [
			"item"
		]
	},
	"item": [
	{
		"name": "+1 All-Purpose Tool",
		"source": "DMG",
		"page": 119,
		"rarity": "uncommon",
		"property": [
			"iron"
		],

		"edr": "100",
		"ac": 16,
		"dr": 5,
		"reqAttune": "by an artificer",
		"reqAttuneTags": [
			{
				"class": "artificer|tce"
			}
		],
		"bonusSpellAttack": "+1",
		"bonusSpellSaveDc": "+1",
		"entries": [
			"This simple screwdriver can transform into a variety of tools; as an action, you can touch the item and transform it into any type of artisan's tool of your choice (see the \"Equipment\" chapter in the {@book Player's Handbook|PHB} for a list of {@item artisan's tools|PHB}. Whatever form the tool takes, you are proficient with it.",
			"While holding this tool, you gain a +1 bonus to the spell attack rolls and the saving throw DCs of your artificer spells.",
			"As an action, you can focus on the tool to channel your creative forces. Choose a cantrip that you don't know from any class list. For 8 hours, you can cast that cantrip, and it counts as an artificer cantrip for you. Once this property is used, it can't be used again until the next dawn."
		]
	},
	{
		"name": "Holoprojector",
		"source": "CDPH",
		"type": "Gear",
		"rarity": "Special",
		"MC": "2 MP",
		"weight": 1,
		"entries": [
			"A small machine with logo depicting the words <i><b>{@color <u>R-Tech</u>|9e3c3c}</b></i> on it.",
			"The device seems to have three gel-like small orbs in it.<br>When one of the small orbs is removed from the Holoprojector for longer than {@dice 1d4} turns, than it creates a random hologram for {@dice 2d12} hours after which the orb has completely dissipated. <br>The hologram looks and acts completely real, and if it’s a thing or creature, it can move only within a radius of 200 meter within line of sight of the small orb bit originates from. It also makes sound that is accurate to the hologram, which with an {@skill perception} or {@skill insight} check (DC 20) can be traced back to the orb, which is the point the sound originates from.<br>One orb is created every day and the Holoprojector can keep up to three stable at the same time. It won’t make more if it’s full or can’t fit an orb in one of the 3 containers.",
			"These Holoprojectors are very unstable, so every Hologram is random. The roll list for the given hologram can be seen in the DM's manual.",
			"It costs 2 Maintenance Points to keep it stable. When doing so, you can change what each orb will project while maintaining it in a rest."
			]
	},
	{
		"name": "Physiprojector",
		"source": "CDPH",
		"type": "Gear",
		"rarity": "Special",
		"MC": "2 MP",
		"weight": 1,
		"entries": [
			"A small red-ish machine with logo depicting the words <i><b>{@color <u>R-Tech</u>|9e3c3c}</b></i> on it.",
			"The device seems to have three small orbs in it that lightly shock when touched.<br>When one of the small orbs is removed from the Holoprojector for longer than {@dice 1d4+1} turns, then it creates a random physical thing or event.<br>One orb is created every 2 days and the Physiprojector can keep up to three stable at the same time. It won’t make more if it’s full or can’t fit an orb in one of the 3 containers.",
			"These Physiprojectors are prototypes and are always unstable. Every thing or event is random, and the roll list for the given thing/event can be seen in the DM's manual.",
			"It costs 3 Maintenance Points to keep it &quot;stable&quot;, and with &quot;stable&quot being still not too stable.<br>When &quot;stableised&quot and in a rest, you can change the outcome of what the outcomes of the orbs would be, and change them to &quot;good&quot;, &quot;neutral&quot;, &quot;bad&quot; or &quot;catastrophic&quot;.",
			"<br>This machine has two string based energenetic crystals in it, one chaos-based, and one space-based. Destroying the machine completely, and with it these crystals, will result in an insane explosion doing:<br>{@damage 100+10d10} energenetic damage within 2 meters,<br>{@damage 50+10d6} energenetic damage within 2-6 meters,<br>{@damage 20+5d4} energenetic damage within 6-20 meters,<br>and {@damage 10+4d4} explsosion damage within 20-60 meters."			
		]
	},
	{
		"name": "Physiprojector (Black)",
		"source": "CDPH",
		"type": "Gear",
		"rarity": "Special",
		"MC": "2 MP",
		"weight": 1,
		"entries": [
			"A small greyish-black machine with logo depicting the words <i><b>{@color <u>R-Tech</u>|9e3c3c}</b></i> on it.",
			"The device seems to have three small orbs in it that lightly shock when touched.<br>When one of the small orbs is removed from the Holoprojector for longer than {@dice 1d4+1} turns, then it creates a random physical thing or event.<br>One orb is created every 2 days and the Physiprojector can keep up to three stable at the same time. It won’t make more if it’s full or can’t fit an orb in one of the 3 containers.",
			"This Physiprojectors is extremely unstable. Every thing or event is random, and the roll list for the given thing/event can be seen in the DM's manual, but is always catastrophic.",
			"<br>This machine has two string based energenetic crystals in it, one chaos-based, and one space-based. Destroying the machine completely, and with it these crystals, will result in an insane explosion doing:<br>{@damage 100+10d10} energenetic damage within 2 meters,<br>{@damage 50+10d6} energenetic damage within 2-6 meters,<br>{@damage 20+5d4} energenetic damage within 6-20 meters,<br>and {@damage 10+4d4} explsosion damage within 20-60 meters."			
		]
	},
	{
		"name": "ABIR Shield",
		"source": "CDPH",
		"type": "Shield",
		"rarity": "Special",
		"MC": "1 MP",
		"weight": 1,
		"entries": [
			"A weirdly looking shield of around 10-15 cm with a logo depicting the words <i><b>{@color <u>R-Tech</u>|9e3c3c}</b></i> on it.",
			"The shield can be attached onto a piece of clothing, like most shields. When an attack hits or goes through the active shield, then they need to roll a d4 and the shield will do one of the following things depending on the outcome:",
			{
				"type": "table",
				"caption": "Rollable Table Caption",
				"colLabels": [
					"{@dice d4}",
					"Item"
				],
				"colStyles": [
					"col-1 text-center",
					"col-11"
				],
				"rows": [
					[
						{
							"type": "cell",
							"roll": {
								"exact": 1
							}
						},
						"Amplify – The object going through gets an increased speed depending on the mass and current speed of the object. This would normally increase the damage done by {@dice 2d4+4}, but can have other effects as well. This works with objects weighing up to 1 ton."
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 2
							}
						},
						"Block – The object gets completely stopped and blocked by the shield. No force is put on the shield (or its potential user), and only on the object that was blocked. This works with objects weighing up to 80 kiloton."
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 3
							}
						},
						"Ignore – The object going through the shield gets ignored by the shield and no effect happens."
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 4
							}
						},
						"Reflect – The object’s velocity gets inversed, making it go to the opposite direction with the speed it hit the shield with, with all the effects that entails. This works with objects weighing up to 10 ton."
					]			
				]
			},
			"It costs 1 Maintenance Point to make this shield more stable, but it cannot be made permanently stable.<br>When maintained, you can choose which effects happens on the first two times the shield gets hit every 24 hours or maintanence cycle.<br>The damage added from the “Amplify” effect can be doubled when it is maintain it as well, changing it to {@damage 4d4+8}."
		]
	},
	{
		"name": "Metly’s Pistol ",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"A classic looking pistol made out of steel and very hard wood. It shoots a random projectile when fired. What the pistol shoots depends on a d12.",
			{
				"type": "table",
				"caption": "Rollable Table Caption",
				"colLabels": [
					"{@dice d12}",
					"Projectile",
					"Max Range",
					"Damage/Effect"
				],
				"colStyles": [
					"col-1 text-center",
					"col-2",
					"col-2",
					"col-8"
				],
				"rows": [
					[
						{
							"type": "cell",
							"roll": {
								"exact": 1
							}
						},
						"Teleporting Projectile",
						"15 Meter",
						"randomly teleports shooter 5 meter in a random direction from the point of impact"

					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 2
							}
						},
						"Exploding Projectile",
						"11 Meter",
						"{@damage 4d4+4} explosion damage in a 1 meter radius around impact"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 3
							}
						},
						"Normal Bullet",
						"15 Meter",
						"{@damage 1d6+1} piercing damage"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 4
							}
						},
						"Rubber Bullet",
						"12 Meter",
						"{@damage 1d6+1} bludgeoning damage and {@damage 1d6+1} knockout damage"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 5
							}
						},
						"Fire Stream",
						"7 Meter",
						"{@damage 2d6-1} fire damage in an area (line) that also sets hit flammable objects aflame"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 6
							}
						},
						"Laser",
						"15 Meter",
						"{@damage 1d6+1} laser damage"
					],	
					[
						{
							"type": "cell",
							"roll": {
								"exact": 7
							}
						},
						"Plasma",
						"12 Meter",
						"{@damage 1d4+3} plasma damage"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 8
							}
						},
						"Electric Arc",
						"8 Meter",
						"{@damage 1d6+1} electric damage to 3 random characters or things in a cone"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 9
							}
						},
						"Cold Plasma",
						"18 Meter",
						"a slow bolt of cold plasma dealing {@damage 1d4+1} cold plasma damage"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 10
							}
						},
						"Explosion",
						"N.A.",
						"creates an explosion at the end of the gun dealing {@damage 4d4+4} explosive damage in a 2 meter radius, and does half damage to the shooter"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 11
							}
						},
						"Cold Air",
						"9 Meter",
						"{@damage 2d6-1} cold damage that condenses air and cools/freezes objects hit"
					],
					[
						{
							"type": "cell",
							"roll": {
								"exact": 12
							}
						},
						"All of the Above",
						"N.A.",
						"unaimable - may the gods have mercy on you and anyone near you"
					]	
				]
			},
			"It costs 4 Maintenance Point to make this pistol stable.<br>When maintained, you can change what the pistol shoots at will with a dial on the side. What it shoots can be chosen out of the list."
		]
	},
	{
		"name": "Clean Up",
		"source": "CDPH",
		"type": "Mod",
		"cability": "WM",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"You keep your weapon extremely clean on the daily." ,
			"Damage rolls with your weapon gain +1 Damage."
		]
	},
	{
		"name": "Redistributing Weight",
		"source": "CDPH",
		"type": "Mod",
		"cability": "WM",
		"rarity": "Special",
		"MC": "0 MP",
		"entries": [
			"You redistribute the weight of your weapon to make it more handleable.", 
			"Attack rolls with your weapon gain +1 to hit."
		]
	},
	{
		"name": "Loosen the Trigger - (Ranged Weapons Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "WM",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"You loosen the trigger of your firearm, making it more responsive for firing on reaction.",
			"Attack rolls with your weapon gain +2 to Hit when you use your Hold Action to attack."
		]
	},
	{
		"name": "Sanding - (Melee Weapons Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "WM",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"You sand your weapon on the daily to keep it as sharp as it can be, making it better at cutting through armor.",
			"Your weapon gains +3 DR penetration."
		]
	},
	{
		"name": "Improvised Silencer - (Guns Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"You add an improvised silencer to the barrel of your weapon, making it a lot quiter when you shoot with it.<br>This effects all gun types that aren't based on energenetic damage, but works the best on pressure based guns."
		]
	},
	{
		"name": "Improvised Extended Magazine - (Guns Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"Your weapon can hold twice as many shots before needing to reload it."
		]
	},
	{
		"name": "Improvised Laser Sight - (Guns only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"Your weapon can hold twice as many shots before needing to reload it."
		]
	},
	{
		"name": "Improvised Extended Barrel - (Guns only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"The minimum and maximum range of your weapon is multiplied by 1.5 (Non-Laser Weapons only) and your weapon gains +2 Damage (Coil and Laser only)."
		]
	},
	{
		"name": "Sawn Off - (Guns only) - (Cannot be used together with barrel extensions)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"entries": [
			"Your weapon’s barrel is mostly removed making it more easily concealable, but it’s maximum effective an total range are both 0.5 meters now."
		]
	},
	{
		"name": "Improvised Stock - (Guns only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"Your weapon gains +4 to Hit as long as you didn’t move or took any Action or Bonus Action yet this turn. Firing a weapon with this modification changes your maximum movement to 0 until the start of your next turn."
		]
	},
	{
		"name": "Smoothed Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"entries": [
			"Your Light Armor gets +1 AC."
		]
	},
	{
		"name": "Hardened Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "IA",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"Your Armor gets +1 to DR."
		]
	},
	{
		"name": "SSE - (Melee Weapons with Slicing or Piercing Damage only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"Sharpened Serrated Edge. You serrate the edge of your weapon. While this should not be allowed as for the Geneva convention of 177 BNC, these treaties are non-existent anymore as space colonization increased and new alien states were found. Your weapon gains -2 to Hit on attack rolls.<br>It also gets +4 Damage against most organic (carbon and silicon based) life."
		]
	},
	{
		"name": "Increased Mass - (Melee Weapons Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"entries": [
			"While your weapon doesn’t do that much more damage, it’s easier to push people around with it now. Your weapon gains +1 Damage, and now only need to do half someone’s Strength Score of damage to push someone 1 meter. It is also 1.5 times as heavy."
		]
	},
	{
		"name": "Improvised Long Range Scopes - (Guns Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"You add a medium to long range scope to your gun. This doubles the maximum total range of your gun. It can also be used as an improvised periscope."
		]
	},
	{
		"name": "Improvised IR Modification - (Laser based weapons only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"You modify your Laser based weapon quite a bit, including a large part of the amplification mechanism of the actual used laser. You change this into a far-IR based laser, which is invisible to most creatures. Your weapon gains -1 on to Hit rolls as it is harder to trace where you are firing."
		]
	},
	{
		"name": "Thickened Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"entries": [
			"Your Medium, Heavy or Power Armor gets +2 DR."
		]
	},
	{
		"name": "Shaped Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"Your Medium Armor gets +3 AC, or your Heavy or Power Armor gets +2 AC."
		]
	},
	{
		"name": "Improvised Bump Stock - (Cannot be used with other Stocks)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"You make a bump stock for your gun and attach it.<br>This increases the rate at which you can fire your gun accurately quite a bit. If you fire your gun as your Action, then you can now also shoot with your gun as a Bonus Action on the same turn if the weapon doesn’t have the Bolt-Action trait. You do gain -4 to Hit if you fire this weapon after moving.<br>Firing a weapon with this modification changes your maximum movement to 0 until the start of your next turn."
		]
	},
	{
		"name": "Improvised Underbarrel Launcher (Non-pistol Coil & Plasma based guns only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You attach an improvised underbarrel launcher to gun. You can now fire this modification as an Action. The barrel is 12 cm in diameter, and is as long as your weapon’s normal barrel. It can shoot anything that is non-magnetic, or is specifically made to be shot with an Underbarrel Launcher, like grenades. It does 2 bludgeoning damage if you hit someone with it that is within 2 meters of you, and it does 2 Knockout Damage if the target is more than 2 meters away. The maximum range of the modification heavily depends on the projectile that you fire with it, but estimates are around 5 meters with a 100 gram projectile, and 40 meters for a 3 kg projectile or grenades."
		]
	},
	{
		"name": "Iron Reinforcement",
		"source": "CDPH",
		"type": "Mod",
		"cability": "AA",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"You can add solid iron reinforcement to your armor, giving +1 DR, making it a bit heavier and less maneuverable, but giving it +10 DR against Energenetic Damage, and changing Energenetic Damage to Heat Damage."
		]
	},
	{
		"name": "Plasma Torch - (Non-pistol Plasma based guns only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"You modify your plasma based gun so that it shoots a wide constant stream of plasma instead of a single shot. Because of this, your gun now does an damage over an area, which depends on the weapon type that you modified which can be seen below, but it always does Plasma damage.<br>The hit area won’t penetrate or go around cover normally, which means that people in full or 2/3 cover from you won’t get hit by a ranged attack made with this gun. You do not need to make an attack roll. Instead, everyone in the hit area will need to make a Dexterity or Constitution Saving throw against an DC of 10 + Attack Roll Bonus.<br>This plasma is able to set things aflame in the area of effect.",
			{
				"type": "table",
				"caption": "Energenetic ",
				"colLabels": [
					"Weapon Type",
					"Shots per Magazine",
					"Maximum Range (m)",
					"Damage",
					"Other"
				],
				"colStyles": [
					"col-2",
					"col-3",
					"col-3",
					"col-3",
					"col-5"
				],
				"rows": [
					[
						"SMG",
						5,
						8,
						"{@damage 3d4}",
						"+1 to Hit Bonus, Area (Cone) Only"
					],
					[
						"Assault Rifle",
						5,
						15,
						"{@damage 2d6+2}",
						"Area (Line) Only"
					],
					[
						"Shotgun",
						5,
						5,
						"{@damage 4d4+1}",
						"+3 to Hit Bonus, Area (Cone) Only, Foldable"
					],
					[
						"Hunting Rifle",
						4,
						20,
						"{@damage 2d6+2}",
						"Area (Line) Only"
					],
					[
						"Sniper Rifle",
						3,
						50,
						"{@damage 4d4+1}",
						"-2 to Hit Bonus, Area (Line) Only, Foldable"
					],
					[
						"LMG",
						3,
						20,
						"{@damage 3d4+1}",
						"Area (Line) Only, Heavy"
					]
				]
			}
		]
	},
	{
		"name": "Plasma Engulfing - (Metal Melee Weapon Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"You place some plasma throwers on your weapon which engulfs the entirety of the main damaging part of the weapon in red hot plasma, which, although cold for your average plasma, still does quite a bit of extra damage to most things but without melting your weapon.<br>Your weapon gains +2 Plasma Damage if the weapon is a dagger, +4 if the weapon is any other weapon that doesn’t have the Heavy trait, and +6 if it is a weapon with the Heavy trait."
		]
	},
	{
		"name": "Computer Assisted Strike Control - (Melee Weapon Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "6 MP",
		"entries": [
			"You can adapt a melee weapon to make it help you use it in battle. By placing some processors, small sensors, and motors (for turning and torque) in it.<br>Your weapon’s to Hit modifier becomes +6, no matter the proficiency of the creature using it, or other possible modifiers that would change it, whether beneficial or not.<br>The Crit Range of the weapon also lowers by 1."
		]
	},
	{
		"name": "Automatic Bolt Action - (Guns with the Bolt Action trait only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"You remove the Bolt Action trait from a gun by fully automating the emptying and filling of the main chamber. This modification is quite small, and changes the weapon into a normal semi-automatic weapon. This does increase the amount of force needed to pull the trigger quite a lot. This is no real problem in situations that do not require quick reaction. But using your Hold Action to Attack something with this weapon now gives you a -8 to hit bonus."
		]
	},
	{
		"name": "Superlight Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can remove the DR bonus of your Light Armor to add it to its AC twice."
		]
	},
	{
		"name": "Resistant Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can add a form of resistance to your Medium Armor. The options for resistance that you can add are:<br>Bludgeoning, Piercing & Slashing, Plasma, Laser, Heat, Cold, Electric."
		]
	},
	{
		"name": "Superheavy Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can remove the AC bonus of your Heavy Armor and add it to its DR. It is now also twice as heavy."
		]
	},
	{
		"name": "Specialized Armor",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"You can change Light Armor in such a way that it gives the edge in some specific situations. You can add advantage on a specific skill check. The skills where you can get advantage on are:<br>Acrobatics, Stealth, Stamina, Animal Handling, Deception, Intimidation, Performance."
		]
	},
	{
		"name": "Energy Cell Overload - (Energy Based Guns Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"entries": [
			"A very expensive grenade.<br>You can overload an energy based weapon (a coil or plasma based weapon for example) to make it explode. This only works if the Energy Cell in the weapon is still partially full, and it costs 3 actions as long as the gun doesn’t get fired while priming the explosion, instead of taking a whole Rest like other modifications. To most it will be quite obvious that you are priming the explosion if they see you or are close to you. You need to see the weapon while priming, so it cannot be done behind yourback or on feeling alone. When primed, the gun will explode after {@dice 1+1d4} turns. The gun fully explodes and cannot be repaired to a functional state, if it can be repaired at all. The explosion has a radius of 6 meters. Everyone in the explosion radius need to roll a Constitution Save (DC of 21) and get {@damage 4d6+26} damage on a fail, or half on a success."
		]
	},
	{
		"name": "Improvised Cryosystem - (Pressure & Coil Based Guns Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"This modification lets you shoot projectiles made out of “ice”.<br>You modify the bulk of your weapon for this modification. Only the barrel doesn’t need any changes made to it. You need special ammunition for this weapon, as well as an energy cell if you modified a pressure based gun. This special ammunition is a container of an highly pressurized and supercooled mix of oxygen and nitrogen that basically, when injected into the main chamber, solidifies and becomes a piece of ammunition that you shoot immediately afterward. You can carry 1 canaster which you can refill in a Rest if you have access to specialized venders in any capacity. The amount of rounds that you can shoot with a full canaster, together with other stats, is based on the weapon type that you modified, which can be seen down below. The weapon also changes in a few ways:<br>If the weapon was fully-automatic, then it practically becomes semi-automatic as the automatic firing rate is decreased drastically.<br>The weapons maximum effective range now also becomes it’s maximum range in general, as the ammunition sublimated too much after that point to do any significant damage.<br>Projectiles shot leave a trail of mist as it condenses the water in the air around it (For those who played TF2, it is like the Machina, but without the dye in the tracer).<br>The projectiles don’t usually bent when they hit something. They stay intact, break, or get pulverized after which they sublimate into oxygen and nitrogen within a few seconds to a minute or 2.<br>The damage type of the weapon can now be seen as Cold for overcoming resistance and immunity to Piercing damage.",
			{
				"type": "table",
				"caption": "Energenetic ",
				"colLabels": [
					"Weapon Type",
					"Minimum Effective Range (m)",
					"Maximum Effective Range (m)",
					"Maximum Total Range (m)",
					"Damage",
					"Ammo per Canaster",
					"Other"
				],
				"colStyles": [
					"col-2",
					"col-3",
					"col-3",
					"col-3",
					"col-3",
					"col-3",
					"col-3"
				],
				"rows": [
					[
						"Pistol",
						0.5,
						18,
						18,
						"{@damage 1d6+1}",
						8,
						""
					],
					[
						"SMG",
						0.5,
						10,
						10,
						"{@damage 1d4}",
						20,
						""
					],
					[
						"Assault Rifle",
						3,
						30,
						30,
						"{@damage 1d8+1}",
						12,
						""
					],
					[
						"Hunting Rifle",
						5,
						150,
						150,
						"{@damage 2d6}",
						6,
						"Foldable"
					],
					[
						"Sniper Rifle",
						5,
						500,
						500,
						"{@damage 3d4+3}",
						5,
						"Foldable"
					],
					[
						"LMG",
						12,
						50,
						50,
						"2",
						30,
						"Can shoot as a Bonus Action if you didn't use any movement and used your Action to shoot with this firearm as well."
					],
					[
						"Shotgun",
						1,
						5,
						5,
						"{@damage 3d4+2}",
						4,
						"+5 to Hit Bonus, Area (Half-Circle) Only, Only does Cold damage (Not only for overcoming resistances)"
					]
				]
			}
		
		]
	},
	{
		"name": "Wave Extender - (Pressure & Coil based guns only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "10 MP",
		"entries": [
			"You change most of your gun for this modification, as almost every part needs to change at least a bit for this to work. This modification changes your solid projectiles into macro-scale wavefunctions.<br>This lessens the force that the projectile can give on a point as its kinetic energy gets spread over a larger volume when it hits something solid. The total damage of your weapon is halved because of this, and changes to True Damage instead of Piercing. On the other hand, it does ignore most types of cover (depending on the material, normally it ignores all effects of 1/3 and 2/3 cover, and the DR bonus from full cover), and the weapon gets 30 + 50% DR penetration."
		]
	},
	{
		"name": "M.I.H.C. - (Coil based guns only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"This modification lets you shoot projectiles made from molten iron.<br>You extend and overclock the barrel of a Coil based gun. The added extended barrel looks like it would belong to a plasma based gun. The barrel now not only propels the ammunition forward, it also warms it up, melting it with magnetic induction. This changes a few things of how the weapon works.<br>The gun’s damage now changes to Heat Damage, instead of being Piercing. Because of this, the projectiles sometimes starts fires when hitting flammable objects.<br>The maximum effective range of the weapon is now halved, as the blobs of liquid metal solidify and change course a bit after a certain amount of distance.<br>Also, because the projectiles are now liquid, the residue of the projectile is now a clump of metal (usually), instead of a (bent or fractured) metal rod.<br>This could, for example, be used to fill in a classic keyhole making it unusable, weld a metal trashcan to a non-flammable ground, boil a glass of water by shooting slow droplets of liquid metal into it and the like."
		]
	},
	{
		"name": "Self-Dispersing Matter - (Pressure & Coil Based Guns Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"This modification is good for dealing knockout damage.<br>You change your gun to an almost unrecognizable state. This modification destabilizes the matter of the solid ammunition so much that it disperses the moment it hits something, dispersing the energy it puts out over a larger area of the thing you hit.<br>This doesn’t affect the total amount of damage at all, but does change all the damage output to knockout damage as the worst thing you can do with this gun is bruise someone badly. A dispersing projectile also fills the air with a gaseous form of the ammunition material used, which probably becomes quite toxic if you empty a magazine in a small space.<br>This weapon’s effective range is halved, as the projectiles are affected by changes in air much more than normal."
		]
	},
	{
		"name": "Self-Dispersing Matter - (Pressure & Coil Based Guns Only)",
		"source": "CDPH",
		"type": "Mod",
		"cability": "EA",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"This modification is good for dealing knockout damage.<br>You change your gun to an almost unrecognizable state. This modification destabilizes the matter of the solid ammunition so much that it disperses the moment it hits something, dispersing the energy it puts out over a larger area of the thing you hit.<br>This doesn’t affect the total amount of damage at all, but does change all the damage output to knockout damage as the worst thing you can do with this gun is bruise someone badly. A dispersing projectile also fills the air with a gaseous form of the ammunition material used, which probably becomes quite toxic if you empty a magazine in a small space.<br>This weapon’s effective range is halved, as the projectiles are affected by changes in air much more than normal."
		]
	},
	{
		"name": "Diamond Breaker",
		"source": "CDPH",
		"type": "Gear",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"You create a giant metal glove like item with a piercing spike that you can wear like a boxing glove. You cannot hold anything with the hand wearing it. While wearing this, any Strength Checks that you make using this item increase by 8.<br>You can also break or punch through most normal walls with this thing, up to a maximum of around 2 cm normal steel."
		]
	},
	{
		"name": "Improvised Plasma Cutter",
		"source": "CDPH",
		"type": "Tool",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"You can create a Plasma Cutter that can burn through most materials. While it costs time to cut through most things, it can cut through most materials with a maximum thickness of around 6 cm. This flame is extremely hot, and will burn most things it comes in contact with, although it is hard to ignite things with it."
		]
	},
	{
		"name": "Improvised Grappling Hook",
		"source": "CDPH",
		"type": "Gear",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "1 MP",
		"entries": [
			"You can craft a grappling hook that you can use to get to high places, or to cross gaps. The hook can be shot into a wall or ceiling or it can be hooked behind a railing to give it grip for example. You can shoot this hook up to 30 meters high. The wire isaround 5 mm thick and made out of braided cheap metal wire. It can withstand up to 4 kilonewton, or 400 kg."
		]
	},
	{
		"name": "Improvised Scaling Grappling Hook",
		"source": "CDPH",
		"type": "Gear",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"You can craft a grappling hook that you can use to get to high places, or to cross gaps. The hook canbe shot into a wall or ceiling or it can be hooked behind a railing to give it grip for example. You can shoot this hook up to 200 meters high. The wire is around 15 mm thick and made out of braided metal wire. It can withstand up to 20 kilonewton, or 2000 kg."
		]
	},
	{
		"name": "Improvised Neural Interface",
		"source": "CDPH",
		"type": "Gear",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can craft a neural interface for you to connect to electronic devices or communicate with your Little Helper, and just general as a replacement of portable personal electronic devices like computers and phones.<br>The only problem is that you do need someone who knows how to install it, as the chances that you do know enough about augmentation is slim.<br>Because of this, you need a Player Character (whether that be you or someone else in your party) with a medicine score of at least 10, or a specialist in installing augmentations to install it."
		]
	},
	{
		"name": "Improvised Projected Electromagnetic Pulse Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can create an Improvised Projected Electromagnetic Pulse Rifle, or PEMPR for short. This is a weapon that you are proficient with, and does {@damage 2d8} electromagnetic damage with a +2 to Hit bonus. It’s range is the same as a {@item Laser Assault Rifle|CDPH}. It’s projectile is invisible to most forms of detection, and travels at almost the speed of light. It won’t damage most organic lifeforms as it does electromagnetic damage. But on the other hand, electronic based items and creatures like robots are generally weak to it."
		]
	},
	{
		"name": "Improvised Holographic Projector ",
		"source": "CDPH",
		"type": "Gear",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"You can create an item that can project a holograph of something or someone. It is a circular object of around 10 cm in diameter that flattens itself when projecting something. This hologram looks real, and needs an insight throw against a DC of around 14 (depending on the exact situation) to be able to figure out that it is a hologram. The hologram gets projected directly on and above the flattened projector. The projection doesn’t specifically float, so if it projects a person or object like a table, then said person or object does seem like it is standing directly on the ground. You do need a few photos or know the person or object well to be able to change it into a projection. The maximum area of the projection is around 2 by 2 by 2 meters."
		]
	},
	{
		"name": "Shield Overdrive",
		"source": "CDPH",
		"type": "Mod",
		"cability": "DIM",
		"rarity": "Special",
		"MC": "2 MP",
		"entries": [
			"You can double the DR bonus of your shield. After 3 hits, it turns back to the normal DR amounts until you rest again (and maintained it). Incompatible with {@item Stable Shield Overdrive|CDPH} and {@item Unstable Shield Overdrive|CDPH}."
		]
	},
	{
		"name": "Unstable Shield Overdrive",
		"source": "CDPH",
		"type": "Mod",
		"cability": "DIM",
		"rarity": "Special",
		"entries": [
			"You can triple the DR bonus of your shield. After 3 hits, it turns off for the next 24 hours or until your next rest. It doesn’t cost maintenance points to turn it back on again in said rest, but you do need your Mechanics Tools. Incompatible with {@item Shield Overdrive|CDPH} and {@item Stable Shield Overdrive|CDPH}."
		]
	},
	{
		"name": "Shield Type Change",
		"source": "CDPH",
		"type": "Mod",
		"cability": "DIM",
		"rarity": "Special",
		"entries": [
			"You can change the type of Standard Shields and Heavy Shields. You can now change them between Kinetic, Energy or Energenetic."
		]
	},
	{
		"name": "Enthalpy Modifier",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "3 MP",
		"entries": [
			"You can create an object that can heat or cool an area to a set temperature. It is basically a small temperature controller that slowly but surely warms up or cools down an area of maximally the size of a standard room. The maximum and minimum temperature this machine can achieve in a roomare 125 °C and -25 °C respectively at a heating or cooling rate of around 2 °C per hour."
		]
	},
	{
		"name": "SCEC Power Source",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can create a semi-infinite electrical power source out of a string connected energenetic crystal. You can create a recharger out of it for example, but you can also use it for other things.<br>Normally, it gives 2 to 8 kilowatts of power, but the specific amount shifts over time. If you create a recharger, than it will be able to recharge rechargeable power cells and batteries. An average power cell of a weapon or tool can be recharged in 3 to 9 hours."
		]
	},
	{
		"name": "Improvised Energenetic Weapons",
		"source": "CDPH",
		"type": "WeaponRU",
		"cability": "FN",
		"rarity": "Special",
		"MC": "6 MP",
		"entries": [
			"You can create a Pistol or Long Rifle that shoots energenetic projectiles. The type of energenetic crystal, and with extension, the kind energenetic damage that your weapon does can be of one of the following types: <b>Dark</b>, <b>Light</b>, Space, Time, <br>Chaos</b>, Psychic, Entropy, and any type of Magic. While the types in bold are normally used, the other ones can be chosen. This weapon does counts as a typical Pistol or Hunting Rifle for proficiency, and you are proficient in using your own creations by definition.",
			{
				"type": "table",
				"caption": "Energenetic ",
				"colLabels": [
					"Weapon Type",
					"Minimum Effective Range (m)",
					"Maximum Effective Range (m)",
					"Maximum Total Range (m)",
					"Damage",
					"Other"
				],
				"colStyles": [
					"col-5",
					"col-3",
					"col-3",
					"col-3",
					"col-3",
					"col-3",
					"col-3"
				],
				"rows": [
					[
						"Energenetic Pistol",
						0.5,
						30,
						100,
						"{@damage 1d8+2}",
						""
					],
					[
						"Energenetic Long Rifle",
						5,
						200,
						2000,
						"{@damage 3d6}",
						"Bolt-Action"
					]
				]
			}
		]
	},
	{
		"name": "Dimensional Stabilizer",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"You can create a small, cylindrical machine of around 30 cm high and 15 cm diameter that stabilizes the time and space dimensions around you. Any change from the natural flow of time, and any change in the space dimension in a maximum radius of 15 meters around you will be neutralized and have no effect in this area if the item is on.<br>The radius of effect can be adjusted from 0.2 meters to 15 meters."
		]
	},
	{
		"name": "Energenetic Inhibitor",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "7 MP",
		"entries": [
			"You can create a small machine the size of a small backpack which you can turn on and off. If you turn it on, any form of energenetic flow in a 10 meter radius will be nullified, destroying any effect it would have. Also, using energenetics in a 20 meter radius around you now costs double the energy than it would normally. This effect can be felt by people who are well known in their use of energenetics.<br>This machine does have a limit on how much flow of energy it can nullify, and can break when its limits are heavily tested. In the worst case, it can blow up creating a very big and very devastating explosion."
		]
	},
	{
		"name": "Energenetic Matter Fabricator",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"You can create a small machine that can create regular matter. You can normally only create raw stable chemical elements with this, but you can modify this machine a bit to create small amounts of horrible tasting food and water that can very poorly sustain 5 people. This machine can maximally create around 200 grams of material per hour."
		]
	},
	{
		"name": "Portable Improbability Drive",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can make a Portable Improbability Drive. It looks like a small metal box, of around 15 by 25 cm ground surface, and 15 cm high. It has a switch to turn it on and off, and it runs on Entropy energy.<br>When turned on, it will give the following effect in a25 meter radius:<br>• All D20 rolls higher than 10 will get a +5 modifier to its roll.<br>• All D20 rolls from 6 to 10 will get a -5 modifier to its roll.<br>• All D20 rolls from 1 to 5 will be considered a natural 1, and with that, a crit fail.<br>• Some very improbable things can happen."
		]
	},
	{
		"name": "Stable Shied Overdrive",
		"source": "CDPH",
		"type": "Mod",
		"cability": "FN",
		"rarity": "Special",
		"MC": "4 MP",
		"entries": [
			"You can double the DR bonus of your shield.<br>Incompatible with {@item Shield Overdrive|CDPH} and {@item Unstable Shield Overdrive|CDPH}."
		]
	},
	{
		"name": "Temporal Destabilizer",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "7 MP",
		"entries": [
			"You can create a small device (around 12 by 12 by 25 cm) with a very rudimentary Energenetic Crystal with Time Energy. After you use this item, you need to maintain it again, meaning you can use this item only once every 24 hours or rest, whichever is shorter. You can activate this item quickly, meaning that if you are holding it (or connected it to a quickly accessible portable device like a remote you are holding) you can use it as a bonus action or reaction.<br>Using this item stops time for 2 turns for everything in a 1 to 3 lightyear radius around you, that isn’t you.<br>You gain advantage on some (DM decided) skill checks, saving throws and attack rolls while time is stopped."
		]
	},
	{
		"name": "Spacetime Relocator",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"You can create two small devices, a receiver (around 8 by 8 by 8 cm cube) and a relocator (5 by 5 by 3 cm sphere).<br>When you use the relocator, you and all creatures that are touching you teleport to space directly around the receiver cube.<br>The space you teleport to cannot be filled with other things or creatures, nor can it put you through walls. If it can’t fit all the creatures through, only you will teleport to the receiver. If it doesn’t fit you either, than it doesn’t do anything.<br>Because the high strain on the device, teleporting further than 1000 km with this item is a really bad idea, and has quite a big chance to explode the receiver and relocator if not done without active stabilization."
		]
	},
	{
		"name": "Light Redirector Shield",
		"source": "CDPH",
		"type": "Gear",
		"cability": "FN",
		"rarity": "Special",
		"MC": "5 MP",
		"entries": [
			"You can make a shield that redirects light around itself in a 1 meter sphere, but amplifying a bit of that light to let it through, making anything inside it completely invisible to observers outside of the sphere while still being able to look out of it.<br>When correctly calibrated, you can make it work in such a way that it doesn’t make the ground underyou invisible as well, but it will still turn everything in a 1 meter radius around you invisible.<br>It won’t turn entire things invisible though, just the part inside of the sphere."
		]
	},
	{
		"name": "Adrenaline Shot",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "common",
		"entries": [
			"Using an adrenaline shot on someone gives them an extra Action and Bonus Action next turn, and gives them double speed for the next 5 minutes. Afterward, for 5 minutes, the speed of the person is halved and they gain disadvantage on any Dexterity or Charisma based roll. Also they cannot take an Action on the turn that the positive effect ends, and they gain 1 Exhaustion. Extending the time of the Adrenaline Shot by giving another one extends the time until the debuffs happen, but doesn’t extend the time the buffs are applied. If you use an Adrenaline Shot on someone who is sleeping, than they wake up with the expected effects. If you use it on someone who is at 0 HP, than that person gains 1 HP and gains the expected positive effects for 5 turns after which no negative effects happen."
		]
	},
	{
		"name": "Medical Hypo",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "common",
		"entries": [
			"You can use this Injection as a Bonus Action. It heals for 11 HP instantly." 
		]
	},
	{
		"name": "Sedative Injection",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "uncommon",
		"entries": [
			"Using a Sedative Injection on someone does not do anything immediately.<br>It costs 30 seconds or 10 turns until it starts affecting an injected person. When it starts, said person needs to make a Constitution Save every turn, starting at a DC of 0 which increases by 1 every turn. This effect ends if they push through it to a DC of 20. They gain disadvantage on any Strength, Dexterity and Charisma based roll while they make Constitution Saves because of this, and they fall unconscious when they fail.<br>They wake up again after 30 minutes when they are not interrupted, after 5 minutes if they take anydamage, and they wake up instantly if they lose 20% or more of the HP the fell asleep with while they are asleep." 
		]
	},
	{
		"name": "Royal Jelly",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "rare",
		"entries": [
			"A Drug that cures you of most common diseases and for a short time makes you immune to most bacterial diseases. This immunity effect lasts for 12 hours. This Drug doesn’t work on toxins. While curing someone does need a full dose, the ability to make you or someone immune can be split into two parts of 5 hours each if needed. This means that you can also give 5 hour twice, or 12 hours immunity once per batch." 
		]
	},
	{
		"name": "Truth Serum",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "rare",
		"entries": [
			"You are sure that this is illegal, but sometimes extreme problems require extreme solutions.<br>Injecting this serum into someone makes it a lot harder for them to lie for 20 minutes. It isn’t impossible, and doesn’t work as good as intended, but at least it is now quite easy to spot a deliberate lie from the effected person as they gain -8 on deception and insight.<br>It should be noted that because of the chemical haze that they are in, any form of pressure to answer a certain way, or any leading questions are more often followed up which can lead to the affected person telling things that they think is completely true but really isn’t." 
		]
	},
	{
		"name": "Toxic Serum",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "rare",
		"entries": [
			"A basic toxin that slowly deals damage to someone.<br>When you inject someone with it the toxin will slowly get injected into the person as long as the injector pierces their skin. The moment the injector is pulled out the effect ends, which costs an Action to do. The person who is affected gets 7 toxic damage. As long as they haven’t pulled it out, they get damaged by one less damage the start of every turn until the given damage hits 0 at which point the injector is empty. An effected person doesn’t immediately die if they get to 0 HP by this effect. If the amount of toxic damage the injection does is less than 6, the effect ends and they become unconscious but stable. If it is more, the person dies or gains a fail on their death saves and the effect ends." 
		]
	},
	{
		"name": "Concoction of a Nobel Dream",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "very rare",
		"entries": [
			"An Injection that revives people.<br>You can only make one of these in a Rest with you as the materials that you need to make it are insanely hard to come by.<br>You can inject someone with this Concoction, but this only works on any creature that didn’t die by the chunky salsa rule. You also need to inject said person within 3 minutes of their death to make it work. Doing so gives the injected person 1 HP and makes them conscious again, after which they also can take their turn immediately." 
		]
	},
	{
		"name": "Ergogenic Stimulants",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "uncommon",
		"entries": [
			"A mix of drugs that improves overall stamina and endurance without mayor side effects.<br>This Drug works for 3 hours and gives +5 Max Hp, +5 HP and also gives +6 on Constitution." 
		]
	},
	{
		"name": "Joy",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "legendary",
		"entries": [
			"A mental drug that lets you feel nothing… at all. It gives a full ignorance’s bliss for everything. You know for sure that this drug is illegal. It works for 10 minutes and makes you immune to most mental abnormalities and intrusions. It is also the best painkiller you have ever seen as it removes any physical and mental pain someone has for the duration, including any form of emotion or caring for things. Other than that, it makes it extremely unclear if the effected person is telling the truth or not, but it also gives-10 on any {@skill stealth}, {@skill investigation}, {@skill animal handling} and {@skill insight}, and -20 to Charisma. It also gives +3 to Strength." 
		]
	},
	{
		"name": "Drug Cocktail",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "very rare",
		"entries": [
			"A non-lethal cocktail of different drugs that effect you in a positive way… mostly.<br>Also, you are quite sure this is pretty illegal to make and have, but oh well. When you inject someone with this it gives the following effects:<br>• +2 Strength for 10 minutes<br>• +2 Dexterity for 10 minutes<br>• -4 Constitution for 1 hour<br>• +2 Intelligence for 30 minutes<br>• +4 Wisdom for 1 hour<br>• +5 Charisma for 1 hour<br>• +1 meter speed for 10 minutes<br>• +5 Initiative for 1 hour<br>When the last good effect ends after 1 hour the aftermath starts. This gives -2 on every Ability Score for 2 hours. Also, you don’t really know how addictive this cocktail is, looking at how you mix quite a lot of very addictive drugs in it but in extremely sparse amounts.<br>Other Drugs from this class do not have any effect on any creature that is getting affected by this drug." 
		]
	},
	{
		"name": "Benign Chronos",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "legendary",
		"entries": [
			"This drug works for 15 minutes.<br>Using this drug enhances the dexterity and mental speed of people by an unimaginable amount, basically giving a very slight and limited form of precognition. This gives the following things to the affected creature:<br>• +6 to Dexterity Saving Throws<br>• +4 to Dexterity<br>• +3 Intelligence<br>• +5 {@skill perception}<br>• +4 {@skill stealth}<br>• +3 {@skill acrobatics}<br>It also lets creatures dodge undodgeable effects when affected. They can make Dexterity Saves when hit with undodgeable attacks and events like guaranteed-to-hit energenetic attacks or getting hit by lightning. You throw against a DC of 20 and fully dodge the attack if you succeed, not receiving any damage." 
		]
	},
	{
		"name": "Benign Chronos",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "legendary",
		"entries": [
			"This drug works for 15 minutes.<br>Using this drug enhances the dexterity and mental speed of people by an unimaginable amount, basically giving a very slight and limited form of precognition. This gives the following things to the affected creature:<br>• +6 to Dexterity Saving Throws<br>• +4 to Dexterity<br>• +3 Intelligence<br>• +5 {@skill perception}<br>• +4 {@skill stealth}<br>• +3 {@skill acrobatics}<br>It also lets creatures dodge undodgeable effects when affected. They can make Dexterity Saves when hit with undodgeable attacks and events like guaranteed-to-hit energenetic attacks or getting hit by lightning. You throw against a DC of 20 and fully dodge the attack if you succeed, not receiving any damage." 
		]
	},
	{
		"name": "Nanomachines",
		"source": "CDPH",
		"type": "Drug",
		"rarity": "very rare",
		"entries": [
			"An Injection of healing nanomachines. It instantly heals for 17 HP, removes most forms of toxin out of the creature injected and makes them immune for toxins for the next hour.<br>This Injection, while you are not directly able to inject it into it, works on the hull of mechanical creatures and machines as well." 
		]
	},
	{
		"name": "Time Bagel",
		"source": "CDPH",
		"type": "Food",
		"rarity": "Legendary",
		"entries": [
			"XXXXXXXXXXXXXXXXXXXXXXXXXXX"
		]
	},
	{
		"name": "Backpack",
		"source": "CDPH",
		"type": "Gear",
		"weight": "0.5",
		"cost": "80", 
		"rarity": "common",
		"entries": [
			"A backpack, for packing stuff. Makes taking stuff with you quite a bit easier. Can fit around 15 kg of stuff." 
		]
	},
	{
		"name": "Duffel Bag",
		"source": "CDPH",
		"type": "Gear",
		"weight": "2",
		"cost": "300", 
		"rarity": "uncommon",
		"entries": [
			"A duffel bag, for packing stuff. Makes taking stuff with you quite a bit easier. Can fit around 150 kg of stuff." 
		]
	},
	{
		"name": "Antigrav Backpack",
		"source": "CDPH",
		"type": "Gear",
		"weight": "0.5",
		"cost": "300", 
		"rarity": "rare",
		"entries": [
			"A backpack, for packing stuff. Makes taking stuff with you quite a bit easier. Can fit around 15 kg of stuff. Anything in the backpack wont weigh you down." 
		]
	},
	{
		"name": "Antigrav Duffel Bag",
		"source": "CDPH",
		"type": "Gear",
		"weight": "2",
		"cost": "1000", 
		"rarity": "very rare",
		"entries": [
			"A duffel bag, for packing stuff. Makes taking stuff with you quite a bit easier. Can fit around 150 kg of stuff. Anything in the backpack wont weigh you down." 
		]
	},
	{
		"name": "Hoverboard",
		"source": "CDPH",
		"type": "VEHL",
		"entries": [
			"A small hovering vehicle, which can be used like a skateboard from the olden days.<br>You can use half a day of practice to learn how to use this item, and an extra two full days of practice to gain proficiency.",
			"While using the hoverboard your movement speed becomes 8 meters, or double that when proficient.<br>You gain disadvantage on Dexterity Saving Throws, Dexterity based Skill Checks and Attack Rolls if you are riding the hoverboard while you aren't proficient in using it.",
			"The hoverboard can hover over solid ground at a hight of 25 cm, and it cannot hover over liquids deeper than half a meter. It can hold a maximum of 250 kg.",
			{
				"type": "entries",
				"name": "Overdrive [X MP]",
				"entries": [
					"<br>You can overdrive the hoverboard to make it perform better.<br>For every point of maintenance you use on this item, it gains 2 meter movement, can fly an extra 25 cm higher, and can hold 25 kg more."
				]
			}
		]
	},
	{
		"name": "Sonic Screwdriver",
		"source": "CDPH",
		"type": "Tool",
		"entries":[
			
		]
	},
	{
		"name":"Pistol",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 1,
		"value": 50,
		"dmg1":"1d6+1",
		"dmgType":"P",
		"range": "0.5/15/40",
		"ammocap": 12,
		"gun": true,
		"pistol": true,
		"property":[
			"ammofire"]
	},
	{
		"name":"SMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 2,
		"value": 80,
		"dmg1":"1d6",
		"dmgType":"P",
		"range": "0.5/10/50",
		"ammocap": 28,
		"gun": true,
		"SMG": true,
		"burstcost": 7,
		"bursttype": "cone/line",
		"property":[
			"ammofire",
			"foldable",
			"burstfire"],
		"entries":[
			"<i>+1 to Hit Bonus</i>"]
	},
	{
		"name":"Assault Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 3.5,
		"value": 180,
		"dmg1":"1d8",
		"dmgType":"P",
		"range": "3/30/100",
		"ammocap": 32,
		"gun": true,
		"assault rifle": true,
		"burstcost": 8,
		"bursttype": "cone/line",
		"property":[
			"ammofire",
			"foldable",
			"burstfire"]
	},
	{
		"name":"Shotgun",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 3,
		"value": 130,
		"dmg1":"3d4",
		"dmgType":"P",
		"range": "1/20/50",
		"ammocap": 6,
		"gun": true,
		"shotgun": true,
		"property":[
			"ammofire"],
		"entries":[
			"<i>+1 to Hit Bonus</i>"]
	},
	{
		"name":"Hunting Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 4,
		"value": 160,
		"dmg1":"2d4",
		"dmgType":"P",
		"range": "5/150/250",
		"ammocap": 12,
		"gun": true,
		"longrifle": true,
		"property":[
			"ammofire",
			"boltaction"]
	},
	{
		"name":"Sniper Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 6.5,
		"value": 240,
		"dmg1":"3d4",
		"dmgType":"P",
		"range": "5/300/800",
		"ammocap": 8,
		"gun": true,
		"longrifle": true,
		"property":[
			"ammofire",
			"foldable",
			"boltaction"]
	},
	{
		"name":"LMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 9,
		"value": 350,
		"dmg1":"3d4",
		"dmgType":"P",
		"range": "8/50/100",
		"ammocap": 180,
		"burstcost":30,
		"bursttype": "cone/line <b>only</b>",
		"gun": true,
		"lmg": true,
		"property":[
			"ammofire",
			"burstfire",
			"heavy"],
		"entries":[
			"<i>+1 to Hit Bonus</i>"]
	},
	{
		"name":"Coil Pistol",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 1,
		"value": 50,
		"dmg1":"1d6+1",
		"dmgType":"P",
		"range": "0.5/18/40",
		"ammocap": 8,
		"gun": true,
		"pistol": true,
		"property":[
			"ammofire"]
	},
	{
		"name":"Coil SMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 2.5,
		"value": 90,
		"dmg1":"1d6",
		"dmgType":"P",
		"range": "0.5/10/60",
		"ammocap": 24,
		"gun": true,
		"SMG": true,
		"burstcost": 8,
		"bursttype": "cone/line",
		"property":[
			"ammofire",
			"foldable",
			"burstfire"
		],
		"entries":[
			"<i>+1 to Hit Bonus</i>"
		]
	},
	{
		"name":"Coil Assault Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 4,
		"value": 200,
		"dmg1":"1d8+1",
		"dmgType":"P",
		"range": "3/30/100",
		"ammocap": 24,
		"gun": true,
		"assault rifle": true,
		"burstcost": 11,
		"bursttype": "cone/line",
		"property":[
			"ammofire",
			"burstfire"			
		]
	},
	{
		"name":"Coil Shotgun",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 4.5,
		"value": 180,
		"dmg1":"5d4-5",
		"dmgType":"P",
		"range": "1/15/30",
		"ammocap": 4,
		"burstcost": 1,
		"bursttype": "cone <b>only</b>",
		"gun": true,
		"shotgun": true,
		"property":[
			"ammofire",
			"burstfire",
			"boltaction",
			"unconventional"],
		"entries":[
			"<i>+3 to Hit Bonus</i>"]
	},
	{
		"name":"Slugger",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "rare",
		"weight": 5,
		"value": 380,
		"dmg1":"4d4+1",
		"dmgType":["P","B"],
		"range": "1/10/100",
		"ammocap": 3,
		"gun": true,
		"shotgun": true,
		"property":[
			"ammofire",
			"boltaction",
			"unconventional"],
		"entries":[
			"<i>-1 to Hit Bonus<br>Ignores all flat DR.<br>Does double damage against objects.</i><br><br>A large shotgun-like firearm which fires large slugs of around 5 cm long and 3 cm in diameter at very high velocities.<br>",
		    "<br>"]
	},
	{
		"name":"Coil Hunting Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 4.5,
		"value": 175,
		"dmg1":"2d6",
		"dmgType":"P",
		"range": "5/150/500",
		"ammocap": 8,
		"gun": true,
		"longrifle": true,
		"property":[
			"ammofire",
			"boltaction",
			"foldable"]
	},
	{
		"name":"Coil Sniper Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 8,
		"value": 300,
		"dmg1":"3d4+3",
		"dmgType":"P",
		"range": "5/500/2000",
		"ammocap": 6,
		"gun": true,
		"longrifle": true,
		"property":[
			"ammofire",
			"foldable",
			"boltaction"]
	},
	{
		"name":"Coil LMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 10.5,
		"value": 340,
		"dmg1":"3d4+1",
		"dmgType":"P",
		"range": "8/50/100",
		"ammocap": 120,
		"burstcost":30,
		"bursttype": "cone/line <b>only</b>",
		"gun": true,
		"lmg": true,
		"property":[
			"ammofire",
			"burstfire",
			"heavy"],
		"entries":[
			"<i>+1 to Hit Bonus</i>"]
	},
	{
		"name":"Laser Pistol",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 1,
		"value": 45,
		"dmg1":"1d6+1",
		"dmgType":"La",
		"range": "0.5/15/30",
		"gun": true,
		"pistol": true,
		"property":[
			"foldable"],
		"entries":[
			"<i>+1 to Hit Bonus</i>"]
	},
	{
		"name":"Laser SMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 2.5,
		"value": 90,
		"dmg1":"1d6",
		"dmgType":"La",
		"range": "0.5/10/50",
		"gun": true,
		"SMG": true,
		"burstcost": 0,
		"bursttype": "cone <b>only</b>",
		"property":[
			"burstfire"]
	},
	{
		"name":"Laser Assault Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 4,
		"value": 160,
		"dmg1":"1d8",
		"dmgType":"La",
		"range": "3/30/80",
		"gun": true,
		"assault rifle": true,
		"burstcost": 0,
		"bursttype": "cone/line",
		"property":[
			"burstfire"],
		"entries":[
			"<i>+1 to Hit Bonus</i>"]
	},
	{
		"name":"Laser Shotgun",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 4.5,
		"value": 230,
		"dmg1":"3d4+2",
		"dmgType":"La",
		"range": "0/5/5",
		"burstcost": 0,
		"bursttype": "half-circle <b>only</b>",
		"gun": true,
		"shotgun": true,
		"property":[
			"burstfire",
			"foldable",
			"unconventional"],
		"entries":[
			"<i>+5 to Hit Bonus</i>"]
	},
	{
		"name":"Laser Hunting Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 4.5,
		"value": 120,
		"dmg1":"2d4",
		"dmgType":"La",
		"range": "5/100/200",
		"gun": true,
		"longrifle": true,
		"property":[
			"foldable"],
		"entries":[
			"<i>+2 to Hit Bonus</i>"]
	},
	{
		"name":"Laser Sniper Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 10,
		"value": 260,
		"dmg1":"3d4",
		"dmgType":"La",
		"range": "5/200/300",
		"gun": true,
		"longrifle": true,
		"property":[
			"foldable",
			"boltaction"],
		"entries":[
			"<i>+3 to Hit Bonus</i>"]
	},
	{
		"name":"Laser LMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 10,
		"value": 320,
		"dmg1":"3d4",
		"dmgType":"La",
		"range": "8/35/120",
		"burstcost":0,
		"bursttype": "cone/line <b>only</b>",
		"gun": true,
		"lmg": true,
		"property":[
			"burstfire",
			"heavy",
			"unconventional",
			"boltaction"],
		"entries":[
			"<i>+2 to Hit Bonus</i><br><br>Basically a bulky and cheaply made Pulse Laser."]
	},
	{
		"name":"Plasma Pistol",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "common",
		"weight": 1,
		"value": 60,
		"dmg1":"1d4+2",
		"dmgType":"PL",
		"range": "0.5/15/40",
		"ammocap": 12,
		"gun": true,
		"pistol": true,
		"property":[
			"ammofire"]
	},
	{
		"name":"Plasma SMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 2.5,
		"value": 100,
		"dmg1":"1d6+1",
		"dmgType":"PL",
		"range": "0.5/10/50",
		"ammocap": 24,
		"gun": true,
		"SMG": true,
		"burstcost": 11,
		"bursttype": "cone",
		"property":[
			"ammofire",
			"burstfire"],
		"entries":[
			"<i>-1 to Hit Bonus</i>"
		]
	},
	{
		"name":"Plasma Assault Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 3.5,
		"value": 240,
		"dmg1":"1d8+1",
		"dmgType":"PL",
		"range": "3/30/100",
		"ammocap": 8,
		"gun": true,
		"assault rifle": true,
		"property":[
			"ammofire"]
	},
	{
		"name":"Plasma Shotgun",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 4,
		"value": 180,
		"dmg1":"2d4+2",
		"dmgType":"PL",
		"range": "1/8/20",
		"ammocap": 6,
		"gun": true,
		"shotgun": true,
		"property":[
			"ammofire"
		],
		"entries":[
			"<i>+2 to Hit Bonus</i>"]
	},
	{
		"name":"Plasma Hunting Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "uncommon",
		"weight": 5,
		"value": 180,
		"dmg1":"2d4",
		"dmgType":"PL",
		"range": "5/100/200",
		"ammocap": 6,
		"gun": true,
		"longrifle": true,
		"property":[
			"ammofire"]
	},
	{
		"name":"Plasma Sniper Rifle",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "rare",
		"weight": 10,
		"value": 350,
		"dmg1":"2d6",
		"dmgType":"PL",
		"range": "5/200/300",
		"ammocap": 4,
		"gun": true,
		"longrifle": true,
		"property":[
			"ammofire",
			"foldable"]
	},
	{
		"name":"Plasma LMG",
		"source": "CDPH",
		"type": "WeaponRU",
		"rarity": "rare",
		"weight": 9.5,
		"value": 380,
		"dmg1":"3d4+1",
		"dmgType":"PL",
		"range": "8/20/100",
		"ammocap": 60,
		"burstcost":20,
		"bursttype": "cone/line <b>only</b>",
		"gun": true,
		"lmg": true,
		"property":[
			"ammofire",
			"burstfire",
			"heavy"
		],
		"entries":[
			"<i>-2 to Hit Bonus</i>"]
	},
	{
		"name":"Knife",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "common",
		"weight": 0.15,
		"value": 1,
		"dmg1":"1d6",
		"dmgType":["S","P"]
	},
	{
		"name":"Dagger",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "common",
		"weight": 0.2,
		"value": 5,
		"dmg1":"1d6+2",
		"dmgType":["S","P"]
	},
	{
		"name":"Sword",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "uncommon",
		"weight": 1.2,
		"value": 200,
		"dmg1":"1d6+2",
		"dmgType":["S","P"]
	},
	{
		"name":"Zweihander",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "uncommon",
		"weight": 2.6,
		"value": 350,
		"dmg1":"3d6-1",
		"dmgType":["S","P"],
		"property":[
			"heavy"],
		"entries":[
			"<i>-1 to Hit Bonus</i>"]
	},
	{
		"name":"Axe",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "common",
		"weight": 0.7,
		"value": 80,
		"dmg1":"2d4+2",
		"dmgType":"S"
	},
	{
		"name":"Waraxe",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "uncommon",
		"weight": 2.6,
		"value": 300,
		"dmg1":"3d4+2",
		"dmgType":"S",
		"property":[
			"heavy"],
		"entries":[
			"<i>-2 to Hit Bonus</i>"]
	},
	{
		"name":"Mace",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "uncommon",
		"weight": 2,
		"value": 150,
		"dmg1":"2d4",
		"dmgType":"B"
	},
	{
		"name":"Warhammer",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "uncommon",
		"weight": 3.4,
		"value": 300,
		"dmg1":"4d4+1",
		"dmgType":"B",
		"property":[
			"heavy",
			"twohand"],
		"entries":[
			"<i>-3 to Hit Bonus</i>"]
	},
	{
		"name":"Chainsaw",
		"source": "CDPH",
		"type": "WeaponM",
		"rarity": "common",
		"weight": 6.5,
		"value": 400,
		"dmg1":"4d4+1",
		"dmgType":"S",
		"property":[
			"heavy",
			"twohand",
			"special",
			"foldable"],
		"entries":[
			"<i>-1 to Hit Bonus<br>-1 Meter Speed when wielded</i><br>"]
	},
	{
		"name": "Leather Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorL",
		"weight": 4,
		"value": 200,
		"ac": "Dexterity Modifier (max 3)",
		"entries": ["Leather armor. Not the best protection, more stylish than anything else as it can be made into normal clothing like a jacket."]
	},
	{
		"name": "Lexar Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorL",
		"weight": 2,
		"value": 50,
		"ac": "1 + Dexterity Modifier (max 2)",
		"dr": 1,
		"entries": ["A cheap but lightweight armor made of a polymer blend called Lexar&trade;.<br>It restricts your movement a bit, but also offers a slight amount of protection."]
	},
	{
		"name": "Kevlar Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorL",
		"weight": 4,
		"value": 120,
		"ac": "2 + Dexterity Modifier (max 2)",
		"dr": 2,
		"entries": ["A Kevlar vest, made of the polymer kevlar.<br>It restrictis your movement a bit, but also offers some protection."]
	},
	{
		"name": "Dyneema Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorL",
		"weight": 2,
		"value": 120,
		"ac": "Dexterity Modifier",
		"dr": 3,
		"entries": ["A piece of armor made of UHMWPE fibres. Also goes by it's trivial name: Dyneema Armor.<br>It doesn't restrict movement, and gives a small but noticable amount of protection as well."]
	},
	{
		"name": "Carbon Fiber Armor",
		"source": "CDPH",
		"rarity": "common",
		"weight": 4,
		"value": 50,
		"type": "ArmorL",
		"ac": "2x Dexterity Modifier (max 5)",
		"dr": 1,
		"entries": []
	},
	{
		"name": "Stealth Armor",
		"source": "CDPH",
		"rarity": "very rare",
		"type": "ArmorM",
		"weight": 1,
		"value": 400,
		"ac": "4",
		"property":[
			"special"],
		"entries": ["<i>You gain advantage on Stealth Checks.</i>"]
	},
	{
		"name": "Woven Iron Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorM",
		"weight": 10,
		"value": 80,
		"ac": "2",
		"dr": 2,
		"edr": 10,
		"property":[
			"iron"],
		"entries": ["<i>This armor can be woven into normal clothes, making it not noticable as an armor.</i>"]
	},
	{
		"name": "Woven Aluminium Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorM",
		"weight": 4,
		"value": 75,
		"ac": "3 + Dexterty Modifier (max 2)",
		"dr": 3,
		"entries": ["<i>This armor can be woven into normal clothes, making it not noticable as an armor.</i>"]
	},
	{
		"name": "Fearmor Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorM",
		"weight": 8,
		"value": 105,
		"ac": "4",
		"dr": 3,
		"edr": 15,
		"property":[
			"iron"],
		"entries": [""]
	},
	{
		"name": "Osplir Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorM",
		"weight": 14,
		"value": 140,
		"ac": "4",
		"dr": 4,
		"resist": [
			"acid"],
		"entries": ["<i>This armor gives you resistance to acid damage.</i><br><br>Osplir Armor, made from an alloy of Osmium, Platinum and Iridium."]
	},
	{
		"name": "F9XS Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorM",
		"weight": 6,
		"value": 240,
		"ac": "4 + Dexterity Modifier (max 1)",
		"dr": 5,
		"entries": [""]
	},
	{
		"name": "Chainmail Armor",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "ArmorH",
		"weight": 9,
		"value": 160,
		"ac": "5",
		"dr": 3,
		"edr": 20,
		"property":[
			"iron"],
		"entries": [""]
	},
	{
		"name": "Plate Armor",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "ArmorH",
		"weight": 9.5,
		"value": 310,
		"ac": "5",
		"dr": 3,
		"edr": 40,
		"property":[
			"iron"],
		"entries": [""]
	},
	{
		"name": "Fullsteel Armor",
		"source": "CDPH",
		"rarity": "common",
		"weight": 8,
		"value": 240,
		"type": "ArmorH",
		"ac": "3",
		"dr": 8,
		"entries": ["*not actually made of steel."]
	},
	{
		"name": "F9 Armor",
		"source": "CDPH",
		"rarity": "common",
		"type": "ArmorH",
		"weight": 7.5,
		"value": 300,
		"ac": "5 + Dexterity Modifier (max 1)",
		"dr": 6,
		"entries": [""]
	},
	{
		"name": "F10P Armor",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "ArmorH",
		"weight": 9,
		"value": 445,
		"ac": "5",
		"dr": 6,
		"resist": [
			"piercing",
			"slashing"],
		"entries": ["<i>This armor gives you resistance to piercing & slashing damage.</i>"]
	},
	{
		"name": "F10B Armor",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "ArmorH",
		"weight": 9.5,
		"value": 445,
		"ac": "5",
		"dr": 6,
		"resist": [
			"bludgeoning"],
		"entries": ["<i>This armor gives you resistance to bludgeoning, explosion & fall damage.</i>"]
	},
	{
		"name": "Light Power Armor",
		"source": "CDPH",
		"rarity": "very rare",
		"type": "ArmorP",
		"weight": 14,
		"value": 760,
		"ac": "4",
		"dr": 9,
		"entries": ["<i>-1 on Dexterity Score while wearing this.<br>This armor weighs 14 kg when you carry it, but wearing it lowers the strain to about 10 kg of carry weight.</i>"]
	},
	{
		"name": "Heavy Power Armor",
		"source": "CDPH",
		"rarity": "very rare",
		"type": "ArmorP",
		"weight": 26,
		"value": 1200,
		"entries": ["<i>-2 on Dexterity Score while wearing this.<br>This armor weighs 26 kg when you carry it, but wearing it lowers the strain to about 8 kg of carry weight.<br>This armor gives you resistance to: piercing, slashing, bludgeoning, explosion & fall damage."]
	},
	{
		"name": "Oxwall Shield",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 0.5,
		"value": 45,
		"entries": ["<i>-1 on Constitution Modifier while using this.<br>This armor gives you resistance to: piercing, slashing, bludgeoning, explosion & fall damage."]
	},
	{
		"name": "Standard Shield (Kinetic)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1,
		"value": 45,
		"dr": "2 + 10%",
		"entries": ["<i>You gain this shields DR bonus against bludgeoning & explosion damage.</i>"]
	},
	{
		"name": "Standard Shield (Energy)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1,
		"value": 65,
		"dr": "2 + 10%",
		"entries": ["<i>You gain this shields DR bonus against laser, plasma, cold plasma, electric, cold, heat damage and fire damage.</i>"]
	},
	{
		"name": "Standard Shield (Energenetics)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1,
		"value": 75,
		"dr": "2 + 10%",
		"entries": ["<i>You gain this shields DR bonus against energenetic damage.</i>"]
	},
	{
		"name": "Heavy Shield (Kinetic)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1.2,
		"value": 90,
		"dr": "5 + 10%",
		"entries": ["<i>You gain this shields DR bonus against bludgeoning & explosion damage.</i>"]
	},
	{
		"name": "Heavy Shield (Energy)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1,
		"value": 110,
		"dr": "5 + 10%",
		"entries": ["<i>You gain this shields DR bonus against laser, plasma, cold plasma, electric, cold, heat damage and fire damage.</i>"]
	},
	{
		"name": "Heavy Shield (Energenetics)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1,
		"value": 120,
		"dr": "5 + 10%",
		"entries": ["<i>You gain this shields DR bonus against energenetic damage.</i>"]
	},
	{
		"name": "PSC Shield",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "Shield",
		"weight": 1,
		"value": 180,
		"dr": "25%",
		"entries": ["<i>You gain this shields DR bonus against laser, plasma, cold plasma, electric, cold, heat damage and fire damage.</i>"]
	},
	{
		"name": "OPSC Shield",
		"source": "CDPH",
		"rarity": "very rare",
		"type": "Shield",
		"weight": 1,
		"value": 500,
		"dr": "50%",
		"entries": ["<i>You gain this shields DR bonus against laser, plasma, cold plasma, electric, cold, heat damage and fire damage.</i>"]
	},
	{
		"name": "SP-CRAIKS Shield",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "Shield",
		"weight": 1,
		"value": 265,
		"dr": "10 + 25%",
		"entries": ["<i>You gain this shields DR bonus against explosion damage.</i>"]
	},
	{
		"name": "ECM V0.8 Shield",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "Shield",
		"weight": 1,
		"value": 60,
		"dr": "10%",
		"entries": ["<i>You gain this shields DR bonus against energenetic damage.</i>"]
	},
	{
		"name": "ECM V1.0 Shield",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1,
		"value": 120,
		"dr": "10 + 10%",
		"entries": ["<i>You gain this shields DR bonus against energenetic damage.</i>"]
	},
	{
		"name": "ECM V2.0 Shield",
		"source": "CDPH",
		"rarity": "common",
		"type": "Shield",
		"weight": 1,
		"value": 285,
		"dr": "15 + 25%",
		"entries": ["<i>You gain this shields DR bonus against energenetic damage.</i>"]
	},
	{
		"name": "High Explosive Grenade",
		"source": "CDPH",
		"rarity": "common",
		"type": "Expl",
		"weight": 1,
		"value": 80,
		"dmgType":"EX",
		"dmg1": "4d6",
		"range": 8,
		"property":["explosive"]
	},
	{
		"name": "Frag Grenade",
		"source": "CDPH",
		"rarity": "common",
		"type": "Expl",
		"weight": 1,
		"value": 80,
		"dmgType":["S","P"],
		"dmg1": "3d4+8",
		"range": 15,
		"property":["explosive"]
	},
	{
		"name": "Plasma Grenade",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "Expl",
		"weight": 1,
		"value": 120,
		"dmgType":"PL",
		"dmg1": "5d4+5",
		"range": 6,
		"property":["explosive"]
	},
	{
		"name": "Antimatter Grenade",
		"source": "CDPH",
		"rarity": "very rare",
		"type": "Expl",
		"weight": 1,
		"value": 260,
		"dmgType":"EX",
		"dmg1": "4d6+12",
		"range": 21,
		"property":["explosive"],
		"entries":["<i>1 turn cooking time</i>"]
	},
	{
		"name": "Flashbang",
		"source": "CDPH",
		"rarity": "very rare",
		"type": "Expl",
		"weight": 1,
		"value": 80,
		"range": 8,
		"property":["explosive"],
		"entries":["All affected creatures get -3 and Disadvantage on Dexterity Saving Throws and Attack Rolls, and have halved speed until the start of their next turn."]
	},
	{
		"name": "Smoke Grenade",
		"source": "CDPH",
		"rarity": "very rare",
		"type": "Expl",
		"weight": 1,
		"value": 80,
		"range": 5,
		"property":["explosive"],
		"entries":["<i>2 turns cooking time</i><br>Releases smoke, obscuring anything that is within or behind it. This smoke gives full cover without the DR bonus, meaning it gives +6 AC."]
	},
	{
		"name": "Small Caltrop",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 0.05,
		"value": 2,
		"entries":["A big inconspicuous spike that is quite horrible to step in.<br>You cannot use it as caltrops effectively when you have only one, as you need 20 caltrops to use them effectively."]
	},
	{
		"name": "Small Caltrops (bag of 20)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 1,
		"value": 40,
		"entries":["Big inconspicuous spikes that are quite horrible to step in.<br>A single set can cover an circular area of 1 meter radius.<br>When someone moves over the ground into or through this space with them knowing the caltrops are there, than they need to make a Dexterity Saving Throw. On a fail, they take {@damage 2d4+2} piercing damage and can’t be damaged again by this set of caltrops.<br>Someone who steps into an area of caltrops without knowing they were there fails the Dexterity Saving Throw automatically."]
	},
	{
		"name": "Rope (1m)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 0.6,
		"value": 2.5,
		"entries":["1 Meter of hemp or silk rope. Can hold weight up to 500 Kg. Has an AC of 6, and will break when it takes any damage that isn't bludgeoning, fall, knockout, electromagnetic or consitution based damage."]
	},
	{
		"name": "Rope (180m)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 108,
		"value": 450,
		"entries":["The maximum length of commercially sold hemp or silk rope. Can hold weight up to 500 Kg. Has an AC of 6, and will break when it takes any damage that isn't bludgeoning, fall, knockout, electromagnetic or consitution based damage."]
	},
	{
		"name": "Steel Cable (1m)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 0.8,
		"value": 2,
		"entries":["1 Meter of steel cable, which can also be used like rope, although it is difficult to use for grip when climbing. Can hold weight up to 1 tonne. Has an AC of 7, DR of 10, and will break when it takes any damage that isn't fire, fall, knockout, electromagnetic or consitution based damage. Using this to climb will give disadvantage on Strength and Dexterity Saving Throws for climbing it as it is quite slippery."]
	},
	{
		"name": "Steel Cable (80m)",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 64,
		"value": 160,
		"entries":["The maximum length of commercially sold steel cable, which can also be used like rope, although it is difficult to use for grip when climbing. Can hold weight up to 1 tonne. Has an AC of 7, DR of 10, and will break when it takes any damage that isn't fire, fall, knockout, electromagnetic or consitution based damage.  Using this to climb will give disadvantage on Strength and Dexterity Saving Throws for climbing it as it is quite slippery."]
	},
	{
		"name": "Carbon Cable (1m)",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "Gear",
		"weight": 0.15,
		"value": 3.5,
		"entries":["1 Meter of Carbonfibre cable, which can also be used like rope. Can hold weight up to 50 tonnes. Has an AC of 6, DR of 8, and will break when it takes any damage that isn't bludgeoning, fall, knockout, electromagnetic or consitution based damage."]
	},
	{
		"name": "Carbon Cable (360m)",
		"source": "CDPH",
		"rarity": "uncommon",
		"type": "Gear",
		"weight": 54,
		"value": 1260,
		"entries":["The maximum length of commercially sold Carbonfibre cable, which can also be used like rope. Can hold weight up to 50 tonnes. Has an AC of 6, DR of 8, and will break when it takes any damage that isn't bludgeoning, fall, knockout, electromagnetic or consitution based damage."]
	},
	{
		"name": "Mobile Compact Personal Computer",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 0.5,
		"value": 200,
		"entries":["A very small personal computer, small enough to take with you. Often used to communicate with others over long distances or to search the NoodleSoup for information.<br>Depending on the type and brand, they range from having a physical keyboard and mouse, to touchscreen, to 3D holographic projected screens whether monochromatic or in colour.<br>The given value and weight are also just estimations, as most of them are overpriced, and the costs heavily depend on the features the product has and the brand that made the product."]
	},
	{
		"name": "Bracetop",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 0.5,
		"value": 200,
		"entries":["A {@item Mobile Compact Personal Computer|CDPH} in a bracelet, usually word around the wrist."]
	},
	{
		"name": "Medkit",
		"source": "CDPH",
		"rarity": "common",
		"type": "Gear",
		"weight": 1,
		"value": 40,
		"entries":["XXXXXXXXXXXXXXXXXXXXXX"]
	},
	{
		"name": "Personal Medkit",
		"source": "CDPH",
		"rarity": "special",
		"type": "Gear",
		"entries":["XXXXXXXXXXXXXXXXXXXXXXXXXXXX"]
	}


],
	"itemGroup": [
		{
			"name": "Pressure Based Guns",
			"source": "CDPH",
			"type": "WeaponRU",
			"scfType": "pressureguns",
			"rarity": "none",
			"entries":["A gun that uses a pressure based fireing system, usually by exploading a small amount of explosive inside the used ammunition to propell said ammunition foreward. Most give a loud *Bang* when shot."],
			"items":[
				"Pistol|CDPH",
				"SMG|CDPH",
				"Assault Rifle|CDPH",
				"Shotgun|CDPH",
				"Hunting Rifle|CDPH",
				"Sniper Rifle|CDPH",
				"LMG|CDPH"
			]
		},
		{
			"name": "Laser Based Guns",
			"source": "CDPH",
			"type": "WeaponRU",
			"scfType": "laserguns",
			"rarity": "none",
			"entries":["A gun that uses high capacity powerbanks to fire a very strong laser for a brief moment. Usually giving a very quiet electrical current *Wirr* when shot."],
			"items":[
				"Laser Pistol|CDPH",
				"Laser SMG|CDPH",
				"Laser Assault Rifle|CDPH",
				"Laser Shotgun|CDPH",
				"Laser Hunting Rifle|CDPH",
				"Laser Sniper Rifle|CDPH",
				"Laser LMG|CDPH"
			]
		},
		{
			"name": "Coil Based Guns",
			"source": "CDPH",
			"type": "WeaponRU",
			"scfType": "coilguns",
			"rarity": "none",
			"entries":["A gun that uses magnetic or ferromagnetic based ammunition, and fires it by using strong electromagnetic coils. Usually giving a well noticable electrical current *Wirr* when shot."],
			"items":[
				"Coil Pistol|CDPH",
				"Coil SMG|CDPH",
				"Coil Assault Rifle|CDPH",
				"Coil Shotgun|CDPH",
				"Slugger|CDPH",
				"Coil Hunting Rifle|CDPH",
				"Coil Sniper Rifle|CDPH",
				"Coil LMG|CDPH"
			]
		},
		{
			"name": "Plasma Based Guns",
			"source": "CDPH",
			"type": "WeaponRU",
			"scfType": "plasmaguns",
			"rarity": "none",
			"entries": ["A gun that uses special high pressure gascans and high capacity powerbanks as ammunition, being able to fire white-blue-ish plasma at a high velocity.  Usually giving a well noticable electrical current *Wirr* and *Zoowm* when shot."],
			"items":[
				"Plasma Pistol|CDPH",
				"Plasma SMG|CDPH",
				"Plasma Assault Rifle|CDPH",
				"Plasma Shotgun|CDPH",
				"Plasma Hunting Rifle|CDPH",
				"Plasma Sniper Rifle|CDPH",
				"Plasma LMG|CDPH"
			]
		},
		{
			"name": "General Melee",
			"source": "CDPH",
			"type": "WeaponM",
			"scfType": "meleeweapon",
			"rarity": "none",
			"items":[
				"Knife|CDPH",
				"Dagger|CDPH",
				"Sword|CDPH",
				"Zweihander|CDPH",
				"Axe|CDPH",
				"Waraxe|CDPH",
				"Mace|CDPH",
				"Warhammer|CDPH"
			]
		},
		{
			"name": "Shields",
			"source": "CDPH",
			"type": "WeaponM",
			"scfType": "shields",
			"rarity": "none",
			"entries":["Shields are small objects, usually around 5 to 30 cm in diameter, that are used for protective purposes. They can usually be attached to a piece of clothing, and can be turned on or off as a bonus action."],
			"items":[
				"Oxwall|CDPH",
				"Standard Shield (Kinetic)|CDPH",
				"Standard Shield (Energy)|CDPH",
				"Standard Shield (Energenetic)|CDPH",
				"Heavy Shield (Kinetic)|CDPH",
				"Heavy Shield (Energy)|CDPH",
				"Heavy Shield (Energenetic)|CDPH",
				"PSC Shield|CDPH",
				"SP-CRAIKS Shield|CDPH",
				"ECM V0.8 Shield|CDPH",
				"ECM V1.0 Shield|CDPH"
			]
		}
	]
}
