{
	"baseitem": [],
	"itemProperty": [
		{
			"abbreviation": "vers",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Versatile",
					"entries": [
						"This can be used with one or two hands. A damage value in parentheses appears with the property—the damage when the weapon is used with two hands to make a melee attack."
					]
				}
			],
			"template": "{{prop_name}} ({{item.dmg2}})"
		},
		{
			"abbreviation": "iron",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Iron-Based Armor",
					"entries": [
						"<br>This armor is made out of a high percentage iron. Because of this, this armor gains high amounts of DR against any form of {@color energenetic damage|dd00dd}, and changes all taken {@damage energenetic damage} to {@damage heat} damage."
					]
				}
			],
			"template": "<br>{{prop_name}} ({{item.edr}}DR vs energenetic damage)"
		},
		{
			"abbreviation": "ammofire",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Ammunition Firing",
					"entries": [
						"<br>This weapon fires ammunition as part of using or attacking with it. Reloading this weapon requires both hands to be free, or to be used to hold said weapon. If you use this weapon to make a melee attack, you treat the weapon as an improvised weapon.<br>The ammunition that this weapon uses is destroyed upon use."
					]
				}
			],
			"template":"{{item.ammocap}} shots/clip<br>Range: {{item.range}} m"
		},
		{
			"abbreviation": "boltaction",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Bolt-Action",
					"entries": [
						"<br>This weapon uses a bold-action fireing mechanism. This means that to reload a new projectile into the chamber, you need to do kind of manually do this.<br>After shooting this weapon, you need to spend an Action to reload a bullet into the chamber<br>"
					]
				}
			]
		},
		{
			"abbreviation": "twohand",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Two-Handed",
					"entries": [
						"<br>This weapon is so hefty and unhandy that you need both hands to use it correctly.<br>If you use this weapon without using two hands, and your Strength Score is more than 12, you gain a -5 to Hit Bonus and disadvantage on the attack roll.<br>If your Strength Score is 12 or less, than you automatically fail all attack rolls with it.<br>"
					]
				}
			]
		},
		{
			"abbreviation": "craftable",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Craftable Only",
					"entries": [
						"<br>This item cannot be aquired by shops or by other normal means.<br>This item can only be crafted and maintained by an Engineer with the required ability, or could be gotten (possibly without the maintenance requirements) by other special means.<br>"
					]
				}
			]			

		},
		{
			"abbreviation": "foldable",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Foldable Weapon",
					"entries": [
						"<br>Weapons with the Foldable trait can be disassembled into parts to make it easier to travel with. It costs two Actions and two Bonus Actions to assemble or disassemble.<br>"
					]
				}
			]			

		},
		{
			"abbreviation": "burstfire",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Burst Fire",
					"entries": [
						"<br>This weapon can shoot in an area originating from you with the Maximum Effective Range as length. If you use this area attack, then you need to make an attack roll. Anyone’s AC in that area that is lower than that attack roll gets hit. You roll a separate damage roll for everyone who was hit, moving clockwise.<br>You cannot add any Dexterity Based Bonusses to the attack or damage rolls when you attack this way.<br>Shooting this way is an option as you can shoot semi-automatically and just fire on a single target, but this is not the case if it is specified with “<b>only</b>” in the header, as this means that you can only use the area attack. <br>The area and cost (noted by “Burst Fire (<i> cost </i>) : <i>area</i> ” ) of this burst fire are also noted in the header."
					]
				}			
			],
			"template": "Burst Fire ({{item.burstcost}}): {{item.bursttype}}"			

		},
		{
			"abbreviation": "heavy",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Heavy",
					"entries": [
						"<br>Weapons with the Heavy trait are more difficult to handle than most other weapons, and are as noted, very heavy.<br>You can only attack once per turn with this weapon, no matter the amount of Actions, Bonus Actions or Reactions you may have."
					]
				}			
			]
		},
		{
			"abbreviation": "unconventional",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Unconventional",
					"entries": [
						"<br>This is an unconventional weapon. Weapons with this trait are, like what it says on the tin, unconventional. They are rarely used, and a lot of modifications and attachments are not made for these kind of weapons."
					]
				}			
			]
		},
		{
			"abbreviation": "special",
			"source": "CDPH",
			"entries": [
				{
					"type": "entries",
					"name": "Special",
					"entries": [
						"<br>This is item is special and unique or weird in one way or another. Weapons with this trait cannot be modified.<br>"
					]
				}			
			]
		}
	],
	"itemType": [],
	"itemEntry": [
		{
			"name": "Ring of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"You have resistance to {{item.resist}} damage while wearing this ring. The ring is set with {{item.detail1}}."
			]
		},
		{
			"name": "Armor of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"You have resistance to {{item.resist}} damage while you wear this armor."
			]
		},
		{
			"name": "Potion of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"When you drink this potion, you gain resistance to {{item.resist}} damage for 1 hour."
			]
		}
	],
	"itemTypeAdditionalEntries": [
		{
			"appliesTo": "INS",
			"entries": [
				"Proficiency with a musical instrument indicates you are familiar with the techniques used to play it. You also have knowledge of some songs commonly performed with that instrument.",
				{
					"type": "entries",
					"name": "History",
					"entries": [
						"Your expertise aids you in recalling lore related to your instrument."
					]
				},
				{
					"type": "entries",
					"name": "Performance",
					"entries": [
						"Your ability to put on a good show is improved when you incorporate an instrument into your act."
					]
				},
				{
					"type": "entries",
					"name": "Compose a Tune",
					"entries": [
						"As part of a long rest, you can compose a new tune and lyrics for your instrument. You might use this ability to impress a noble or spread scandalous rumors with a catchy tune."
					]
				},
				{
					"type": "table",
					"caption": "Musical Instrument",
					"colLabels": [
						"Activity",
						"DC"
					],
					"colStyles": [
						"col-10",
						"col-2 text-center"
					],
					"rows": [
						[
							"Identify a tune",
							"10"
						],
						[
							"Improvise a tune",
							"20"
						]
					]
				}
			]
		},
		{
			"appliesTo": "GS",
			"entries": [
				"Proficiency with a gaming set applies to one type of game, such as Three-Dragon Ante or games of chance that use dice.",
				{
					"type": "entries",
					"name": "Components",
					"entries": [
						"A gaming set has all the pieces needed to play a specific game or type of game, such as a complete deck of cards or a board and tokens."
					]
				},
				{
					"type": "entries",
					"name": "History",
					"entries": [
						"Your mastery of a game includes knowledge of its history, as well as of important events it was connected to or prominent historical figures involved with it."
					]
				},
				{
					"type": "entries",
					"name": "Insight",
					"entries": [
						"Playing games with someone is a good way to gain understanding of their personality, granting you a better ability to discern their lies from their truths and read their mood."
					]
				},
				{
					"type": "entries",
					"name": "Sleight of Hand",
					"entries": [
						"Sleight of Hand is a useful skill for cheating at a game, as it allows you to swap pieces, palm cards, or alter a die roll. Alternatively, engrossing a target in a game by manipulating the components with dexterous movements is a great distraction for a pickpocketing attempt."
					]
				},
				{
					"type": "table",
					"caption": "Gaming Set",
					"colLabels": [
						"Activity",
						"DC"
					],
					"colStyles": [
						"col-10",
						"col-2 text-center"
					],
					"rows": [
						[
							"Catch a player cheating",
							"15"
						],
						[
							"Gain insight into an opponent's personality",
							"15"
						]
					]
				}
			]
		}
	]
}
