{
	"makebrewCreatureTrait": [
		{"name": "Quantum Locking","entries":["<br>The <$name$> uses a quantum locking defense mechanism, changing itself into an inanimate object the moment they are observed by a sentient observer."]},
		{"name": "Rage","entries":["In battle, you fight with primal ferocity. On your turn, you can enter a rage as a Bonus Action. While raging, you gain the following benefits if you aren’t wearing Heavy Armor or Power Armor:","• You have advantage on Strength checks and Strength saves.","• When you make a melee attack, you gain +4 on your damage roll.","• You have resistance to bludgeoning, piercing, and slashing damage.","Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then.<br>You can only do this once every two hours, and every time you do it more you get one exhaustion."]},
		{"name": "Unarmored Brute Defense","entries":["While you are not wearing any armor, your Armor Class equals <br>9 + Dexterity Modifier + Constitution Modifier"]},
		{"name": "Reckless Attack","entries":["You can throw aside all concern for defence to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee attacks during this turn, but attack rolls against you have advantage until your next turn."]},
		{"name": "Danger Sense","entries":["You gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity Saves against effects that you can see, such as traps or explosives. To gain this benefit, you can’t be blinded, deafened, or incapacitated."]},
		{"name": "Feral Instinct","entries":["Your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."]},
		{"name": "Relentless Rage",			"entries":["Your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."]},
		{"name": "Frenzy","entries":["You can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack or unarmed strike as a Bonus Action on each of your turns after this one.<br>While in this rage/frenzy, you also gain 1 additional damage die on any damage roll you make. When your rage ends, you suffer one level of exhaustion."]},
		{"name": "Mindless Rage","entries":["You can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage"]},
		{"name": "Persistent Rage",			"entries":["Your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it. The duration of the rage is also increased to 5 minutes."]},
		{"name": "Indomitable Might",			"entries":["If your total for a Strength check is less than your Strength Ability Score, you can use that score in place of the total of the check."]},
		{"name": "Determination of the Gods","entries":["You can withstand wounds that would kill any normal person. You gain +1 HP every level (this does work retroactively)."]},
		{"name": "Hard to Hit","entries":["Your body has become a bit tougher to go through.<br>You gain 1 + 10% DR."]},
		{"name": "Raging Hard",			"entries":["You are able to brush off attacks a lot easier while in your rage. You gain 2 DR while you are in your rage."]},
		{"name": "Who Needs Arms with Legs Like These","entries":["You gain +1 meter movement when you are wearing light armor or no armor."]},
		{"name": "Buff","entries":["You are buff as hell. Your Strength and Constitution scores both increase by 4, and the maximum for those scores is now 10 higher."]},
		{"name": "Rapid Regeneration","entries":["Your stamina and grit has increased quite a lot, and while you knew good enough how to deal with wounds you got, now your body has learned that as well.<br>You regain 1 HP every turn while in a fight, or 4 HP every hour while not in a fight."]},
		{"name": "Barbarian Mastery","entries":["<i>Mastery</i><br><br>You gain 5 Max HP."]},
		{"name": "Musical Genius","entries":["<i>Free</i><br><br>You are able to learn the skills to play some special songs. These songs have effects ranging from warming up an area to having the ability to dodge through a sea of bullets. You can find the list of learnable songs in the Learnable Songs List.<br><br>You can get a new song every time you gain a level in {@class Bard|CDPH}, and you can choose to learn a new song instead of getting an ability from the {@class Bard|CDPH} class when you increase your {@class Bard|CDPH} level.<br><br>You need to use your Action to start playing or to maintain a song. If you somehow have more than one Action in a turn, than you can use one Action to start playing a song, but need to use all Actions for maintaining a song. You can stop playing a song as a Free Action.<br><br>While playing a song costs concentration, it normally isn’t hard to keep it. When it is hard to play a song correctly (because of other very loud sounds for instance or if you take some damage), than you are asked to make a {@skill Pain Tolerance} roll against a DC set by the DM."]},
		{"name": "Through the Fire and the Pain","entries":["You have learned how to keep your composure while fighting. You do not need to make {@skill Pain Tolerance} rolls maintain your song if you are damaged anymore. "]},
		{"name": "Heir of Sound",			"entries":["You have honed your skills enough to improve on songs a bit, playing them more accurately and improving their effects. Every time you can learn a new song, you can now increase your level of a song you know to level 2 instead of getting a new song"]},
		{"name": "Prodigy of Music",			"entries":["You are slowly honing in the perfect melody and rhythm of the songs you know. Every time you can learn a new song, you can now increase your level of a song that you have level 2 skill in to level 3 instead of getting a new song."]},
		{"name": "The Perfect Play",			"entries":["You have perfected your skills to (near) full potential. You can choose 3 songs which you know and have level 3 skills in to increase in potential to level 4. You can also do this later if you do not have 3 songs with level 3 skill yet."]},
		{"name": "8/4<sup>th</sup> Speed",			"entries":["You have perfected your skills to (near) full potential. You can choose 3 songs which you know and have level 3 skills in to increase in potential to level 4. You can also do this later if you do not have 3 songs with level 3 skill yet."]},
		{"name": "Jack of All Traits",			"entries":["You can add half your Proficiency Bonus, rounded down, to any ability check you make where you don’t have Proficiency or Expertise in."]},
		{"name": "Six-Minus Mentality",			"entries":["You can learn to be just good enough in something to be proficient in it, although you can’t learn that many different things at the same time and you will forget things if you try to learn too much. This ability only works if you have access to any form of big reaching networks like the Internet.<br><br>You can choose two skills to be proficient in. You can use a Rest to change these proficiencies to other skills"]},
		{"name": "Honin' Those Skills",			"entries":["You gain expertise in two skills of your choice."]},
		{"name": "The Bardbarians","entries":["You have learned how to use your instrument in combat as a more effective weapon. Using your instrument to attack now counts as a melee weapon with {@dice 2D4} bludgeoning or slashing damage (depending on the weapon) that you are proficient in, instead of it being an improvised weapon."]},
		{"name": "False Notes","entries":["You have learned how to do damage with your instrument without hitting people with it. You are able to create such false music, that it damages the psyche and internal structure of others.<br><br>You can deal {@dice 2D6} energenetic (psychic) damage in an area of 8 meters around you, every creature in this area (except for yourself) needs to make a Constitution Save with a DC of 10 + Charisma Modifier + Proficiency, and take half damage on a success, or full damage on a failed one.<br><br>This attack doesn’t work and doesn’t deal damage on creatures that can’t hear the music you play, or have full immunity to mental intrusions and mental manipulation. This attack also pierces all DR"]},
		{"name": "Graceful Distraction","entries":["You are able to shift people’s attention to you. You can now help someone in their deception roll, giving them advantage on the roll while you are standing within 10 meters of the person who is making the {@skill deception} check."]},
		{"name": "Bard Mastery",			"entries":["<i>Mastery</i><br><br>You can increase a song to level 4"]},
		{"name": "Doctor Specialization","entries":["<i>Free</i><br><br>You are specialized in healing. This would be easy if everyone was the same. But alas, nothing less is true, and because of this, you need to specialize to know what you are doing.<br><br>You can choose to specialize in two of the following types of creature: <br>- Organic<br>- Non-Organic<br>- Semi-Materialistic<br>- Half-Materialistic<br>- Fully-Energenetic<br>Any healing you do on a creature type you are specialized in is doubled.<br><br>You also specialize in dealing with two specific races. Not specifically for healing, but for dealing with them in a conversations and the like. You can choose two races, you get +3 on any {@skill deception} and {@skill persuasion} roll against them"]},
		{"name": "Pharmaceutical Compounds",			"entries":["<i>Free</i><br><br>You can make Drugs. While you cannot do anything with this ability yet, some abilities in this class lets you craft specific Drugs that affect people in different ways which can be seen in the list of Items. Drugs have no effect on Half-Materialistic, Fully-Energenetic or Mechanical creatures unless noted otherwise. Drugs that you make are usually carried in Injectors.<br><br>You can make Drugs in a Rest if you have access to any form of civilization. You start with the ability to maximally make 2 Drugs in a rest, but this can increase this with different abilities from this class. If you can make multiple different Drugs, then you can choose how many you make of each as long as the sum of all the Drugs that you make does not exceed the maximum amount of Drugs that you can make in a rest. All of your self-created Drugs expire after 48 hours, or when you start a Rest.<br><br>Using a Drug in an Injector on someone normally cost an Action, and can be done without needing to throw an Attack Roll if the person isn’t actively trying to dodge you. If you do need to make an Attack Roll, than this can be counted as a melee attack that you are not proficient in and does 0 damage."]},
		{"name": "Permanent Student",			"entries":["You take one more type of creature to specialize healing in.<br>You also choose one more race to specialize in dealing with it.<br>You also can create 1 more Drug in a rest.<br><br><i>This ability can be taken multiple times.</i>"]},
		{"name": "Medical Uppercut","entries":["You take one more type of creature to specialize healing in.<br>You also choose one more race to specialize in dealing with it.<br>You also can create 1 more Drug in a rest.<br><br><i>This ability can be taken multiple times.</i>"]},
		{"name": "Support Class","entries":["You gain 2 Personal Medkits with which you can heal others. You refill these Medkits when you Rest. You cannot refill your Personal Medkits if you don’t have access to any form of civilization.<br>The total health you can heal with a Medkit is also doubled.<br>Normally, a Medkid heals for {@dice 1D8} HP, and can be used until it has healed 10 HP. So you can now use a Medkit or Personal Medkit until 20 HP is healed with it."]},
		{"name": "Fully Packed",			"entries":["You find a way to pack your Personal Medkits more efficiently, decreasing the size they take up and being able to carry more with you. You gain 2 more Personal Medkits."]},
		{"name": "Bottom Lane",			"entries":["You can now heal for {@dice 1D10+2}+{@skill Medicine} skill with a Medkit and Personal Medkit.<br><br>You also gain another Personal Medkit."]},
		{"name": "Professional Defibrillator","entries":["You can stabilise others as a Bonus Action when you are within melee range of them. You also don’t need to throw medicine checks for stabilizing others, as it is guaranteed that you stabilize them as long as this is possible"]},
		{"name": "Kaysterimeno Thanatos",			"entries":["You can stabilise others as a Bonus Action when you are within melee range of them. You also don’t need to throw medicine checks for stabilizing others, as it is guaranteed that you stabilize them as long as this is possible"]},
		{"name": "Quickfix",			"entries":["You can use your Bonus Action to heal someone with a Personal Medkit, assuming you saw their wounds before you started your turn. It is not possible heal someone with a Personal Medkit twice on the same turn."]},
		{"name": "That’s How I Lost My Medical License","entries":["You can now “fix” more serious injuries that arise.<br>You can now effectively heal or fix wounds that wouldn’t just go away with a normal Rest, like broken bones or radiation sickness. While you know what you are doing, this isn’t a replacement for actual medical intervention in a hospital of course, but the effects can be suppressed enough that they nearly or don’t affect the person at all anymore until a better fix is found. You can only do this in a rest, and “fixing” something like this does cost you the use of 1 Personal Medkit until the next Rest. This care does need to be maintained every Rest until the injury or sickness is actually fixed, instead of supressed."]},
		{"name": "A Moment of Rest","entries":["With consent of others, you are able to make a Rest take longer to buff your teammates. If your Rest gets disturbed, than the buffs won’t go in effect. The extra time per rest for you and any person you buff is around 20 minutes per person, including yourself. You buff your teammates during this extra time. Teammates that gain your buff have the ability to roll 1 dice with advantage. The rolls where this buff can be used on are: normal saving throws, death saving throws, attack rolls, damage rolls & skill checks."]},
		{"name": "Alternative Medicine","entries":["You can find useful and healing items in nature. If someone is poisoned by a wild plant or animal in a wild ecosystem, than you will be able to find a plant or small animal with the anti-poison or anti-venom. You need to succeed a {@skill Survival} check with a DC that is made by the DM (normal difficulty baseline is around 12) to do this.<br><br>You are also able to refill your Personal Medkits with Improvised Medkits if you cannot refill your Medkits because you are in the wild. This requires {@dice 3D6} hours of searching in a not barren, wild area. This time does not count as a Rest for you.<br><br>This Improvised Medkit normally heals for {@dice 1D4} per action, which increases to {@dice 1D6+2}+{@skill Medicine} when you have {@feat Bottom Lane|CDPH}. The total HP that you can heal with an Improvised Medkit is 7 HP, or 15 HP if you have {@feat Support Class|CDPH}."]},
		{"name": "Biotic Synthesiser",			"entries":["You can create a specific antiserum or antivirus if you know what bacteria or virus you are making out for. You can only do this in a Rest and it costs you the use of a Personal Medkit until the next Rest. You also need to have access to scientific equipment and chemicals."]},
		{"name": "Arrow in the Kneecap","entries":["You can use your action to make a special attack with a melee or ranged weapon that doesn’t have the “special” trait. This attack does half the damage but it gives a movement penalty equal to half your Proficiency modifier, and it gives disadvantage on the next melee attack that the target makes. "]},
		{"name": "Back Palm","entries":["You can hit a friendly creature that is affected by an anomalous mental effect or intrusion, or a friendly creature who is unconscious. You do not need to make an attack roll for this if the creature you are trying to hit is not actively dodging you.<br>This hit doesn’t do any damage and won’t give a failed death save on unstabilized creatures. When you hit someone with this ability, all mental effects and intrusions will subside for the next 5 minutes after which they slowly come back if the creature would still be affected. If you use this ability on a unconscious creature, than it becomes awake, and if it is at 0 HP (whether it be stabilized or be throwing death saves), than it is now consciousness again and able to talk and crawl."]},
		{"name": "A Moment of Reprise",			"entries":["The extra time for buffing with {@feat A Moment of Rest|CDPH} can be increased to around 35 minutes per person. This increases the buff to having the ability to roll 2 dices with advantage."]},
		{"name": "The Calm Before the Storm",			"entries":["The extra time for buffing with {@feat A Moment of Rest|CDPH} or {@feat A Moment of Reprise|CDPH} can be increased to around an hour per person. This increases the buff to having the ability to roll 2 dices with advantage, and are able to auto-critical one dice roll that isn’t a death save."]},
		{"name": "Pharmaceutical Mastery",			"entries":["<i>Mastery</i><br><br>You can create 1 more Drug in a rest."]},
		{"name": "Medical Mastery",			"entries":["<i>Mastery</i><br><br>In total, you can heal 2 more HP with Personal Medkits. You also gain 1 more Personal Medkit."]},
		{"name": "Adrenaline Shot (Drug)",			"entries":["You can make {@item Adrenaline Shot|CDPH|adrenaline shots}. You also can create 1 more Drug in a rest."]},
		{"name": "Medical Hypo (Drug)",			"entries":["You can make {@item Medical Hypo|CDPH|medical hypos} which can heal people. You also can create 1 more Drug in a rest. You also can create 1 more Drug in a rest."]},
		{"name": "Sedative Injection (Drug)",			"entries":["You can make {@item Sedative Injection|CDPH|sedative shots}."]},
		{"name": "Liquid Royal Jelly (Drug)",			"entries":["You can make {@item Royal Jelly|CDPH|artificial royal jelly}. You also can create 1 more Drug in a rest."]},
		{"name": "Truth Serum (Drug)",			"entries":["You can make {@item Truth Serum|CDPH|}. You also can create 1 more Drug in a rest."]},
		{"name": "Toxic Acupuncture (Drug)",			"entries":["You can make {@item Toxic Serum|CDPH|toxic injections}. You also can create 1 more Drug in a rest."]},
		{"name": "Concoction of a Nobel Dream (Drug)",			"entries":["You can make {@item Concoction of a Nobel Dream|CDPH|an injection that revives people.}."]},
		{"name": "Ergogenic Stimulants (Drug)",			"entries":["You can make {@item Ergogenic Stimulants|CDPH}. You also can create 1 more Drug in a rest."]},
		{"name": "Joyless Joy (Drug)",			"entries":["You can make {@item Joy|CDPH}. You also can create 1 more Drug in a rest."]},
		{"name": "Drug Cocktail (Drug)",			"entries":["You can make a {@item Drug Cocktail|CDPH}. You also can create 1 more Drug in a rest."]},
		{"name": "Benign Chronos (Drug)",			"entries":["You can make a Drug called {@item Benign Chronos|CDPH}. You can only make two of these in a Rest as the materials that you need to make it are insanely hard to come by."]},
		{"name": "Energenetic Kickstart","entries":["<i>Free</i><br><br>You gain a stat called Energy. Your Maximum Energy is <i>10+Energenetic Specialist Level</i>. You use this Energy for the abilities of this class. You regain 2 Energy per turn. You can still use your Energy when you are out. If you do so, you regain an amount of Energy equal to half your Total Level and half your Energenetic Specialist Level, and you also get one point of Exhaustion.<br>The maximum range for your abilities are normally your Max Energy in meters, unless otherwise noted. The color of the Energy can be seen in the chapter Energenetic Flowchart."]},
		{"name": "Non-Localized Manipulation [Initiate]","entries":["You have learned how to move things with your Energy. You can lift up and move objects and creatures that are up to your Energetic Specialist Level in Kg easily without the use of Energy. Doing this costs an Action.<br><br>The maximum force that you can put on things is than 10 times your Energetic Specialist Level in Newton by extrapolation. You can also use your Energy to increase this maximum by 3 Kg for every point of Energy you use. If you try to move an unwilling creature with this ability, than they need to make a Strength save against a DC of <i>5+Intelligence modifier+Wisdom</i> modifier."]},
		{"name": "Non-Localized Manipulation [Adept]",			"entries":["The maximum weight that you can lift with {@feat Non-Localized Manipulation [Initiate]|CDPH} is now 3 times your Energenetic Specialist Level in Kg, and you can now increase this by 6 Kg for every point of Energy you use."]},
		{"name": "Non-Localized Manipulation [Master]",			"entries":["The maximum weight that you can lift with {@feat Non-Localized Manipulation [Initiate]|CDPH} is now 5 times your Energenetic Specialist Level in Kg, and you can now increase this by 8 Kg for every point of Energy you use."]},
		{"name": "Holographic Energenetic Projections","entries":["You can make holographic like projections. You cannot deal damage with these. The maximum size for these projections is around 27dm<sup>3</sup>(or liter) in an area of 1m<sup>3</sup>. Making such Holographic Projection and maintaining it cost an Action and 2 Energy."]},
		{"name": "Energenetic Materializing",			"entries":["From now on, if you use your {@feat Energenetic Materializing|CDPH} to create or maintain an object, than you can do so anywhere you can see within a 20 meter radius without the need to be in contact with it.<br><br>Although it cost 3 Energy to create the object without touching it, it doesn’t cost Energy anymore to maintain the object"]},
		{"name": "Projected Energenetic Materializing",			"entries":["From now on, if you use your {@feat  Energenetic Materializing|CDPH} to create or maintain an object, than you can do so anywhere you can see within a 20 meter radius without the need to be in contact with it. And although it cost 3 Energy to create the object without touching it, it doesn’t cost Energy anymore to maintain the object."]},
		{"name": "Unstabilized Planck Distribution","entries":["You can make a continuous beam of energenetic energy to deal damage. This is a form of attack and does cost and Action to do so. This Attack always physically damages things, and because of that, it cannot deal knockout damage or be used in a softer of pushy sort of way, or at least not against full-materialistic creatures.<br>This attack does {@dice 1d6} damage per 2 Energy that you use on it, to a maximum use of your Energenetic Specialist Level of {@dice d6}’s damage. You are also able to hit multiple objects or creatures with this attack if not all of the damage of the attack has been done to the last targets. The maximum targets is your Proficiency-1.<br>If you use less than twice your Proficiency Bonus of Energy on this attack, than it is unable to miss under normal conditions. If you use more Energy on this attack, then you do need to make an attack roll to hit a target. You are proficient in the attack roll, gain your Intelligence Modifier and Wisdom Modifier more to hit, and gain half the amount of Energy you use less to hit. You are unable to have a normal Critical (a natural 20) on this attack.<br>In short, the attack roll when the hit isn't guaranteed is {@dice 1d20} + Proficiency Bonus + Wisdom Modifier + Intelligence Modifier – (½ x Energy used for the attack)."]},
		{"name": "High Energy Density Projectile","entries":["You can throw a ball of Energy to a target. This is a form of Attack and does cost an Action to do so.<br>This attack does {@dice 1d4} damage for every point of Energy you use on this ability, to a maximum of your Energenetic Specialist Level of D4's damage. You need to make an Attack roll for this Attack.<br>You are proficient in this Attack roll, can add your <i>Dexterity Modifier</i> and add the lower of your <i>Wisdom Modifier</i> or <i>Intelligence Modifier</i> to the Attack roll.<br><br>When you target something that is farther than your normal range (your max Energy in meters) than you gain disadvantage on the roll that cannot be negated."]},
		{"name": "Trans-Localized Manipulation","entries":["You have roughly learned how to use your Energy to teleport. You can only teleport to places with a low density of matter, so only to air/vacuum or other such areas, and this does cost an Action. <br>The Energy cost for teleporting is 2 + ¼ the distance in meter of Energy. You do not need to know or see where you end up, although it is strongly advised as ending up in a wall or object isn’t too good for your health. You cannot teleport into another creature. However, you can take other creatures with you, these cost an extra half the distance in meter of Energy you need to use."]},
		{"name": "Potential Recon","entries":["You can try and specialize into the use of Energy that is made out of your Main Energy. You can now pick an Ability (or the Ability) from the Energy Type that is made from your Main Energy.<br>","<br>",{"type": "table","caption": "Energenetic ","colLabels": ["Main Energy","Ability"],"colStyles": ["col-2 text-center","col-10"],"rows": [["Dark","Any Ability that requires <i>Main Energy: Space</i> as it's requirement, and which doesn't have any other requirements."],["Light","Any Ability that requires <i>Main Energy: Time</i> as it's requirement, and which doesn't have any other requirements."],["Time","Any Ability that requires <i>Main Energy: Chaos</i> as it's requirement, and which doesn't have any other requirements."],["Space",{	"name": "Full Matter Creation","entries":["When you use Projected Energenetic Materializing, you can now choose to use 5 Energy instead of 3 to make something out of actual normal matter. Doing this lowers the area in which you can make things to a maximum of 1 kg in an volume of 10 by 10 by 10 cm (or 1 liter), and only lets you create non-complicated things like simple liquids, and things made from metals or plastics in not too complicated shapes (so no machines or electronics and the like).<br>Doing this also disables your ability to make your creation disappear again, as it is fully independent from you the moment it is created, as it is normal matter that is in no way connected to you anymore."]}],["Chaos",{	"name": "Quantized Skill","entries":["<br>You can now let faith be on your side.<br>The closer to perfection you are, the easier it is to make your actions be perfect with the use of Energy. If you roll a Skill Check, Saving Throw or Attack Roll that is above an unnatural 20, then you can spend Energy to change it into a crit.<br>The amount of Energy this costs is <i>36 – Your Unnatural Roll</i>, meaning that it costs 15 Energy to do when you roll an unnatural 21, and 0 energy when you roll an unnatural 36 or above."]}],["Magic","Any Ability that requires <i>Main Energy: Psychic</i> as it's requirement, and which doesn't have any other requirements."],["Psychic",{	"name": "Psychic Overkill","entries":["The maximum range of Abilities from the Energenetic Specialist class are now tripled for you, meaning that the range of any of these abilities is now three times your Max Energy.<br>Also, the range for the {@feat Telepathy|CDPH} is now multiplied by 20, instead of tripled."]}]]}]},
		{"name": "Potential Prowess","entries":["You can try and specialize into the use of Energy your Main Energy is made out of. You can now pick an Ability (or the Ability) from the Energy Type that your Main Energy is made out of.","<br>",{"type": "table","caption": "Energenetic ","colLabels": ["Main Energy","Ability"],"colStyles": ["col-2 text-center","col-10"],"rows": [["Dark",{	"name": "Universal Energy Usage","entries":["You have learned how to filter Primal Energies to use as your Main Energy.<br>You gain an extra 20 Maximum Energy."]}],["Light",{	"name": "Universal Energy Usage","entries":["You have learned how to filter Primal Energies to use as your Main Energy.<br>You gain an extra 20 Maximum Energy."]}						],["Time","Any Ability that requires <i>Main Energy: Light</i> as it's requirement, and which doesn't have any other requirements."],["Space","Any Ability that requires <i>Main Energy: Dark</i> as it's requirement, and which doesn't have any other requirements."],["Chaos","Any Ability that requires <i>Main Energy: Time</i> as it's requirement, and which doesn't have any other requirements."],["Magic",{	"name": "Improved Normal Energy Injection","entries":["The things you can now do with {@feat Normal Energy Injection|CDPH} are now stronger and better, and they can now also be done as a Bonus Action.<br>As a comparison to the new possible strength, the current things which you would be able to do with this Ability (and are not heavily limited by) become:","• Creating strong winds (7 Beaufort).","• Creating or dowsing an area of around 0.5 by 0.5 meter.","• Making things trice as heavy or light.","• Instantly boiling or solidifying a body of water not bigger than 5 liters.","• Freezing or slowly boiling the surface of a body of water not bigger than 1 m<sup>2</sup> at a time.","• Creating a sound up to 150 Db.","<br>You can scale down all these effects, and other effects are possible if the DM agrees with the effect."]}						],["Psychic","Any Ability that requires {@feat Energenetic Substitution|CDPH} as it's requirement, and which doesn't have any other requirements."]]}]},
		{"name": "Backup Energy Reserves",			"entries":["<i>Mastery</i><br><br>You have learned how to use more of your energy without exhausting yourself. This does, however, come with a cost as you still put more strain on yourself than you are comfortable with. You lose 5 Max HP when you get this ability, but you gain 12 Max Energy as a result."]},
		{"name": "Energenetics Control Mastery",			"entries":["<i>Mastery</i><br><br>You have learned how to use more of your energy without exhausting yourself. This does, however, come with a cost as you still put more strain on yourself than you are comfortable with. You lose 5 Max HP when you get this ability, but you gain 12 Max Energy as a result."]},
		{"name": "Potential Power",			"entries":["There generally is no limit anymore for how much you can use your Energy at once. This does include specific abilities that do give a limit. If an ability gives a limit that isn’t a limit of how much Energy you can use, then you can scale the limited amounts with the Energy cost of the ability. The only exception where you still need to abide to the maximum is with the ability High Energy Density Projectile (Energenetic Specialist).<br>Also, the attack roll for {@feat Unstabilized Planck Distribution|CDPH} (Energenetic Specialist) now becomes {@dice 1d20} + Poficiency Bonus + Wisdom Modifier + Intelligence Modifier – (<b>¼</b> Energy used for the attack)"]},
		{"name": "Brute Force",			"entries":["You can help yourself and others with your Energy. You can give yourself (or someone else that you can see) {@dice 1d4} to a skill check for every 7 Energy you use on this ability. Or you can give an {@dice 1d4} bonus to an attack roll or saving throw for every 3 Energy used on this ability. The ability to use this given bonus ends after 15 seconds or 5 turns."]},
		{"name": "Potential Shield",			"entries":["You can use your Reaction to create a shield made out of your Main Energy and use this to protect yourself from damage that isn’t from a massive source (like knifes, swords, cannonballs, a van). This Reaction can be used after an attack roll against you is made, but must be before the damage roll has been made. For every point of Energy that you use, you gain 4 DR against damage from energy sources (lasers, plasma, energenetics, etc.), and 2 DR for all other damage types that isn’t afflicted by a massive source. You cannot change how many points of Energy you use after you activated this ability. The effect and this DR ends at the start of your next turn."]},
		{"name": "Dimensional Phase Transition",			"entries":["You can change yourself into a shadow on a surface as an Action, and back as a Free Action.<br>You change into a 2 dimensional form on the surface of an object you touch when you use this ability.<br>The surface area you cover is around a third of your height (in meters) of m<sup>2</sup>. It costs 3 Energy to change into a shadow, 1 Energy to maintain your form, and it costs 1 Energy for every meter you move. Moving in this form doesn’t use your own movement for that turn. (The maximum amount you would be able to move with this ability, in a turn, while in this form, is 165 meter). You cannot Attack or interact normally with things while you are in this form, although you can still get damaged if you are hit by an energy based attack (laser, plasma, energenetic etc.), or if a (topological) hole is made on to you."]},
		{"name": "Dimensional Phase Transition",			"entries":["You can change yourself into a shadow on a surface as an Action, and back as a Free Action.<br>You change into a 2 dimensional form on the surface of an object you touch when you use this ability.<br>The surface area you cover is around a third of your height (in meters) of m<sup>2</sup>. It costs 3 Energy to change into a shadow, 1 Energy to maintain your form, and it costs 1 Energy for every meter you move. Moving in this form doesn’t use your own movement for that turn. (The maximum amount you would be able to move with this ability, in a turn, while in this form, is 165 meter). You cannot Attack or interact normally with things while you are in this form, although you can still get damaged if you are hit by an energy based attack (laser, plasma, energenetic etc.), or if a (topological) hole is made on to you."]},
		{"name": "Shadowing",			"entries":["You can now use your {@feat Dimensional Phase Transition|CDPH} as a Bonus Action instead of an Action"]},
		{"name": "Anti-Phasic Matter Interactions",			"entries":["You can make yourself (together with any objects that you are carrying) invisible as long as you are standing completely still. This costs 2 Energy and an Action every turn."]},
		{"name": "Cloak & Dagger",			"entries":["When you make yourself invisible using {@feat Anti-Phasic Matter Interactions|CDPH}, then it won’t cost Energy to maintain this invisibility as long as you are standing still and don’t Attack with your action. Or you can now spend 2 Energy to stay invisible while you Move that turn."]},
		{"name": "Temporal Immunity",			"entries":["You are fully immune for time dilations and anomalies in the time-space continuum from the timeline you are in. This also includes anything you touch or wear that isn’t a sentient or sapientcreature. You can also estimate how far from the end of the timeline you are in are."]},
		{"name": "Clockworks of Fate",			"entries":["You can stop time for a very short amount. It costs an Action and 10 Energy to use this ability. Using this ability stops time for 3 seconds (or a turn).<br>This extra turn doesn’t give you an extra Reaction, nor does it let you regenerate your Energy points or HP, nor does it let other turn and time based effects happen. You can prolong the amount of stopped time by using this ability while you are already in stopped time, this costs an Action and 7 Energy. While in your stopped time, time doesn’t pass for anything or anyone in an enormously large range (1-3 lightyears) around you. You gain advantage on some (DM decided) skill checks and saving throws while this ability is active. Timeflow resumes instantly when this ability ends, which includes when you touch or attack a sentient creature.<br>When you use this ability, and the stopped time has ended, than you cannot use it again until for the next 10 minutes."]},
		{"name": "17-21",			"entries":["You can now use {@feat Clockworks of Fate|CDPH} as a Bonus Action, this also makes it so that you can prolong your stopped time with a Bonus Action instead of an Action. Furthermore, time does not resume when you attack someone anymore, and with this, you gain advantage on attack rolls you make in your stopped time. Also, instead of being unable to use this ability again until the next fight or next 10 minutes, you can now not use it again until the end of your next time-consuming turn."]},
		{"name": "Time Injection",			"entries":["You can speed up time of an object or creatures as a Bonus Action. It costs 2 Energy for small objects (coins, pens, screws etc.) for every 3 years of age or 2 Energy for medium objects (soccer balls, chairs, doors etc.) and 3 for anything bigger for every 1 year of age. When you use this ability on an object or creature then it ages in the span of 1 turn. You can lessen this ageing amount to less than the 1 or 2 years, but this still costs the same amount of Energy as if you would use the ability in full. This ability does not work on sentient or sapient creatures."]},
		{"name": "Spatial Distortion Immunity",			"entries":["You are fully immune for space distortions and anomalies."]},
		{"name": "Spatial Intuition",			"entries":["You can feel the fabric of space and always know where you are when compared to other places you have been. You can recall the exact direction and distance from your current location to somewhere you have been as accurately as 10 cm when you are within 10 km from it, 0.5 meter when you are within 100 km, 1 meter when within 1 light second, and 10 meter for anything further."]},
		{"name": "You are tearing me apart ....!",			"entries":["You are able to quickly travel to a place that you know the exact location of. You can open a wormhole at a place in air or vacuum in an 8 meter radius around you to a place where you know the exact distance and direction of when compared to your current location. This wormhole has a 0.75 meter radius and it costs an Action and 6 Energy to open. It closes at the start of your next turn, or you can maintain it with a Free Action which costs 8 Energy per turn."]},
		{"name": "Matter Resonator",			"entries":["You can feel matter existing around you, giving you a slight form of omnipresence. You can feel where things are and how they move in a 15 meter radius. This only works with massive things created out of normal matter. This means that you cannot feel very small objects, air, plasma, or any form of matter made from other energies."]},
		{"name": "Spacial Force Projection",			"entries":["You are now able to use {@feat Non-Localised Manipulation|CDPH} on an area instead of only on an object. The maximum area of effect when you do this is around 2 m3, and the largest dimension of the area cannot be longer than twice the shortest dimension of the area."]},
		{"name": "Reverse Entropic Energy Injection",			"entries":["You are able to repair with your Energy. You can spend a Bonus Action and 1 Energy to repair 15 cm of tear. Using this ability on non-mechanical creatures won’t have any healing effect, and using it on mechanical creatures heals them for {@dice 1d6+1}."]},
		{"name": "Chaotic Energy Acquisition",			"entries":["You now regain 3 Energy every turn. Also, you now gain half your Energenetic Specialist Level more Energy for the point of Exhaustion that you get if you use your Energy when you run out, or use more than you have left."]},
		{"name": "Entropic Control",			"entries":["You have learned how to control pure luck somewhat. As an Action, if you or someone you see need to make a purely luck based roll (like for in game rolling of dice, getting cards handed to you in a poker game etc.), than you can roll a second time and choose which dice the outcome will be. This doesn’t work if the roll of outcome has anything to do with Energenetics or things that aren’t normal matter."]},
		{"name": "Devil’s Luck",			"entries":["Your control over luck has increased to levels to where the term “control” is now correctly applicable. As an Action, when you or someone you see need to make a purely luck based roll, or get a purely luck based outcome on something, than you can try to directly manipulate and change the outcome to your will, instead of the effects of {@feat Entropic Control|CDPH}. How much you succeed and what the outcome becomes is solely based on the DM. This doesn’t work if the roll or outcome has anything to do with Energenetics or things that aren’t normal matter.Furthermore, you become immune to Critical Hits."]},
		{"name": "Snake Eyes",			"entries":["You have learned how to passively control your own luck when you fail things in the most horrible ways. If you critically fail a roll, than you are able to ignore the critical part. This effectively lets you able to change any critical fail you roll into an unnatural 1."]},
		{"name": "Energenetic Substitution",			"entries":["<i>Free</i><br><br>You can substitute the Energy you use to any other form of the normal Odin Energenetics tree, just in general. This allows you to branch out the use of your energy to different categories. Substituting your energy with another also changes its color, and with this, you can fully control the color of your Energy if you use it in a visible way. Using this substituted Energy is more exhausting however, increasing the cost and decreasing the effectiveness of abilities that you can get from other Energies."]},
		{"name": "Normal Energy Injection",			"entries":["You are able to use your energy to create natural effects for 2 Energy as an Action. This includes (but is not heavily limited by): creating medium winds (4 Beaufort), creating or dowsing a small fire, making things twice as heavy, instantly boiling or solidifying a body of water not bigger than 1 liter and being able to create a sound of around 100 Db. These effects can be scaled down, and other effects are possible if the DM agrees with the thought of effect."]},
		{"name": "Form Magic",			"entries":["You can change your form into another race or into an object that you have seen before. Your new form cannot be much larger than yourself, not smaller than an average pen, and the original object or race needs to be Full-Materialistic. Changing your form costs an Action and 5 Energy, which means that this is also the cost to turn back to normal.<br>Your Stats change in the following way if you do this: <br>• Your Strength becomes that of the object or creature.<br>• Your Dexterity and Charisma scores becomes the lower between your ability scores and the ability scores of that what you change into.<br>• Your other ability scores (Constitution, Intelligence and Wisdom) stay the same."]},
		{"name": "Primal Magic (Potential Shield)",			"entries":["You can use your Reaction to create a shield made out of your Main Energy and use this to protect yourself from damage that isn’t from a massive source (like knifes, swords, cannonballs, a van). This Reaction can be used after an attack roll against you is made, but must be before the damage roll has been made. For every point of Energy that you use, you gain 3 DR against damage from energy sources (lasers, plasma, energenetics, etc.), and 1 DR for all other damage types that isn’t afflicted by a massive source. You cannot change how many points of Energy you use after you activated this ability. The effect and this DR ends at the start of your next turn."]},
		{"name": "Space Magic (You are tearing me apart ....!)",			"entries":["You are able to quickly travel to a place that you know the exact location of. You can open a wormhole at a place in air or vacuum in an 5 meter radius around you to a place where you know the exact distance and direction of when compared to your current location. This wormhole has a 0.75 meter radius and it costs an Action and 8 Energy to open. It closes at the start of your next turn, or you can keep it open which costs 10 Energy per turn but does not cost an Action."]},
		{"name": "Chaos Magic (Reverse Entropic Energy Injection)",			"entries":["You are able to repair with your Energy. You can spend an Action and 2 Energy to repair 10 cm of tear. Using this ability on non-mechanical creatures won’t have any healing effect, and using it on mechanical creatures heals them for {@dice 1d4}."]},
		{"name": "Time Magic (Time Injection)",			"entries":["You can speed up time of an object or creatures as a Bonus Action. It costs 2 Energy for small objects (coins, pens, screws etc.) for every 2 years of age or 3 Energy for medium objects (soccer balls, chairs, doors etc.) for every 1 year of age.<br>When you use this ability on an object or creature then it ages in the span of 1 turn. You can lessen this ability to less than the 1 or 2 years, but this still costs the same amount of Energy as if you would use the ability in full. This ability does not work on sentient creatures."]},
		{"name": "Psychic Magic (Telepathy)",			"entries":["You can communicate with other non-mechanical creatures. This is as free as an action as normal talking is. This is two way, which means the creature you are communicating with can respond. <br>You and the creature can only communicate in languages you know however. This ability does not cost any Energy to use.<br>This ability doesn’t work against creatures that have resistance against mental intrusions."]},
		{"name": "Mind over Matter",			"entries":["You are completely immune against all attacks and abilities that use this form of energenetics. You are also immune against any form of mental intrusion or anomaly (Except for {@feat Telepathy|CDPH} which you can choose to ignore).<br>Also, you can control your emotional state perfectly, gaining proficiency on the Deception skill, or expertise if you already were proficient."]},
		{"name": "Telepathy",			"entries":["You can communicate with other non-mechanical creatures. This is as free as an Action as normal talking is. This is two way, which means the creature you are communicating with can respond.<br>You and the creature can only communicate in languages you two know. This ability does not cost any Energy to use.<br>If a creature has resistance against mental intrusions, than you need to roll a Wisdom check against their Wisdom Ability Score."]},
		{"name": "Crystal Mind",			"entries":["You can read the mind of others as an Action. If you try to use this ability on an unwilling creature or a creature who has resistance against mental intrusions, than they need to make a Wisdom Saving Throw against a DC of 7 + Proficiency + Intelligence Modifier + Wisdom Modifier. The result of this save resets after 6 hours. When they succeed, than they are immune to you using this ability on them. <br>When they fail, than you can read their mind and memories. You are in an unconscious type of trance while you are doing this, and do not register anything that is happening around you. You can snap out of your trance and out of the other persons mind on will. When you read someone’s memory, then you experience everything about said memory that they know. And although you are able to do this, it is still near impossible to guess the emotional state of the target by just probing their memories."]},
		{"name": "Dream of a Black Swan",			"entries":["You are able to effectively change other creatures their mindset, emotional state and or overall mood and are able to create mental effects. Using this ability costs an Action and at least 2 Energy. If you use this ability on a unwilling creature or a creature that has resistance against mental intrusions or anomalies, than they need to make a Wisdom Saving Throw, and the DC they need to succeed on is:5 + Proficiency + Intelligence Modifier + Wisdom Modifier + 1 per 3 extra Energy used. <br>The outcome of this roll resets after 30 minutes. If they succeed, then they are immune to you using this ability on them. If they fail, then you are able to do one of the following things: change their general mood, change their emotional state, change their mindset on something (as long as it wouldn’t directly harm them), put them to sleep, force them awake, or something else that falls in this category and the DM agrees with. The effect stops after the saving throw is reset, after which the person can remember everything he did in the affected time, but may or may not know that you are responsible. It also ends when you actively work against the effect that you gave (like changing someone friendly towards you and constantly being overly mean while the person is affected). "]},
		{"name": "Maintenance","entries":["<i>Free</i><br><br>This class is partially specialized in making things, let it be weapons or utility items. But making these things is only half of the work, as most unprofessionally made machines and items will break down quite quickly if they are not maintained.<br>You have a pool of points called Maintenance Points, MP for short, which you can allocate to items that you make with Abilities from this class. <br>You have 6 MP that you can allocate, and you can increase this with some Abilities in this class. If you create or get something that needs allocated MP, than you can allocate it immediately if you have enough unallocated MP left. You can reallocate your MP every 24 hours and in a Rest.<br>If you don’t allocate MP into an item that needs it, then said item or said part of an item stops working until you allocated the needed MP into it again. <br>The amount of allocated MP an item needs can be seen on the header of said ability/item."]},
		{"name": "Multitask Master",			"entries":["You have learned how to multitask when maintaining your things, which lets you maintain more things in the same amount of time.<br>You gain 6 more MP that you can allocate, upping your total to 12 MP."]},
		{"name": "Efficient Prioritization",			"entries":["You have learned how to prioritize specific things when you do your maintenance. Making sure you do the most important stuff first, and reducing redundant work lets you maintain even more things in the same amount of time.<br>You gain 8 more MP that you can allocate, upping your total to 20 MP."]},
		{"name": "Puzzle Master","entries":["You are proficient at creating new things from blueprints, and have become quite knowledgeable how to take machinery apart. You gain proficiency when you try replicate some form of electronics or machinery, and expertise when you try to disassemble something while you have Mechanics Tools. The amount of time it takes to replicate objects depends on the object, and can range from a few minutes to a few days."]},
		{"name": "Magister Horologium Opus","entries":["You are able to create small things that may be of use, like a lockpick, flashlight or simple timer. It costs 3 to 5 minutes to make such small usable item. If you want to make something, then you need to throw a {@skill Mechanical Manipulation} Check against a DC that is based on how physically difficult it is to make the object. Every time you roll to create an item, the DC for creating the same and similar items increases until your next rest."]},
		{"name": "Deus Intus Machina",			"entries":["You have learned how to make larger things, including improvised tools and weaponlikes. Items made with this ability need to be maintained, and the maintenance points needed differs per item. You can only create items with this ability in a Rest and you need to have access to Mechanics Tools and a good source of scrap and materials (this means that you cannot create these items if you are stranded in the middle of a desert). A list of example items that you can make with this ability can be seen {@filter here|items|From Ability=DIM}. You are able to make other things that are not on this example list, but you need to discuss this with the DM if you thought of something."]},
		{"name": "Fraudulentus Naturae",			"entries":["You have learned how to use energenetic theories into your crafts, being able to create effects and items, while niche, far superior than ever before. Items made with this ability need to be maintained, and the Maintenance Points needed differs per item. You can only create items with this ability in a Rest and you need to have access to Mechanics Tools. A list of items that you can make with this ability can be seen {@filter here|items|From Ability=FN}. You are able to make other things that are not on this example list, but you need to discuss this with the DM if you thought of something."]},
		{"name": "Builders League United","entries":["You are an expert at repairing things. You nowhave expertise when repairing things while you use your Mechanics Tools, and still have normal proficiency when you need to improvise with tools.<br>You can also Heal/Repair mechanical creatures using your Mechanics Tools as an Action. You can heal {@dice 2d4}+{@skill Mechanical Manipulation}. The total health you can repair per Rest is 10+2xEngineer Level, at which point your spare parts and materials are running too low to effectively repair or create anything."]},
		{"name": "Little Helper","entries":["You gain a small robot companion that helps you with things. This companion can for example be a mechanical version of any small animal (maximum medium dog sized) or a higher tech version of a commercial RC drone. You can choose if this companion is sapient or not. <br>If it isn’t sapient, than it only has an Action and Reaction, you can fully control it as a Bonus Action, and it will execute any simple command given to it without thinking until you give it another command. If it is sapient, than you won’t have any direct control over it, but it will still try to execute any command given to it to the best extend of its abilities, and will try to help you actively. It shares your Initiative/Turn as it monitors and reacts to your vitals for your current emotional state. Its stats are described in Appendix C.<br>What your companion can do depends on what it is, but it can always give or remove half your Proficiency Bonus on any D20 roll that isn’t a Death Save while it is within 1 meter of someone as a Reaction."]},
		{"name": "Big Helper",			"entries":["You have learned from your experience with your mechanical companion how to create a larger robot while still keeping the thing stable. You can now change your Little Helper into a new form. Its form doesn’t need to be like an animal anymore, and the limit of how big you can make your companion is now around the size of a bear. You can choose to transfer the AI core of your Little Helper if had Sapience, or put in a new AI, or put in none at all. The effects of sapience and non-sapience are described in the {@feat Little Helper|CDPH} ability. Its stats are described in Appendix C. What your companion can do still depends on what it is, but it can always give or remove half your Proficiency Bonus on any D20 roll while it is within 1 meter of someone as a Reaction."]},
		{"name": "Power Armor Master","entries":["You gain proficiency in Power Armor."]},
		{"name": "Active Weapon Systems","maintenance": 2,			"entries":["You can install weapon systems on your Little Helper (as long as it isn’t Tiny) or on Power Armor. You can choose if it is a melee or ranged weapon, and if ranged which kind of weapon it is. This weapon has the “unconventional” trait. While melee weapon installation can be done in such a way that it is fully invisible from the outside while sheathed, ranged weapon installation cannot, and will always be partially visible to people who know what to look for.<br>An installed melee weapon does {@dice 2d8} for small or uncontrolled melee weapons like daggers or chainsaws, or {@dice 2d10} + 1.5 x Strength Modifier damage for anything else. You can add your proficiency to its attack roll if it is on your power armor.<br>An installed ranged weapon has the range and damage of the normal weapon. You can add your proficiency to your attack rolls with this weapon, and the weapons don’t consume any ammo except for energy, which you should have plenty of. The weapon only works as long as your power armor is working completely fine. You cannot and do not need to reload this ranged weapon, but effects from weapon mechanics like Bolt-Action still effect its performance and how the weapon works.<br>Attacking with this weapon system costs an Attack Action."]},
		{"name": "Predictive Targeting Sensors",			"entries":["You gain expertise with your attack rolls made with installed weapons with {@feat Active Weapon Systems|CDPH} instead of just proficient."]},
		{"name": "Watchmaker",			"entries":["You have learned how to improve or “improve” weapons with modifications. You need your Mechanics Tools and quite some time to do this, which means it can only be done in a Rest. Only one modification can be done in a day, Modifications can be changed or removed in the same way that you add them, and weapons can only have one Modification at the same time. The modifications that you can add to weapons that do not have the “special” trait can be seen {@filter here|items|From Ability=WM}."]},
		{"name": "Improvised Attachments",			"entries":["You have learned how to create and apply improvised attachments to your weapons. These modifications can only be added to guns, and cannot get added to special or improvised weapons. Also, weapons and armors you modify can now have up to two modifications at once.<br>The additional list of modifications you can add to your weapons with {@feat Watchmaker|CDPH} can be seen {@filter here|items|From Ability=IA}."]},
		{"name": "Advanced Attachments",			"entries":["You modify your weapon in more advanced ways, and have thought of a few new attachments. These modifications cannot get added to special or improvised weapons.<br>Weapons and armors you modify can now have up to three modifications at once. The additional list of modifications you can add to your weapons with {@feat Watchmaker|CDPH} can be seen {@filter here|items|From Ability=AA}."]},
		{"name": "Experimental Attachments",			"entries":["You have come up with some modifications for normal weapons that are stable at best, highly destructive for anything around it at worst. Only people with this Ability can use weapons with these modifications, anyone else can’t use the weapon the way it is supposed to making it an improvised weapon for them. You cannot improve special, unconventional or improvised weapons with this ability. A weapon or armor can only have one of these modifications. You can only add these modifications in downtime as only a rest isn’t long enough, because you also need to gather quite an amount of supplies to add these modifications. The additional list of modifications you can add to your weapons with {@feat Watchmaker|CDPH} with consideration of these restrictions can be seen {@filter here|items|From Ability=EA}."]},
		{"name": "Defensive Cover","entries":["Cover now gives 1 extra AC and the DR that you get from Cover is now doubled"]},
		{"name": "Hack & Slash","entries":["You have learned how to hack electronic systems, networks and some machines from the outside as long as you can make a form of connection. To do this, you need to make a {@skill Computers} check against a DC that is dependent on how secured the system is. When you succeed, you can browse through the system, looking for devices or files, and maybe even change some things. This doesn’t mean that you can’t get noticed however and you may need to make more checks because of this.You also learn how to read binary without problems."]},
		{"name": "Hack the World",			"entries":["When you hack into something, you have learned how to cover yourself up completely. It is now impossible to track which and where a system is getting invaded from solely said something alone.<br>You also gain proficiency in the {@skill Computers} skill, or expertise if you were already proficient."]},
		{"name": "SAVE the World",			"entries":["You have learned how to easily strip most data of an electronic system, network or machine. If you succeeded hacking into something, than you can try to copy and download every file that a part of said system has to a storage device you have or upload it to an cloud-like storage, and you need to make a {@skill Computers} Check to do this. Neither way removes files and only copies them. You are more easily visible to people and things looking for you on the system while this is happening. Also, downloading the data to a storage device is a lot quicker than uploading it, but uploading can be activated and done in the background even if you disconnect from the system. Both ways of acquiring the data can be stopped only if the person trying to stop this succeeds a {@skill Computers} Check against the one you threw when you started the transfer."]},
		{"name": "Nuke Protocol",			"entries":["You are able to destroy entire electronic systems when you are hacked into them. If you hacked into a system, than you can roll a Computers Check against a DC based on the internal security of the device. If you fail, you will get kicked out of the system entirely. For the system it is clear that someone infiltrated and it becomes harder to hack again for you, permanently increasing its security based DC by {@dice 1d4+2} for you. If you succeed however, then you are able to start nuking the system one part at a time. When you start it, you can choose if the destruction eventually spreads over the entire system or internal network, or if it only destroys a specific part.<br>While it can be stopped when started, you or anyone else trying this needs to succeed an Intelligence Check against your {@skill Computers} Check that you threw to stop this, and can repeat this roll only once every few minutes."]},
		{"name": "Maintenance Mastery",			"entries":["<i>Mastery</i><br><br>You gain 2 more MP that you can allocate."]},
		{"name": "Second Wind",			"entries":["You have learned how to strengthen yourself while in battle. You can use your bonus action to heal yourself for 4 HP, which you can use once every 10 turns of a fight. You also heal 4 HP every hour when not in a fight."]},
		{"name": "Stalwart","entries":["You have gained enough experience to improve your chances to overcome some incredible odds.<br>You can reroll one save or attack per Rest with advantage. You can do this after knowing if the first roll is a fail or not."]},
		{"name": "Intransigent",			"entries":["You are able to extend your stamina a bit for when you need to give it your all.<br>You can now use Stalwart two times per Rest."]},
		{"name": "Determination",			"entries":["You are able to more easily stabilize yourself when needed. When throwing death saves, you only need to throw 2 successes to get stabilized again instead of 3."]},
		{"name": "Resolute",			"entries":["You can force yourself to overcome any important obstacle in your way. You can now use {@feat Stalwart|CDPH} twice every hour."]},
		{"name": "Eye of the Tiger","entries":["You are better able at hitting people in their weak spots. Your crit range with melee attacks is now 1 lower. Also, you are now Proficient in {@skill Perception} and on sight based Insight, or expertise in {@skill Perception} if you were already Proficient."]},
		{"name": "Superior Critical",			"entries":["You have really learned how to hit people where it hurts more easily.<br>Your crit range with melee attacks is now 1 lower"]},
		{"name": "Remarkable Athlete","entries":["You can add half your Proficiency (rounded up) to any Strength, Dexterity or Constitution based check if you are not proficient in that skill.<br>Also, you gain Expertise in an Ability Score Save that you were already Proficient in."]},
		{"name": "Manoeuvres","entries":["You have learned how to do fancy moves with your weapons. You can now semi-confidently do stuff like disarming people, trying to jump over people if you have a semi-long weapon like a sword, feigning, making someone fall over etc. If you want to do some fancy stuff, than you need to make a Dexterity check against a DC depending on the situation. If you do something that affects others, than the DC is around 10, depending on what you do, and depending if they have this ability as well or {@feat Martial Arts|CDPH}, as the DC is than their Dexterity or Strength score, whichever is higher. If you do something that only affects you, than the DC would normally be around 12, depending on what you want to do"]},
		{"name": "Manoeuvrable Block","entries":["You are able to quickly react and block ranged attacks that aren’t sneak attacks.<br>When you take the Dodge action while you are wielding a melee weapon, then you get a DR Bonus equal to your Attack Roll Bonus of said weapon to any ranged attack that hits you until the start of your next turn, and you get an AC Bonus equal to half your Attack Roll Bonus of said weapon to any melee attack that hits you until the start of your next turn."]},
		{"name": "Honourable Distance","entries":["It is now easier for you to push people away. The damage threshold for pushing people is now 2 less. You can now also choose to do 2 less damage with an attack if you hit someone, and push them an extra meter instead."]},
		{"name": "Centered Mass",			"entries":["You have learned how to use your mass when manoeuvring in fights.<br>You get a bonus +3 on attack and damage rolls with melee weapons and on manoeuvres, and ignore 5 DR."]},
		{"name": "Centered Edge",			"entries":["You have learned how to be more consistent when attacking.<br>You can now choose to, instead of throwing your damage dice, to just take the average of the dice rounded up."]},
		{"name": "Martial Expertise",			"entries":["You are extremely experienced in fighting with melee weapons, and are now able to use them even more proficiently then before.<br>Instead of getting your Dexterity Modifier as a bonus for attack rolls and 1.5 times your Strength Modifier as a bonus for your damage rolls for melee weapons, you now get 2 times your Dexterity Modifier as a bonus for attack rolls and 2 times your Strength Modifier for damage rolls.<br>You can now also use 2 times your Dexterity Modifier instead of 2 times your Strength Modifier if the melee weapon can do piercing or slashing damage."]},
		{"name": "Quick Dodge","entries":["You have learned how to include more freedom of movement when doing things, making it easier to dodge out of the way of things.<br>You can now use the Dodge Action as a Bonus Action."]},
		{"name": "Metropolis Espcape","entries":["You can now Dash as a Bonus Action instead of an Action. If do this, then you can’t Dash as an Action as well that turn. You can also Dash as a Free Action at the cost of one Exhaustion."]},
		{"name": "Weapon Specialization",			"entries":["You can specialize into the use of specific weapons, which lets you use them more effectively. You gain +1 to throws to make Manoeuvres, and you can choose one of the following specializations:<br><br>• Dual Wielding Specialization:<br>You can now dual wield weapons effectively. Because of this, if you used your Action for a melee attacked, then you can use your Bonus Action to make an attack with the weapon that you didn’t use.<br><br>• Bludgeoning Specialization:<br>You can now use bludgeoning based weapons like maces more efficiently. You now deal double bludgeoning damage to obstacles with melee weapons, and ignore 5 DR when dealing bludgeoning damage with melee weapons.<br><br>• Slashing Specialization:<br>You are able to use purely slashing based weapons like axes more effectively. If you use a melee weapon that can only do slashing damage, than your crit range gets lowered by 1 for attacks with that weapon.<br><br>• Piercing Specialization:<br>You are able to use weapons that can do piercing damage more effectively. You now gain Expertise in melee attacks with melee weapons that can do piercing damage as long as you don’t dual wield them."]},
		{"name": "Martial Mastery",			"entries":["<i>Mastery</i><br><br>On weapons that do purely bludgeoning damage, you gain 2+5% DR.<br>On weapons that do purely slashing damage, you gain +1 Damage.<br>On weapons that do any form of piercing damage, you gain +1 to Hit."]},
		{"name": "Unarmored Monk Defense","entries":["While you are wearing no armor, your AC equals 9 + Dexterity Modifier + Wisdom Modifier."]},
		{"name": "Martial Arts","entries":["Your practice of martial arts gives you mastery of combat styles that use unarmed strikes or monk weapons, which is any Melee Weapon that don’t have the Heavy trait. This weapon only does bludgeoning damage while you use it as a Monk Weapon. You gain the following benefits while you are unarmed or wielding only monk weapons and you aren’t wearing armor:<br>• You can use your Dexterity Modifier instead of your Strength Modifier for the damage bonus of your unarmed strikes.<br>• You can add your Strength and Dexterity Modifier to the attack rolls of your unarmed attacks and attacks with your monk weapon.<br>• You can roll a {@dice d8} in place of the normal damage of your unarmed strike or monk weapon.<br>• When you use the Attack Action with an unarmed strike or a monk weapon on your turn, then you can make one unarmed strike as a Bonus Action."]},
		{"name": "Inner Control","entries":["<i>Free</i><br><br>You slowly gain full control over some internal processes of your body, and because of this you start to harness Ki. Your maximum Ki points are 10 + Monk Level, and you regain all Ki when you finish a rest. You can spend these Ki points to fuel various abilities.<br>Some of your Ki features require your target to make a saving throw to resist the feature’s effects. <br>The saving throw DC is calculated as follows:<br>Ki Save DC = 8 + Proficiency Bonus + Wisdom Modifier."]},
		{"name": "Pure Life","entries":["You gain better control over the majority and most important body processes. You gain the following abilities that you can do as an Action depending if your species supports it:<br>• You automatically succeed on Constitution saving throws to hold your breath, and gain advantage on every subsequent save for this before you catch your breath again.<br>• You can spend 1 Ki point to stop your heartbeat.<br>You can restart your heartbeat with 1 Ki point, or for free when you stopped it with this ability.<br>(Saving throws for a stopped heartbeat will be the same as for holding your breath) <br>• You can speed up or slow down your metabolic functions. You are able to speed it up, spending more energy to warm yourself, or slow it down when you need to conserve energy and to cool down more easily. <br>• You can spend 3 Ki points to undo a point of Exhaustion.<br>• You can spend 3 Ki point to heal cutting/flesh wounds and broken bones, healing yourself for 1d10 HP.<br>You are also able to do things that are not on this list if the DM accepts the effect.<br>(species unique stuff wip)"]},
		{"name": "Patient Defense","entries":["You can spend 1 Ki point to take the Dodge Action as a Free Action on your turn."]},
		{"name": "Step of the Wind","entries":["You can spend 1 Ki point to take the Dash Action as a Bonus Action on your turn, your jump distance is doubled for the turn, and difficult terrain doesn’t affect you for the turn. You also gain advantage on any {@skill acrobatics} rolls you make this turn."]},
		{"name": "Unhindered Movement","entries":["<i>Mastery</i><br><br>You can permanently forgo 3 Max Ki points to be more nimble, permanently gaining 1 Dexterity Score, 1 Max Dexterity Score, and 1 meter of movement speed."]},
		{"name": "Gracefull Fall","entries":["You can use your Reaction when you fall to reduce any falling damage you take by anamount equal to 5 x Monk Level."]},
		{"name": "Deflect Missles","entries":["You can use your Reaction to deflect or catch something shot or thrown at you when you are hit by a ranged weapon attack that isn’t a gun. When you do so, the damage you take from the attack is reduced by {@dice 1d10} + Dexterity Modifier + Monk Level.<br>If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch something in this way, you can spend 1 Ki point to make ranged attack with the weapon or piece of ammunition you just caught, as part of the same Reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."]},
		{"name": "Stunning Strike","entries":["You know how to hit the problematic spots for most creatures with uncanny strength and precision. When you hit another creature with a unarmed strike, you can spend 1 Ki point to attempt a stunning strike. The target must succeed on a Constitution Save against your {@feat Inner Control|CDPH|Ki Save DC} or be stunned until the end of your next turn. You can use this ability once per turn."]},
		{"name": "Evasion",			"entries":["Your instinctive agility lets you dodge out of the way of certain area effects, or foresee and strengthen yourself for “undodgeable” attacks. You can spend your Reaction and 1 Ki point to succeed on any Constitution Save or Dexterity Save as long as you don’t throw a 1. If you use this ability on an Attack with guaranteed damage without the need of a Constitution Save or Dexterity Save, then that damage is halved."]},
		{"name": "Stillness of Mind","entries":["You can use your Action to end one effect on yourself that is causing you to be charmed, frightened, or any other anomalous mental effect."]},
		{"name": "Purity of Body","entries":["Your mastery over your body makes you immune to disease and toxic."]},
		{"name": "Perfect Self","entries":["When you roll for initiative and have less than 5 Ki points remaining, then you regain Ki points until you have 5 remaining."]},
		{"name": "Diamond Soul",			"entries":["Your mastery of Ki grants you proficiency in all Ability Score Saving throws. Additionally, whenever you make a Saving Throw, you can spend 2 Ki point to reroll it and take the new result."]},
		{"name": "Open Hand Technique","entries":["You can manipulate your enemy’s Ki when you hit them. Whenever you hit a creature with an unarmed strike or Monk weapon, you can impose one of the following effects on that target:<br>• It must succeed on a Dexterity Saving Throw or be knocked prone.<br>(This only works if the target is human or very humanoid)<br>• It must make a Strength saving throw. If it fails, you can push it up to 3 meter away from you.<br>• It can’t take Reactions or execute Hold Actions until the end of your next turn."]},
		{"name": "Opportunist","entries":["You can exploit a creature's momentary distraction when it is hit by an attack. Whenever acreature within melee range of you is hit by an attack made by a creature other than you, you can always use your Reaction to make a melee attack against that creature, even if you didn’t hold that as a Hold Action."]},
		{"name": "Piercing Strike","entries":["Your unarmed attacks and attacks with your monk weapon now ignore percentage based DR. You can also spend 3 Ki points and the ability to Attack more than once this turn to change your {@dice d8} unarmed or monk weapon damage to {@dice 3d6} for this turn, and make your next melee attack fully ignore DR. You cannot use this ability if you already attack this turn."]},
		{"name": "Energy of the Gods","entries":["If you have 6 or more Ki points left, than you can spend all your Ki points to stabilize yourself if you are throwing death saves, and remove all your fails on death saves. This is a Free Action."]},
		{"name": "Body Mastery","entries":["<i>Mastery</i><br><br>You get 2 more max Ki points.<br>Also, if you have {@feat Perfect Self|CDPH}, you will gain one more Ki point when getting Ki points from that Ability."]},
		{"name": "Chekov’s Very Intimidating Gun","entries":["You notice how the use of a pistol often has a positive impact if people decline to take you up on an “offer”. You can use your pistol to gain advantage on intimidation. This can, of course depending on the situation, have quite substantial unwanted side effects."]},
		{"name": "Let’s Get Critical","entries":["You have the ability to specifically aim for weak spots. You can choose to use your Bonus Action to gain disadvantage with attack rolls on this turn, which cannot be negated normally, which includes rolling more D20’s by other means. When you choose to use this ability, a hit will count as a critical hit, doubling the damage dice(s) you roll. When this ability is active, a natural 20 will not negate AC in the way it normally does.<br>(If you roll a 20+3 with this ability active, but the target has 25 AC, than it won’t be a hit.)"]},
		{"name": "Bolt-Bonus","entries":["You can do bolt-loading/unloading as a Bonus Action instead of as an Action, meaning that weapons with the <i>Bolt-Action</i> trait don't effect you anymore."]},
		{"name": "Deflector","entries":["You know how to use your gun to defend yourself from bullets without them damaging your gun (too much). You gain +2 AC while you are holding a gun that isn’t pistol with both of your hands (which you need to be able to shoot it in the first place), and you gain the ability to use the Evade Action as a Bonus Action instead if you do not hold a two-handed weapon."]},
		{"name": "Faster Than His Shadow","entries":["Your reaction time lowers to the point that it is hard to see if you actually react or predicted something, although the results often prove that it isn’t the latter.<br>If you have your pistol in one of your hands, or in a holster that is easily accessible, and see someone that shoots a gun, then you can use your reaction to deflect the projectile. This will guarantee that the projectile will miss its original target (exceptions with the targeted projectile being something very massive).<br>But this will only work if your pistol and the gun that shoots the projectile that you want to deflect are both pressure/coil based, or are both plasma based.<br>Energenetic guns can work against pressure, coil, plasma and energenetic projectiles, but are very unreliable. Deflecting an arrow/bolt shot from a bow or crossbow always works with all of the types described (pressure, coil, plasma and energenetic).<br>You can use this three times per Rest. If you use it more, then you need to roll attack rolls against an AC of 20."]},
		{"name": "Triggered","entries":["<i>“My trigger discipline is too strong, I can stand here not shooting you all day.”</i><br>You can feel a miss coming from a mile away. If you shoot at a target, but it would be a miss, you don’t even shoot anymore. You can still decide to shoot if you think it is going to be a miss, but you need to notify the DM before the attack roll."]},
		{"name": "Jackhammer Chip Damage",			"entries":["When you shoot with a long ranged gun, you can choose to take half of the maximum of your damage die(s) instead of rolling them. This cannot be used in conjunction with {@feat Let’s Get Critical|CDPH}.<br>Example: If your sniper has a damage of {@damage 3d4+3}, than you can choose to change that to 6+3 damage instead."]},
		{"name": "Professionals Have Standards",			"entries":["{@feat Let’s Get Critical|CDPH} doesn’t post disadvantage to you anymore, with the condition that you decide not to move this turn."]},
		{"name": "Close Quarter Specialist","entries":["You can gain double advantage to hit a target when you shoot a the target while you are within melee range of the target. If you use this ability, your movement speed will be set to 0 until the end of your turn."]},
		{"name": "Knockback Propelled Parry Maneuvers",			"entries":["You gain +3 AC against the first melee attacks after you shot with a weapon with knockback at least once last turn."]},
		{"name": "The Eye of the Emperor","entries":["You have learned where the weak spots of most armors are. All of your shots gain 10 DR-penetration when hitting a creature that is wearing a common type of armor."]},
		{"name": "Dedicated Hitter","entries":["If you are within Melee Range of a target, and you use your Action to shoot, you can use your Bonus Action to make a melee attack with the ranged weapon you shot with. You are Proficient in this melee attack, and the damage this gives is {@damage 1d6}."]},
		{"name": "Pistol Master","entries":["You are able to use your Bonus Action to shoot with your pistol."]},
		{"name": "It’s Free Real Estate",			"entries":["Every turn, the first time you shoot with your pistol doesn’t cost an Action."]},
		{"name": "And Free Means Free",			"entries":["Every turn, the first two times you shoot with your pistol don’t cost an Action."]},
		{"name": "Prepare for Trouble and Make it Double",			"entries":["Your ranged attacks now fully ignore percentage based Damage Reduction, and gain +3 damage."]},
		{"name": "Magazine Hoarder","entries":["You now know how to scour for ammunition at markets and alleyway shops, and you have learned how to more easily take more ammunition with you. You can now take up to 5 extra magazines with you instead of just 2."]},
		{"name": "Ranger Mastery",			"entries":["<i>Mastery</i><br><br>You gain +1 to Hit with ranged weapons, and you can take 1 extra magazine with you."]},
		{"name": "Expertise","entries":["You can choose 2 skills that you are proficient in and get expertise in them instead."]},
		{"name": "Expertise 2 Electric Boogaloo",			"entries":["You can choose another 2 skills that you are proficient in and get expertise in them instead."]},
		{"name": "Muscle Memory Reflexes",			"entries":["You now have 3 Reactions each turn, instead of 1."]},
		{"name": "Sneak Attack","entries":["You can attack someone without them really noticing what happened or from where. You gain +4 damage on attacks you have advantage on, or when another friendly creature is withing melee range of the enemy you are attacking. Sneak attacks now also ignore flat DR."]},
		{"name": "Slice & Dice",			"entries":["You gain advantage on any attack roll against an enemy when you attack an enemy while another friendly creature is withing melee range of it. Also, you can now change your advantage with an attack roll into two separate attacks without advantage if you are attacking with a melee weapon."]},
		{"name": "Cunning Action","entries":["You can use your Bonus Action to Hide or Dash."]},
		{"name": "Uncanny Dodge","entries":["While you sometimes can’t evade an attack, you can position yourself in such a way that it won’t hit like intended. You can use your Reaction to halve the damage of an attack that you can see. When you use this ability on another creature than yourself, then that creature needs to be in melee range of you, and both you and the creature take half of the attacks damage."]},
		{"name": "Reliable Talent",			"entries":["Every skill check roll of a proficient skill where the D20 rolls less than 10 can now be considered to be a 10. When you critical fail a skill check you have expertise in, you can minimize the damage and change it to a normal fail, which will be handled like an unnatural 1."]},
		{"name": "Blindsense","entries":["You know how to see without actual vision. You can see the area and location of enemies in a range of 5 meter range around you through sound and vibrations. This does not work through any sort of wall including glass."]},
		{"name": "Slippery Mind",			"entries":["You are now Expertise in Wisdom Saving Throws."]},
		{"name": "Elusive",			"entries":["Enemies that try to hit you never have advantage on attack rolls against you as long as you are conscious. These advantages do counteract disadvantages on the roll however."]},
		{"name": "Stroke of Luck",			"entries":["You have the ability to change a missed attack roll to a hit, or to change a skill check or a (not death) saving throw to a natural 20. You can only use this ability once per Rest."]},
		{"name": "Ear for Deceit","entries":["When you do Insight checks to see if someone is lying, than every D20 roll under 8 can be considered 8 except for a 1. If you roll a 1 for this, than it is now considered a fail instead of a crit fail.<br>You also never gain wrong information out of your insight throws anymore."]},
		{"name": "Eye for Detail","entries":["You are able to use your Bonus Action to search for a Hidden creature ({@skill perception} check), or to find clues or decipher things ({@skill investigation} check)."]},
		{"name": "Insightful Fighting",			"entries":["You can use your Bonus Action to contest an enemies {@skill deception} against your {@skill insight}. You need to be able to see this enemy. You can use your sneak attack against this enemy for a duration of 5 turns if you win the contest."]},
		{"name": "Steady Eye","entries":["You can give yourself advantage on Perception and {@skill investigation} checks. Gaining advantage this way does cost you half of your total speed for the turn"]},
		{"name": "Unerring Eye","entries":["You can feel if there are holograms or shapeshifters in a 10 meter radius around you that are not in their original form, as long as you are not blinded or deafened. You do not know where this comes from, or what its original form is."]},
		{"name": "Insightful Manipulator","entries":["If you spend at least 1 minute observing or interacting with another creature outsidecombat, you can learn certain information about its capabilities compared to your own or someone you know. The DM tells you if the creature is your (of someone else’s) equal, superior, or inferior regarding 2 of the following characteristics of your choice:<br>• Dexterity Score<br>• Intelligence Score<br>• Wisdom Score<br>• Charisma Score<br>• Highest Class Level<br>• Highest Class Level Class<br>• It's Class or Classes<br>• Total Level<br>Sometimes, you might also realize you know a piece of the creature’s history or one of its personality traits, if it has any. You can use this ability again after another minute of observation."]},
		{"name": "Misdirection","entries":["You can sometimes cause another creature to suffer an attack meant for you. When you are targeted by an attack while another creature is within melee range of you, than you can use your Reaction to have the attack target that creature instead of you."]},
		{"name": "Mind of Chaos","entries":["Your thoughts and memories can’t be effectively read by telepathy or other means, unless you allow it. (This counts as immunity, but one that you can control yourself)"]},
		{"name": "Skirmisher","entries":["You are difficult to pin down during a fight. You can move up to half your speed as a Reaction when an enemy ends its turn within melee range of you."]},
		{"name": "Ambush Master","entries":["You excel at leading ambushes and acting first in a fight. You have advantage on initiative rolls. In addition, the first creature you hit during the firstround of a combat becomes easier for you and others to strike. Attack rolls against that target have advantage until the end of your next turn.<br>When using sided Initiative, you and any creature with this ability also gets a free turn at the start of a fight."]},
		{"name": "Panache","entries":["Your charm becomes extraordinarily beguiling. As an action, you can make a Charisma (Persuasion) check contested by a creature’s Wisdom (Insight) check. The creature must be able to hear you, and the two of you must share a language.<br>If you succeed on the check and the creature is hostile to you, it has disadvantage on attack rolls against targets other than you. This effect lasts for 10 turns, until one of your companions attacks the target, or until you and the target are more than 12 meter apart.<br>If you succeed on the check and the creature isn’t hostile to you, it is charmed by you for 1 minute. <br>While charmed, it regards you as a friendly acquaintance. This effect ends immediately if you or your companions do anything harmful to it."]},
		{"name": "Elegant Maneuver","entries":["You can use your Bonus Action on your turn to gain advantage on {@skill acrobatics} or {@skill athletics} checks you make during the same turn."]},
		{"name": "Rogue Mastery",			"entries":["<i>Mastery</i><br><br>You get one more Proficiency which you can put into a skill, or you can get Expertise in a skill you were already Proficient in. "]},
		{"name": "Ability Score Improvement 1A","entries":["You gain +1 ability score in an Ability Score of your choice."]},
		{"name": "Ability Score Improvement 1B",			"entries":["You gain +1 ability score in an Ability Score of your choice."]},
		{"name": "Ability Score Improvement 2A",			"entries":["You gain +2 ability score that you can spend in Ability Scores of your choice."]},
		{"name": "Ability Score Improvement 2B",			"entries":["You gain +2 ability score that you can spend in Ability Scores of your choice."]},
		{"name": "Ability Score Improvement 2C",			"entries":["You gain +2 ability score that you can spend in Ability Scores of your choice."]},
		{"name": "Ability Score Improvement 3A",			"entries":["You gain +3 ability score that you can spend in Ability Scores of your choice."]},
		{"name": "Ability Score Improvement 3B",			"entries":["You gain +3 ability score that you can spend in Ability Scores of your choice."]},
		{"name": "Self Mastery",			"entries":["<i>Mastery</i><br><br>You gain +1 ability score and +1 max ability score in an Ability Score of your choice."]},
		{"name": "Skilled","entries":["You gain proficiency in 3 skills of choice."]},
		{"name": "Savage Attacker","entries":["Physical actions like climbing, standing up or running for a long time are easier, and you automatically succeed the first Saving Throw that is required when doing these things for a long time. You also gain Proficiency in Athletics or Stamina, or Expertise in one if you were already Proficient in both."]},
		{"name": "Keen Mind","entries":["While you don’t have a photographic memory, you are able to recall almost everything that happened the last week. You also remember places and paths you have taken really well and don’t need to make Memory Throws for trying to recognize or remember these.<br>You also gain proficiency in {@skill memory}, or Expertise if you were already proficient."]},
		{"name": "Pet Shop","entries":["You gain the eyesight of an eagle. You can see up to 1 kilometer away with no difficulty, able to discern fine details as though looking at something no more than 30 meter away from you. <br>Additionally, twilight-ish amount of light doesn't impose debuffs on your sight based rolls anymore.<br>And you gain proficiency in {@skill perception} if you didn’t have that already."]},
		{"name": "Actor","entries":["You gain Advantage on {@skill deception} and {@skill performance} checks if you imitate someone else.<br>You can also imitate someone else’s voice quite well. You can make this mimicked voice almost identical if you heard someone talk for at least a conversation. Just a few words or a sentence sadly isn’t enough."]},
		{"name": "Mass Panic Debater","entries":["You gain proficiency in {@skill deception}, or expertise if you were already proficient. You also gain advantage on speech based {@skill deception} rolls."]},
		{"name": "Nonstop Debater","entries":["You gain proficiency in {@skill intimidation}, or expertise if you were already proficient. You also gain advantage on speech based {@skill intimidation} rolls."]},
		{"name": "Rapid Reloader","entries":["You can now reload your weapon in a single action instead of it taking up two."]},
		{"name": "Argument Armementer","entries":["You gain proficiency in {@skill performance}, or expertise if you were already proficient. You also gain advantage on speech based {@skill performance} rolls."]},
		{"name": "Scrum Debater","entries":["You gain proficiency in {@skill persuasion}, or expertise if you were already proficient. You also gain advantage on speech based {@skill persuasion} rolls."]},
		{"name": "3L1T3 H4XXOR","entries":["You gain proficiency in {@skill computers}, or expertise if you were already proficient."]},
		{"name": "Alert","entries":["You gain +5 Initiative (or your side gets +2 Initiative when using side Initiative) and you cannot get surprised. Also, no one gets advantage on an attack roll on you just because they are hidden."]},
		{"name": "Heavy Lifter","entries":["Your carrying capacity (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks that you make to push, pull, lift, or break objects. Also, your maximum Strength Score is increased by 2."]},
		{"name": "Charger","entries":["You can use your Bonus Action when you Dashed this turn to push someone an extra 2 meters away if you win a Strength Contest with them. If you melee attack after you Dashed this turn and ran straight for at least 2 meters, than your attack gains +4 Damage."]},
		{"name": "Linguist","entries":["You know all languages that are often spoken by the common species, which are Common, Engi, Mantis, Musi, Rockmen, Turian. You also understand Zoltan, but you can't really speak it because of how the language sounds.<br>You can also make ciphers. You can learn others how to decipher them or they need to make an Intelligence Check against a DC of your Intelligence Score + Proficiency Bonus."]},
		{"name": "Mobile","entries":["Your movement speed is increased by 1 meter. Also, you now ignore difficult terrain if you Dash."]},
		{"name": "Observant","entries":["You can lipread humanoids who speak a language you know. You also gain +2 on your {@skill perception}, {@skill investigation} and {@skill insight}."]},
		{"name": "Sharpshooter",			"entries":["Attacks with guns at a longer range than they are designed for don’t put Disadvantage on your attack rolls anymore. You can also do a special attack that give you -6 on your attack roll, and +3 on your damage roll."]},
		{"name": "Sharpshooter",			"entries":["Attacks with guns at a longer range than they are designed for don’t put Disadvantage on your attack rolls anymore. You can also do a special attack that give you -6 on your attack roll, and +3 on your damage roll."]},
		{"name": "Skulker","entries":["You don’t lose your stealth when you miss with a melee attack, or with a silenced and not energy based gun. You now also gain 1 extra AC from any type of cover."]},
		{"name": "Tavern Brawler","entries":["You gain proficiency with improvised weapons and fists. Your fists now also do 1d4 + Strength Modifier damage."]},
		{"name": "Tough","entries":["You gain +1 HP per level. (This does work retroactively)"]},
		{"name": "Skilled Pilot","entries":["You now know how most FTL engines work. You also gain proficiency in using Standard FTL, Energenetic Warp and Standard Impulse of non-specialized ships if you didn’t have that already."]},
		{"name": "Fanboy","entries":["You know self-proclaimed knowledge about stuff of this multiverse. You can choose a game or category and you are in character allowed to know everything you know as a player. The DM won’t correct you if you are wrong in this Canon however."]},
		{"name": "Critical Eye","entries":["Your crit range with melee attacks is now 1 lower, making you crit on a 19 and 20, or even lower if you have other abilities that do this."]},
		{"name": "Power Surge",			"entries":["You can steel yourself and try to push yourself to the limit when needed. Once per turn, you can choose to take an additional Action on top of your regular Action and Bonus Action. You can use this ability only once every day, or for 1 Exhaustion."]},
		{"name": "Quick Thinking",			"entries":["You have learned how to focus yourself more, and do more things in quick succession.<br>You gain 1 extra Bonus Action every turn."]},
		{"name": "Mobility Mastery",			"entries":["You gain 0.25 meter extra base Movement Speed."]},
		{"name": "Running Hell",			"entries":["You get used to running over obstacles that are in your way. You gain +1 meter movement, and obstacles (desks, benches, chairs, railings and the like) can be easily jumped over without the need of a Dexterity save. Also, your long jumps now also add your Dexterity modifier to the maximum distance. And you can now also use your Bonus Action to get up from being prone, instead of using your Action."]},
		{"name": "Extra Conditioning",			"entries":["You have adapted the way you move for the better, and have better conditioning than most people. You now have +1 meters movement. Also, while your climbing and swimming speed are still as slow as normal, it is a lot easier. Furthermore, climbing on hard to climb (not impossible to climb) surfaces has no impact on you and are as easy as any other climbable wall, and you won’t have any problems staying afloat when in water while you aren’t over encumbered. If that wasn’t enough, you gain advantage on your Constitution saves, and +1 DR."]},
		{"name": "Own Created Luck",			"entries":["You don’t trust fate to give you the luck you need, that’s why you need to take it into your own hands.<br>When you make a D20 roll and have Disadvantage on the roll, you can spend 2 ki points (or your current or next Bonus Action when you are Rogue Level 9 or above) to cancel the disadvantages for that roll."]},
		{"name": "Master Duelist",			"entries":["Your mastery of the blade lets you turn failure into success in combat. If you miss witha melee attack roll, you can roll it again with advantage. Once you do so, you can’t use this feature again until the turn after the next attack that you missed."]},
		{"name": "Predicted Movement",			"entries":["You are able to use your Reaction in your own turn to shoot with your pistol."]},
		{"name": "Suppressing the Bullets",			"entries":["You can use {@feat Faster Than His Shadow|CDPH} 12 times per rest before needing to roll attack rolls to hit. You also do this as a Free Action now, instead of using your Reaction."]},
		{"name": "Lightning Reflexes",			"entries":["If you use the Dash action and someone tries to hit you with a Reaction, then they automatically miss if the attack requires an attack roll. If the attack needs a roll for half vs full damage, you automatically take half without needing to roll.<br>This ability only works for one person, if multiple people attack you at the same time, you can choose which attack you dodge."]},
		{"name": "The Dance of the Handguns",			"entries":["You have learned to be more efficient and precise with your {@feat Knockback Propelled Parry Maneuvres|CDPH}. You don’t need to have shot last turn to use your {@feat Knockback Propelled Parry Maneuvres|CDPH} (although if you use it you still shoot an unaimed shot once while using the ability) and the AC bonus of {@feat Knockback Propelled Parry Maneuvres|CDPH} is increased to +5. Also, if you are dual wielding pistols with knockback, and you are attack with a melee attack while {@feat Knockback Propelled Parry Maneuvers|CDPH} is already used that turn, than you can use your Reaction to gain the AC bonus against all other melee attacks that turn.<br>You do need to fire once with both pistols to be able to do this, and these shots cannot be aimed."]},
		{"name": "Indomitable",			"entries":["You have gotten enough physical punishment to be able to go on even when you shouldn’t be able to. If your health gets dropped to or below 0, than you can choose to set it to 1 instead, and keep it on 1 until the start of the next turn.<br>You also gain 2 exhaustion when you use this ability, and you can only use it once per Rest."]},
		{"name": "Lifelight",			"entries":["You are able to partially ignore wounds that would normally be fatal.<br>When your health drops to or below 0, you have the choice to ignore the effects of getting in a critical state and the need to throw death saves. Instead, your max HP get halved, and you gain 3 exhaustion. You can choose to give in at any moment, going into a critical state and start rolling death saves. Your HP resets to 0 again when you are stable again. You cannot use {@feat Indomitable|CDPH} after you used this ability.<br>All negative effects are removed in a Rest except for the halving of your Max HP, which only gets healed again in a longer period of extended downtime that takes at least 2.5 days."]},
		{"name": "Useless Soul",			"entries":["You can now use 1.5 times your Strength Modifier and 1.5 times your Dexterity Modifier as your bonus for making an attack roll for punching."]},
		{"name": "Charismatic Appearance",			"entries":["Most people like your style. Whever it is because of your skills, or because of how you just are and behave, but it works wonders. Your Charisma score increase by 4, and the maximum of your Charisma score is now 30."]},
		{"name": "Auto Targeting","maintenance": 4,			"entries":["You can create an automatic targeter for your weapons. This attachments gives a +5 bonus on attack rolls and ignores most forms of Disadvantage that you can get on your attack rolls with this weapon. You can also use this attachment to force a 20 instead of rolling a D20 on an attack once per 2 hours. This “rolled” 20 isn’t a crit, nor can it be used together with {@feat Let’s Get Critical|CDPH}."]},
		{"name": "Nameless Confidence",			"entries":["You have learned how to hack into most mechanical creatures, like AI-driven machines or Robots. You can try and hack into these kind of creatures at a maximum range of 15 meters. To do this, you need to throw a {@skill computers} check against a DC that depends on the security and Intelligence of the AI. For comparison, the DC of your little helper against these kind of hacks is <i>it’s</i> Intelligence Score + <i>your</i> Intelligence Modifier.<br>You gain advantage on this roll if you can plug your computer with which you are hacking directly into the mechanical creature.<br>If you fail, nothing happens and you cannot try again until 2 hours have passed.<br>If you succeed, you can control the mechanical creature and what it does to an extent. You cannot change the possible AI that was controlling the thing, and said AI would know everything you are doing with the robot, but it can’t do anything for the next 2 hours.<br>While you are controlling it, it can be seen as a non-sapient Little Helper."]},
		{"name": "Energenetic Tesla Arc",			"entries":["Instead of using your instrument to play songs you learned from the Learnable Songs list to create their effects, you now can use your Energy to create a Tesla Arc made from your main Energy to play the songs and get their effects.<br>Using this ability uses 2 Energy to maintain."]},
		{"name": "Peppersteak",			"entries":["You have learned to sense energenetic flow in the background dimension, and with this, can feel things coming that you wouldn’t normally be able to.<br>If someone teleports to inside melee range or from within melee range of you with {@feat Trans-Localized Manipulation|CDPH} or {@feat Energenetic Evasion Reflex|CDPH}, than you can use your Reaction to try and hit them. They gain no AC or DR from their armor if you try to hit them this way.<br>You can also feel and try to hit people who use one of these abilities to teleport past you from outside to outside your melee range, as long as the line between their start and end point comes within melee range of you.<br>Also, you can now feel Full-Energenetic beings that are invisible and hit them with energenetic based attacks or melee attacks if you would come across any."]},
		{"name": "Useless Mind",			"entries":["You can now add both your Strength Modifier and your Dexterity Modifier as damage bonusses for punching."]},
		{"name": "Injector Injector","maintenance": 3,			"entries":["You can create a semi-automatic SMG like gun that can shoot Injectors that you can make with abilities in the Doctor Class. If you try to shoot someone who is fine with getting hit with it and didn’t attack last turn, you don’t need to make an attack roll. Otherwise, you do need to make an attack roll and you are proficient with it. This gun has the following stats:<br>Weapon Type: Injector Rifle<br>Minimum Effective Range (m):0<br>Maximum Effective Range (m):15<br>Maximum Total Range (m):30"]},
		{"name": "Find the Exit",			"entries":["You have learned to flow while playing songs, to the point that most forms of harm just avoid you just by luck and fate alone.<br>While playing a song, you can choose to use all your other Actions and Bonus Actions of the turn to remove all your DR this turn. When you do so, all said removed DR can be added to your current AC until the start of next turn.<br>If you play the song Megalovanaiacal Funk (Learnable Songs) on Level 4, than you can choose to ignore the current Level 4 effect. Instead of being able to play another song at the same time, you will be unable to be hit by anything that isn’t a critical hit or area of effect, and the Level 3 effect of the song still affects you."]},
		{"name": "Reflectation",			"entries":["You can use your Reaction to defend yourself or deflect something shot at you when you are hit by a ranged attack of a not Laser based gun. Youneed to be wielding a melee weapon to do this.<br>When you do so, the damage you take from the attack is reduced by 1D10 + Dexterity Modifier + Monk Level + Martial Fighter Level.<br>If you reduce the damage to 0, you can do the following depending on the situation:<br>It the ranged attack was a solid object, like that from a Coil or Pressure based gun, than you can reflect it. You can choose where or to who you reflect it. If you do this, you need to make a melee attack roll with your weapon with disadvantage.<br>You also need to make a ranged damage roll, which has the same base damage as the attackwhich you reflected.<br>If the attack is a heap of plasma, like that from Plasma based guns, and you have a melee weapon which conducts electricity, than you can store the static electricity from the attack into your weapon. You can add the base damage of the ranged attack to your next melee attack, and the bonus damage’s type is electric. This static electricity also dissipates after 5 minutes, or if the electricity conducting part of the weapon hits a surface that conducts electricity as well."]},
		{"name": "Flow of Battle",			"entries":["You are able to use the momentum of battle to your advantage, and focus on it to increase your effectiveness when fighting.<br>After every consecutive turn wherein you make a melee attack against an hostile opponent, you gainone Flow. If you have Rage (Barbarian) and are in this rage, your Flow increases by two instead.<br>When you end a turn wherein you did not made a melee attack against an hostile opponent, then your Flow resets to 0.<br>On melee attacks, you gain a {@dice 1d4} bonus on your Attack Roll and Damage Roll for every two Flow you have."]},
		{"name": "Defensive Flow",			"entries":["You have learned to use your Flow to use it more defensively. You gain 1 DR and 1 AC against every creature you melee attacked last turn for every Flow you have.<br>Also, you can freely use 3 Flow to dodge a nonarea-of-effect attack completely. You need to do this before the outcome of the attack."]},
		{"name": "Mobile Flow",			"entries":["You have learned how to use your Flow to become more mobile. You gain 0.5 meter extra movementfor every Flow that you have.<br>If you have 2 Flow or more, you gain advantage on Strength and Dexterity Saving Throws against attacks from the creatures you melee attacked last turn. If you have 3 Flow or more, you and these creatures also gain advantage on Strength andDexterity Saving throws against anything that isn’t an attack."]},
		{"name": "Abserdation Mastery",			"entries":["<i>Mastery</i><br><br>Your Proficiency Bonus goes up by 1."]},
		{"name": "Nanomachines","maintenance": 3,			"entries":["You can now create an Injection of healing {@item Nanomachines|CDPH}"]}]}
